[
    "The suffix -onym (from Ancient Greek: ὄνυμα, lit. 'name') is a bound morpheme, that is attached to the end of a root word, thus forming a new compound word that designates a particular class of names. In linguistic terminology, compound words that are formed with suffix -onym are most commonly used as designations for various onomastic classes. Most onomastic terms that are formed with suffix -onym are classical compounds, whose word roots are taken from classical languages (Greek and Latin).For example, onomastic terms like toponym and linguonym are typical classical (or neoclassical) compounds, formed from suffix -onym and classical (Greek and Latin) root words (Ancient Greek: τόπος / place; Latin: lingua / language). In some compounds, the -onym morpheme has been modified by replacing (or dropping) the \"o\". In the compounds like ananym and metanym, the correct forms (anonym and metonym) were pre-occupied by other meanings. Other, late 20th century examples, such as hypernym and characternym, are typically redundant neologisms, for which there are more traditional words formed with the full -onym (hyperonym and charactonym).\nThe English suffix -onym is from the Ancient Greek suffix -ώνυμον (ōnymon), neuter of the suffix ώνυμος (ōnymos), having a specified kind of name, from the Greek ὄνομα (ónoma), Aeolic Greek ὄνυμα (ónyma), \"name\". The form -ōnymos is that taken by ónoma when it is the end component of a bahuvrihi compound, but in English its use is extended to tatpuruṣa compounds.\nThe suffix is found in many modern languages with various spellings. Examples are: Dutch synoniem, German Synonym, Portuguese sinónimo, Russian синоним (sinonim), Polish synonim, Finnish synonyymi, Indonesian sinonim, Czech synonymum.\nAccording to a 1988 study of words ending in -onym, there are four discernible classes of -onym words: (1) historic, classic, or, for want of better terms, naturally occurring or common words; (2) scientific terminology, occurring in particular in linguistics, onomastics, etc.; (3) language games; and (4) nonce words. Older terms are known to gain new, sometimes contradictory, meanings (e.g., eponym and cryptonym). In many cases, two or more words describe the same phenomenon, but no precedence is discernible (e.g., necronym and penthonym). New words are sometimes created, the meaning of which duplicating existing terms. On occasion, new words are formed with little regard to historical principles.\n\n\n== Words that end in -onym ==\n\nacronym: considered to be a \"word\" in its original sense formed from the initials of one or more words that is pronounceable like a normal word, such as NATO, sometimes in distinction to initialism; reflecting a historical development from its component word initials\nagoronym: a name of a square or a marketplace.\nagronym: a name of a field or a plain.\nallonym: an author's name of another person's, often a well-known person's, name; an alternative term for a pseudonym\nanacronym: an acronym so well-established that its origin as an abbreviation is no longer widely known and its component initials are in danger of no longer being recognized (a blend of anachronism and acronym)\nandronym: a male name, or a man's name adopted by a woman as a pseudonym.\nanonym: something created anonymously, or its creator; an unknown author; this term now generally replaced by pseudonym\nanemonym: name of a hurricane or violent wind\nanepronym: a portmanteau of anacronym and eponym; an original eponym of a trademark term that becomes so well established that it is used to define other objects that share its own definition (e.g., aspirin)\nanthroponym: a proper name of a human being, individual or collective.\nanthropotoponym: a type of toponym (place name) that is derived from an anthroponym\nantonym: a word with the exact opposite meaning of another word; an antithesis: often shown in opposite word pairs such as \"high\" and \"low\" (compare with \"synonym\")\napronym: a word which, as an acronym or backronym, has a meaning related to the meaning of the words constituting the acronym or backronym; such as PLATO for \"Programmed Logic for Automated Teaching\" alluding to Plato, the philosopher and teacher\naptronym: a name appropriate to its owner's occupation or physical properties, such as \"Goldsmith\" or \"Longman\" (compare with \"charactonym\") — coined by Franklin P. Adams\nasteroidonym: a proper name of an asteroid.\nastionym: a name of a town or city.\nastronym: a name of a star (or more loosely of a constellation, or other heavenly body).\nautoethnonym: an ethnonym of endonymic (native) origin, created and used by an ethnic group as a self-designation (see also: endoethnonym).\nautoglossonym or autoglottonym: a glossonym / glottonym (language name) of endonymic (native) origin, created and used by native speakers as a designation for their language.\nautolinguonym: a linguonym (language name) of endonymic (native) origin, same as autoglossonym / autoglottonym (see also: endolinguonym).\nautonym: Botanical nomenclature for an automatically created name. Not to be confused with onomastic autonym, formerly used as a variant term for endonym.\nbackronym: an ordinary word understood as an (usually amusing or ironic) acronym (a portmanteau of back + acronym), such as Fiat understood as \"Fix It Again Tomorrow\"\nbasionym: the first name published for a biological taxon (species, genus, etc.), which remains the defining name for the taxon even when the taxon has been transferred to a new name\ncaconym: a bad name, either from poor formation (as through mixing Greek and Latin) or unpleasantness (as through lengthiness or cacophony)\ncapitonym: a word that changes its meaning (and sometimes pronunciation) when it is capitalized, such as March and march or Polish and polish.\ncharactonym: a name of a fictional character reflected in his personality traits, such as Shakespeare's Pistol or Bottom (compare with \"aptronym\")\nchoronym: a proper name of a region or a country.\nchrematonym: a proper name of a particular (unique) object, natural or artificially made. For example: Hope Diamond (proper name of a famous diamond), Bayeux Tapestry (proper name of a famous tapestry), or Wanamaker Organ  (proper name of a famous musical instrument).\nchresonym: Biol. use of a taxonomic name; historically sometimes referred to as a synonym. Sometimes divided into orthochresonyms (correct usages) and heterochresonyms (names incorrectly applied).\nchrononym: a proper name of a time period, like the Bronze Age, or the Middle Ages.\ncometonym: a proper name of a comet.\ncomonym: a name of a village.\ncosmonym: a proper name of a cosmic feature, outside Earth.\ncontronym or antagonym or autoantonym: a word that may have opposite meanings in different contexts, such as cleave meaning \"stick together\" or \"split apart\"\ncryptonym: a code name; a word or name used clandestinely to refer to another name or word\ndemonym: a name, derived from a place name, for residents of that place (e.g., Utahn, from Utah, or Sioux Cityan, from Sioux City) — coined by George H. Scheetz, according to Paul Dickson in What Do You Call a Person From...? A Dictionary of Resident Names. The term first appeared in print in 1988 in Names' Names: A Descriptive and Prescriptive Onymicon by George H. Scheetz. See also taxonym.\ndromonym: a name of a road or any other communication or transport route by land, water or air.\ndrymonym: a proper name of a wood or forest.\necclesiastonym: a name referring to members of a religious entity, e.g. Methodist, Protestant, Rastafarian, Wiccan (from Greek ekklisiastís 'churchgoer')\necclesionym: a name of a church.\nendochoronym: a choronym (regional or country name) of endonymic (native) origin, created and used by native population as a designation for their region or country.\nendoethnonym: an ethnonym of endonymic (native) origin, created and used by an ethnic group as a self-designation (see also: autoethnonym).\nendolinguonym: a linguonym (language name) of endonymic (native) origin, created and used by native speakers as a designation for their language (see also: autolinguonym).\nendonym: a self-assigned name by locals of a place, or a group of people; formerly also known as autonym, but that term is polysemic (not to be confused with the autonym in botany).\nendotoponym: a type of toponym (place name) of endonymic (native) origin, created and used by native population as a designation for some toponymic feature in their homeland.\neponym: a botanical, zoological, artwork, or place name that derives from a real or legendary person; a name for a real or hypothetical person from whom a botanical, geographical, artwork or zoological name is derived; a person after whom a medical condition is named, or the condition so named. A type of taxonym.\nergonym: a name of an incorporated work-oriented entity, like a workshop, company or any firm in general.\nethnochoronym: a choronym derived from an ethnonym.\nethnohydronym: a hydronym that is formed from an ethnonym.\nethnonym: a name of an ethnic group.\nethnotoponym: a type of toponym that is formed from an ethnonym.\nexochoronym: a choronym (regional or country name) of exonymic (foreign) origin, created and used by those who don't belong to the native population of a referred territory.\nexoethnonym: an ethnonym of exonymic (foreign) origin, created and used as a designation for an ethnic group by those who do not belong to it.\nexolinguonym: a linguonym (language name) of exonymic (foreign) origin, created and used by those who are not native speakers of that language.\nexonym: a name used by one group of people for another group, but who call themselves by a different name, such as \"Germans\" for \"Deutsche\"; a place name used by one group that differs from the name used by the people who live there, such as \"Cologne\" for \"Köln\".\nexotoponym: a type of toponym (place name) of exonymic (foreign) origin, created and used by those who don't belong to the native population of a region in which  the referred toponymic feature is located.\ngamonym: a name bestowed as a consequence of marriage. Judy Jones married Count Stephen Smith: her gamonyms include Mrs. Stephen Smith, Judy Smith, and Countess Smith.\ngeonym: a name of a geographic feature, on Earth.\nglacionym: a name of a glacier.\nglossonym or glottonym: a name of a language\ngynonym: a female name, or a woman's name adopted by a man as a pseudonym.\nhagionym: a name of a saint.\nhagiotoponym: a type of toponym (place name) derived from a hagionym (name of a saint).\nhelonym: a name of a swamp, marsh, or bog.\nheterochresonym: (biological taxonomy) see chresonym.\nheteronym: a word that is spelled in the same way as another but that has a different sound and meaning, for example \"bow\" as in \"bow of a ship\" or \"bow and arrow\" (compare \"homonym\")\nhodonym: a name of a street or road (also odonym).\nholonym: a word for the whole of which other words are part, in the way house contains roof, door and window; or car contains steering-wheel and engine (compare \"meronym\")\nhomonym: 1: a: a word pronounced like another, but differing in meaning or derivation or spelling—also known as homophone (to, too, two). b: a word spelled like another, but differing in derivation or meaning or pronunciation—also known as homograph or heteronym (lead, to conduct, and lead, the metal). Compare autantonym, contronym, and heteronym. c: a word spelled and pronounced like another, but differing in meaning (pool of water, and pool, the game). 2: a namesake. 3: Biol. a taxonomic designation that is identical to another one of the same rank, but based on a different type; only one of the homonyms is considered a valid designation (see homonym (biology)). Compare to synonym.\nhydronym: a name of river, lake, sea or any other body of water.\nhypernym: sometimes spelled hyperonym, a generic word that stands for a class or group of equally ranked items, such as \"tree\" for \"beech\" or \"elm,\" or \"house\" for \"chalet\" or \"bungalow.\" A hypernym is said to be \"superordinate\" to a hyponym.\nhypocoronym, hypocorism, or hypocoristic: a colloquial, usually unofficial, name of an entity; a pet-name or \"nickname\"\nhyponym: an item that belongs to and is equally ranked in a generic class or group, for example \"lily\" or \"violet\" in the class of \"flowers\"; or \"limousine\" or \"hatchback\" in the class of \"automobiles.\" A hyponym is said to be \"subordinate\" to a hyperonym.\ninsulonym: a name of an island.\nisonym: 1: a word having the same root or stem as another — also known as paronym. Compare exonym, heteronym, paronym, and synonym. 2: one person's surname that is the same as another person's surname. 3: Biol. a taxonomic designation that is identical to another designation, and based on the same type, but published at a different time by the same or other authors (see isonym (taxonomy)).\nlimnonym: a name of a lake or a pond.\nlogonym: a polysemic term, with several meanings.\nlinguonym: a name of a language\nmacrotoponym: a type of toponym that designates an important toponymic feature, that has a wider (regional, national, continental, global) significance.\nmeronym: a word that names a part that belongs to and is therefore subordinate to a larger entity; a part-whole relationship, such as \"door\" or \"window\" in \"house\", or \"engine\" or \"steering-wheel\" in \"car\" (compare \"holonym\")\nmeteoronym: a proper name of a meteor.\nmetonym: a word that substitutes a part for the whole it is associated with, for example \"crown\" for \"monarch\"; metonymy is the figure of speech incorporating a metonym\nmatronym or matronymic: a name of a human being making reference to that person's mother (contrast \"patronym\")\nmononym: a word indicating the \"single name\" as generally applied to people e.g. Madonna or Plato.\nmorphonym: a name of a taxonomic species.\nmicrotoponym: a type of toponym that is used locally, as designation for some toponymic feature that has only a local significance.\nnecronym: a reference to or name of a person who has died.\nnumeronym: is a number-based word.\noceanonym: a name of an ocean.\nodonym: a name of a street or road (also hodonym).\noikonym, also (Latinized) oeconym or econym: a name of a house or other building.\noronym: 1: a name of a hill, mountain, or mountain-range; 2: a neologism for same-sounding (homophonic) words or phrases.\northochresonym: (biological taxonomy) see chresonym.\npaedonymic: a name adopted from one's child's name, as in the kunya of Islamic names or when one is identified by means of one's child's name (\"Tim's dad\").\nparonym: a word that is related to another word and derives from the same root; a cognate word, such as dubious and doubtful\npatronym or patronymic: a name adopted from the father's or ancestor's name, for example \"Johnson\" from \"John,\" \"MacDonald\" from \"Donald,\" \"O'Brien\" from \"Brien,\" or \"Ivanovich\" from \"Ivan\"\npelagonym: a name of a sea.\nphaleronym: a name of a medal, or any other honorary decoration.\nphantonym: a word that looks like it would mean one thing, when in reality it means something completely different. Such as \"noisome\" meaning \"smelly\" or \"unhealthy\" and not \"noisy\".\nphytonym: a name of an individual plant.\nplanetonym: a proper name of a planet.\nplesionym or near-synonym: word that is almost synonymous with another word, but not quite\npoetonym: a fictional or literary name\npolitonym: a name referring to members of a political entity\npotamonym: a name of a river or a stream.\nprosoponym: a personal name; full name of an individual person.\npseudonym: a false and fictitious name, especially one adopted by an author; a pen name\nretronym: a compound or modified noun that replaces an original simple noun, for example \"analog watch\" now means what \"watch\" used to mean before the invention of the digital watch, and motorcycles became \"solo motorcycles\" when others were built with sidecars\nspeleonym: a name of a cave or some other subterranean feature.\nsynonym: 1: a word equivalent in meaning or nearly so to another word; a word that may be substituted for another word that has the same or a similar meaning, such as near and close (compare \"antonym\"). 2: In Biology, one or more names given to the same taxon, and so considered equivalent. Usually, only one of them is considered as correct (senior synonym in animal taxonomy, accepted name in plant taxonomy), while the other are considered deprecated (see synonym (taxonomy)).\ntautonym: a binomial or scientific name in the taxonomy of living things in which the generic and specific names are the same, such as Gorilla gorilla; a scientific name in which the specific name is repeated, such as Homo sapiens sapiens as distinct from Homo sapiens neanderthalensis; a noun component that is repeated, such as aye-aye or tom-tom; a personal name where both forename and surname are identical, such as Francis Francis\ntaxonym: a name used for classification or identification purposes, usually signifying a relationship to something. Taxonyms include binomens, names of clades or taxas, demonyms, ethnonyms, and eponyms. Examples include canine, hominid, and Dryad.\nteknonym: a name that refers to a parent by the name of one of their children.\ntextonym: a word that is generated by a single sequence of numerals keyed in to a mobile telephone; for example, 726 produces pam, ram, sam, and ran. Also called homonumeric words.\ntheonym: a name of a god or a goddess. The names societies give their gods at times is useful in understanding the origin of their language as well as their view of a particular deity. Analysis of theonyms has been useful in understanding the connections of Indo-European languages, and possibly their religions, in particular. In Abrahamic faiths the origin and meaning of the Tetragrammaton is sometimes deemed to have important historical or even metaphysical meaning.\ntheronym: a name — especially a product name — that has been derived from the name of an animal.\ntopoanthroponym: an anthroponym that is derived from a toponym.\ntopoethnonym: an ethnonym that is derived from a toponym.\ntoponym: a place or geographical name; the name of an area of the body, as distinguished from the name of an organ\ntroponym: a verb conveying a meaning that is a particular case of the meaning of another verb. For example, to duel is a troponym of to fight; to write is a troponym of to communicate; etc.  The concept of troponym is to verbs as that of hyponym is to nouns.\nurbanonym: a name of an urban element (street, square etc.) in towns and cities.\nzoonym: a name of an animal.\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== Further reading ==\nBrown, A. F. (1963). Normal and Reverse English Word List. Vol. 1–8. Philadelphia: University of Pennsylvania.\nHerbst, Richard C. (1979). Herbst's Backword Dictionary for Puzzled People. New York: Alamo Publishing Company.\nLehnert, Martin (1971). Reverse Dictionary of Present-Day English. Leipzig: Verlag Enzyklopädie.\nLaurence Urdang, ed. (1981). -Ologies & -Isms: A Thematic Dictionary (2nd ed.). Detroit: Gale Research Company.\n\n\n== External links ==\n\nWords That End In nym : Words That End With nym\nNym Words\nOnyms"
]