[
    "Pyramid is an American game show franchise that has aired several versions domestically and internationally. The show was developed by Bob Stewart. The original series, The $10,000 Pyramid, debuted on March 26, 1973, and spawned seven subsequent Pyramid series. Most later series featured a full title format matching the original series, with the title reflecting an increasing top prize. The game features two contestants, each paired with a celebrity. In the game, the contestants and celebrities attempt to identify words or phrases through clues given by their teammates. The title refers to the show's pyramid-shaped gameboard, featuring six categories arranged in a triangular fashion. The various Pyramid series have won a total of nine Daytime Emmys for Outstanding Game Show, second only to Jeopardy!, which has won 13.\nDick Clark is the host most commonly associated with the show, having hosted the network daytime version from 1973 to 1980 (which moved from CBS to ABC in 1974, and increased its namesake top prize from $10,000 to $20,000 in 1976) and The (New) $25,000 Pyramid from 1982 to 1988 on CBS. Clark also hosted two weeknight syndicated versions, The $50,000 Pyramid in 1981 and The $100,000 Pyramid from 1985 to 1988 (concurrent with the daytime show).\nBill Cullen hosted the first weekly nighttime version of The $25,000 Pyramid from 1974 to 1979. John Davidson hosted The $100,000 Pyramid in 1991, and Donny Osmond hosted a version simply titled Pyramid from 2002 to 2004; both aired five episodes per week. Game Show Network's The Pyramid, hosted by Mike Richards, who was an executive at format owner Sony Pictures Television, aired a single forty-episode season in 2012.\nThe current incarnation of The $100,000 Pyramid debuted June 26, 2016, on ABC with Michael Strahan as host. It has aired on Sunday nights during the summer months since, completing its fourth season in September 2019. On November 20, 2019, the series was renewed for a fifth season, which premiered on May 26, 2021. On January 6, 2022, The $100,000 Pyramid renewed for a sixth season and the show moved from New York to Los Angeles. The sixth season premiered on July 10, 2022.\n\n\n== Gameplay ==\nThe Pyramid's gameboards, both in the main game and in the Winners' Circle bonus round, feature six categories arranged in a triangle (referred to as a pyramid), with three on the bottom row, two on the middle row, and one on the top. Most variations of gameplay feature two teams, each composed of a contestant and a celebrity.\n\n\n=== Main game ===\nAt the beginning of the game, the teams are shown six categories. Once the category is chosen, its exact meaning is given unless there is a bonus element that requires obscuring the category. One member of the team is then given a list of words or phrases that fit the category (displayed on a monitor before that team member), and must describe each to his or her partner within a time limit. The team member giving the clues may use any form of verbal clue that does not contain the answer (for example, using \"high up\" for \"height\"); non-verbal clues such as pantomime are also accepted. One point is scored for each item correctly guessed, and words for which illegal clues are given are eliminated from play. Each category usually consists of seven words or phrases. If a team is stuck on a word or phrase, they may pass and may go back to that word or phrase, provided if there is any time left.\nEach team alternates playing a category until all six have been played, although it is possible for a category to go unplayed if one team is so far behind that they cannot score enough points to catch up. In addition, the teams alternate in each round of play as to whether the celebrity or the contestant gives the clues.\nOn most versions of the show, in the event of a tie, the host offered the team who created the tie a choice between two letters of the alphabet. That team then played a round consisting entirely of words beginning with that letter, after which the opposing team played words beginning with the other letter. The tie was then broken by whichever team achieved more points or, if both teams successfully played all seven words in a shorter amount of time. For most versions airing in the 1980s, an additional $5,000 cash bonus was awarded for breaking a tie if both teams achieved perfect 21 scores prior to the tiebreaker. On the 2010s version, a tie is broken by whichever team achieved their total points in a faster amount of time.\nAfter a round of gameplay, the higher-scoring team proceeds to the show's bonus round, known as the Winner's Circle. Once the Winner's Circle is completed, a new round of gameplay begins with the celebrities switching teams and a new selection of categories. After this round is completed, the winning team proceeds to the second and final Winner's Circle.\n\n\n==== Bonuses ====\nThe game board has often featured a number of spaces which award bonus prizes to the contestants.\nThroughout the 1970s, a random category during the main game doubled as the \"Big 7\", meaning that the contestant originally received a prize if all seven words were guessed correctly. Depending on the version of the show, the \"Big 7\" bonus could be a cash amount or a new car.\nBeginning in 1982, a random category in the second round was designated as the \"Mystery 7\", in which the host did not reveal the topic of the category until after the fact, and correctly guessing all seven words awarded a prize. This bonus feature was reinstated for the second round of the 2010s version.\nIn 1983, The $25,000 Pyramid introduced a new bonus space called the \"7-11\", which was randomly concealed behind a category in the first round of gameplay. If this was revealed, the team could elect to play for $1,100 cash if all seven words were guessed correctly, or $50 per correct word; the latter option was dropped in early 1985.\nThe 1991 version offered additional bonuses. \"Gamble for a Grand\"/\"Gamble for a Trip\" offered the choice to reduce the round's time limit from 30 to 25 seconds to win $1,000 cash or a trip, respectively, and \"Double Trouble\" offered the team 45 seconds to guess seven two-word responses for a $500 bonus.\nThe Donny Osmond-hosted version had only one bonus: \"Super Six\", which was featured in both games each day, and awarded an additional prize for guessing all six words in 20 seconds.\nOn the Game Show Network version, there were no bonuses, but correctly guessing all seven words in a category awarded a $500 bonus and added $5,000 to the Winner's Circle bank.\n\n\n=== Winner's Circle ===\nThe winning team from the main game plays the Winner's Circle, in which one player must describe six categories of increasing difficulty to their partner within sixty seconds by giving a short and concise list of items relating to each category in play. (For instance, the category \"things that clean\" could be described with clues such as \"soap\", \"a vacuum\", or \"a maid's broom\".) Which ever team member receives the clues is given credit so long as the key word of the category (\"clean\") is given. Although it has not been stated in official rules, since Strahan has been hosting, the contestant gives the clues, and the celebrity must guess the category. In prior versions of the show, celebrities usually gave the clues.The clue-giver may pass on a category and return to it after playing through all six if time remains on the clock. Giving an illegal clue removes the category from play and the team forfeits their chance at the top prize. These include using gestures; using any part of a key word in the category, a definition, or a direct synonym of it; using a prepositional phrase; or listing an item that does not fit the category. If all six categories are guessed before time runs out, the contestant partner wins the top prize; if not, he/she wins money for each category that is correctly guessed.\n\n\n== History ==\n\n\n=== Broadcast history ===\n\n\n==== The $10,000 Pyramid ====\n\nOn March 26, 1973 (1973-03-26), The $10,000 Pyramid (equivalent to $66,000 in 2022), with host Dick Clark, made its network debut and was a ratings hit, sustaining its ratings even when episodes were delayed or preempted by the Watergate hearings. A year later, the ratings temporarily declined (against the original version of Jeopardy! on NBC) and CBS canceled it. The show was quickly picked up by ABC and began airing on that network on May 6, 1974. As per CBS custom at the time with celebrity game shows, three weeks of episodes for CBS were taped in Hollywood at Television City, Studio 31. The remainder of the CBS episodes originated in New York City at the Ed Sullivan Theater, moving to ABC's Elysee Theatre after Pyramid switched networks.\n\n\n==== The $20,000 Pyramid ====\nBeginning on January 19, 1976, the series doubled its top prize and was retitled The $20,000 Pyramid (equivalent to $103,000 in 2022). From October 1 to November 9, 1979, the series briefly became Junior Partner Pyramid, which scrapped the usual celebrity-contestant pairings in favor of children playing the game with a parent or other adult relative. Its last episode aired June 27, 1980, with Family Feud subsequently moving up a half-hour to take over the 12:00 noon (EST) slot formerly occupied by The $20,000 Pyramid.\n\n\n==== The (New) $25,000 Pyramid ====\n\nOn September 20, 1982, the series returned to the CBS daytime lineup as The (New) $25,000 Pyramid (equivalent to $76,000 in 2022), again with Clark as host, but now taped in Los Angeles full-time at CBS Television City's Studio 33 (currently used for The Price Is Right, now known as the \"Bob Barker Studio\") and remained there for the entire run up until December 31, 1987. Blackout began airing in the series' 10:00 a.m. timeslot the following Monday, but that show was canceled after 13 weeks of episodes. On April 4, 1988, The $25,000 Pyramid returned to the CBS daytime schedule, but only for 13 more weeks. The show's final episode aired on July 1. The following Monday, the show was replaced by Family Feud, hosted by Ray Combs.\n\n\n==== The $100,000 Pyramid ====\nConcurrent with the network show's run, several nighttime versions of the show were sold to local stations through syndication: the original $25,000 Pyramid and The $50,000 Pyramid were taped in the Elysee Theatre in New York, and both editions of The $100,000 Pyramid were taped at Television City. The Dick Clark-hosted episodes were taped in Studio 33 concurrently with the daytime $25,000 Pyramid, and the 1991 edition hosted by John Davidson was taped in Studio 31. Pyramid, hosted by Donny Osmond, ran from September 16, 2002 to September 10, 2004 and was taped at Sony Pictures Studios in Culver City, California. The Pyramid was taped at the CBS Studio Center.The current version of The $100,000 Pyramid, hosted by Michael Strahan, has been taped at the ABC Television Center in New York.In August 2020, production for season five of The $100,000 Pyramid resumed in New York City with new safety protocols and guidelines introduced; these guidelines include measures such as crew and contestants having their temperatures tested, Personal Protective Equipment (PPE) on-site, and social distancing measures. This season does not feature an in-studio audience due to the COVID-19 pandemic in the United States.\n\n\n=== Later developments ===\nIn late 1996, Sony Pictures Television (then-Columbia TriStar Television) produced a pilot for a new version of Pyramid, with Mark Walberg as host, which featured a format radically different from the earlier versions, including an increase of the number of celebrities to six, each of which would be assigned to a different main game subject. It did not sell, but Sony tried again the following year, this time with Chuck Woolery at the helm and a format closer to the original, although the six-celebrity motif from the previous pilot remained. This version also failed to sell, but two years later, after the success of its series Rock & Roll Jeopardy! on VH1, Sony attempted to give Pyramid similar treatment with a 1999 pilot called Pyramid Rocks. Hosted by Bil Dwyer, the format likewise attempted to incorporate music into the game, but proved no more successful than the previous two attempts at reviving the series.Following CBS's cancellation of Guiding Light in April 2009, Pyramid was one of three potential series considered as a replacement for the veteran soap opera. (Let's Make a Deal and The Dating Game as The New Dating Game or The Newlywed Game as The New Newlywed Game were the other two, with a pilot shot for the former series.) During the tapings that took place in June of that year at the Kaufman Astoria Studios in New York, the top prize was raised to a potential $1,000,000 with a tournament format similar to the $100,000 format.  Dean Cain and Tim Vincent were tapped as hosts of the pilots, with $50,000 announcer Alan Kalter returning, and Sony Pictures game show legend Ken Jennings served as a panelist in the pilots.CBS passed on Pyramid and opted to pick up Let's Make a Deal, hosted by Wayne Brady, as Guiding Light's replacement. Several months later, in December 2009, CBS announced the cancellation of another long-running soap opera, As the World Turns. Pyramid was once again among the series being considered as a potential replacement. CBS ordered a third pilot on April 9, 2010. Andy Richter was identified as a potential host.On May 18, 2011, TBS announced development of a possible new version of Pyramid, again to be hosted by Andy Richter. It was later announced that the show was not picked up.\nAnother pilot, titled The Pyramid, was taped on June 16, 2012. On July 12, 2012, GSN announced The Pyramid had been picked up and would premiere on the network on September 3, with Mike Richards hosting the show. The series ran for 40 episodes before being cancelled later in the year.\nOn January 9, 2016, ABC greenlit a new version of The $100,000 Pyramid, set to air during the summer of 2016. This version also marked the return of the show to New York City, where it had originally been produced in the 1970s. The first season comprised ten hour-long episodes, with Michael Strahan serving as host.  Each episode consists of two full games.  Two introductions and two closings are taped with ability to air either;  as with Celebrity Family Feud and Match Game, each game is its own 30-minute episode, and the introduction and closing aired depends if one game is the first or the second game to air in a single 60-minute block.The series premiered on June 26 of that year, airing as part of ABC's \"Sunday Fun & Games\" lineup at 9:00pm ET/8:00pm CT (along with the Steve Harvey-hosted Celebrity Family Feud and the Alec Baldwin-hosted Match Game). On August 4, 2016, ABC renewed The $100,000 Pyramid for a second season. On June 11, 2017, the show moved to 10/9 central in order to pair it up with the seed-funding reality competition show Steve Harvey's Funderdome along with the third season of Celebrity Family Feud. On August 6, 2017, ABC announced The $100,000 Pyramid was renewed for a third season. On June 10, 2018, the show moved back to its regular 9:00pm ET time slot. This was also paired up with the fourth season of Celebrity Feud hosted by Steve Harvey, along with the third season of To Tell the Truth hosted by Anthony Anderson. In this format, the host opens each show introducing the celebrity guests, each of whom then introduces his or her partner/contestant by first name only.\n\n\n== Conception ==\nTelevision producer Bob Stewart developed The $10,000 Pyramid in 1973. The show's format was adapted from an unsold television pilot Stewart had filmed earlier titled Cash on the Line.\n\n\n== Personnel ==\nBob Clayton was the series' original announcer and performed these duties until his death in 1979. Alan Kalter and Steve O'Brien shared the primary announcer role until The $50,000 Pyramid ended production in 1981. Substitutes included Fred Foy, John Causier, Dick Heatherton, Scott Vincent, and Ed Jordan.\nWhen the series was revived and production moved to California in 1982, Jack Clark became the announcer and held the position until 1985. Johnny Gilbert became the primary announcer for The $25,000 Pyramid while Charlie O'Donnell took the job for The $100,000 Pyramid when it launched that fall. Both Gilbert and O'Donnell substituted for each other on their respective series; other substitutes included Jerry Bishop, Rod Roddy, Bob Hilton, Charlie Tuna, and Dean Goss. In 1991, Gilbert and Goss were both featured announcers and frequent panelist Henry Polic II also announced for several weeks. John Cramer announced the 2002–04 version, and JD Roberto announced The Pyramid (2012). The 2016 ABC primetime version is announced by Brad Abelle.\nMike Gargiulo directed through 1981, with Bruce Burmester replacing him until the end of the 1991 version.The original theme tune was \"Tuning Up\" by Ken Aldin. In 1982, it was replaced by an original, similarly styled composition by Bob Cobert, which was also used in 1991. Barry Coffing and John Blaylock composed the theme and incidental music for the 2002–04 version, while Alan Ett composed a cover of Bob Cobert's 1982–91 theme for The Pyramid. Bleeding Fingers Music composed a separate cover of Cobert's theme for the 2016 version.\n\n\n== International versions ==\nThe British version was called The Pyramid Game and ran intermittently from 1981 to 1990, with Steve Jones as host. Donny Osmond hosted a short-lived incarnation in 2007, which used a similar set and the same music package as the 2002 American version.\nIn 2009, Sony created an Australian version of The Junior Partner Pyramid called simply Pyramid. This version was hosted by Shura Taft until 2012, with Graham Matters taking over the following year.\nA German version titled Die Pyramide aired on ZDF from 1979 to 1994, and was hosted by Dieter Thomas Heck. A new version aired on ZDFneo in 2012, and was co-hosted by Micky Beisenherz and Joachim Llambi.\nVersions in French, both titled Pyramide, were produced at different times in France and in Canada.\n\n\n== Home games ==\nThe first board game of The $10,000 Pyramid was released in 1974 by the Milton Bradley Company, with a total of eight editions produced through 1981. Beginning with the fourth edition, like its TV counterpart, the title and top payoff changed to The $20,000 Pyramid, while the final edition was titled The $50,000 Pyramid. However, due to concerns about players easily memorizing possible Winners' Circle subjects, the format of the board game's Winners' Circle endgame was changed to mirror that of the TV version's main game.Cardinal Games released a new home version of The $25,000 Pyramid in 1986, this time using the actual Winners' Circle rules and format, which was also given to all contestants who appeared on both the daytime and nighttime versions for most of 1987 and select 1988 episodes. This version was reissued in 2000 by Endless Games, which later released a new edition based on the Osmond version in 2003.The $100,000 Pyramid, a video game adaptation, was released in 1987. Developed and published by Box Office Software, it was originally released for Apple II and then ported to DOS and Commodore 64. Years later, Sierra Attractions released a new PC CD-ROM version of The $100,000 Pyramid in 2001, which was followed by a DVD game from MGA Entertainment in 2006.\nA version titled The $1,000,000 Pyramid was released by Ubisoft for the Nintendo Wii in 2011.\n\n\n== References ==\n\n\n=== Sources ===\n\n\n== External links ==\nOfficial website (ABC, 2016)\nProduction website\nOfficial website (GSN, at the Wayback Machine)\nThe $10,000 Pyramid on IMDb\nThe $25,000 Pyramid on IMDb\nThe $100,000 Pyramid (1985) on IMDb\nPyramid (2002) on IMDb\nThe Pyramid on IMDb\nThe $100,000 Pyramid (2016) on IMDb"
]