[
    "The Dewey Decimal Classification (DDC), colloquially known as the Dewey Decimal System, is a proprietary library classification system which allows new books to be added to a library in their appropriate location based on subject. \nIt was first published in the United States by Melvil Dewey in 1876. Originally described in a 44-page pamphlet, it has been expanded to multiple volumes and revised through 23 major editions, the latest printed in 2011. It is also available in an abridged version suitable for smaller libraries. OCLC, a non-profit cooperative that serves libraries, currently maintains the system and licenses online access to WebDewey, a continuously updated version for catalogers.\nThe decimal number classification introduced the concepts of relative location and relative index. Libraries previously had given books permanent shelf locations that were related to the order of acquisition rather than topic. The classification's notation makes use of three-digit numbers for main classes, with fractional decimals allowing expansion for further detail. Numbers are flexible to the degree that they can be expanded in linear fashion to cover special aspects of general subjects. A library assigns a classification number that unambiguously locates a particular volume in a position relative to other books in the library, on the basis of its subject. The number makes it possible to find any book and to return it to its proper place on the library shelves. The classification system is used in 200,000 libraries in at least 135 countries.\n\n\n== History ==\n\n\n=== 1873–1885: early development ===\nMelvil Dewey (1851–1931) was an American librarian and self-declared reformer. He was a founding member of the American Library Association and can be credited with the promotion of card systems in libraries and business. He developed the ideas for his library classification system in 1873 while working at the Amherst College library. He applied the classification to the books in that library, until in 1876 he had a first version of the classification. In 1876, he published the classification in pamphlet form with the title A Classification and Subject Index for Cataloguing and Arranging the Books and Pamphlets of a Library.\nHe used the pamphlet, published in more than one version during the year, to solicit comments from other librarians. It is not known who received copies or how many commented as only one copy with comments has survived, that of Ernest Cushing Richardson. His classification system was mentioned in an article in the first issue of the Library Journal and in an article by Dewey in the Department of Education publication Public Libraries in America in 1876. In March 1876, he applied for, and received, copyright on the first edition of the index. The edition was 44 pages in length, with 2,000 index entries, and was printed in 200 copies.\n\n\n=== 1885–1942: period of adoption ===\nThe second edition of the Dewey Decimal system, published in 1885  with the title Decimal Classification and Relativ Index for arranging, cataloging, and indexing public and private libraries and for pamflets, clippings, notes, scrap books, index rerums, etc., comprised 314 pages, with 10,000 index entries. Five hundred copies were produced. Editions 3–14, published between 1888 and 1942, used a variant of this same title. Dewey modified and expanded his system considerably for the second edition. In an introduction to that edition Dewey states that \"nearly 100 persons hav [spelling of 'have' per English-language spelling reform, which Dewey championed] contributed criticisms and suggestions\".One of the innovations of the Dewey Decimal system was that of positioning books on the shelves in relation to other books on similar topics. When the system was first introduced, most libraries in the US used fixed positioning: each book was assigned a permanent shelf position based on the book's height and date of acquisition. Library stacks were generally closed to all but the most privileged patrons, so shelf browsing was not considered of importance. The use of the Dewey Decimal system increased during the early 20th century as librarians were convinced of the advantages of relative positioning and of open shelf access for patrons.New editions were readied as supplies of previously published editions were exhausted, even though some editions provided little change from the previous, as they were primarily needed to fulfill demand. In the next decade, three editions followed closely on: the 3rd (1888), 4th (1891), and 5th (1894). Editions 6 through 11 were published from 1899 to 1922. The 6th edition was published in a record 7,600 copies, although subsequent editions were much lower. During this time, the size of the volume grew, and edition 12 swelled to 1,243 pages, an increase of 25% over the previous edition.In response to the needs of smaller libraries which were finding the expanded classification schedules difficult to use, in 1894, the first abridged edition of the Dewey Decimal system was produced. The abridged edition generally parallels the full edition, and has been developed for most full editions since that date. By popular request, in 1930, the Library of Congress began to print Dewey Classification numbers on nearly all of its cards, thus making the system immediately available to all libraries making use of the Library of Congress card sets.Dewey's was not the only library classification available, although it was the most complete. Charles Ammi Cutter published the Expansive Classification in 1882, with initial encouragement from Melvil Dewey. Cutter's system was not adopted by many libraries, with one major exception: it was used as the basis for the Library of Congress Classification system.In 1895, the International Institute of Bibliography, located in Belgium and led by Paul Otlet, contacted Dewey about the possibility of translating the classification into French, and using the classification system for bibliographies (as opposed to its use for books in libraries). This would have required some changes to the classification, which was under copyright. Dewey gave permission for the creation of a version intended for bibliographies, and also for its translation into French. Dewey did not agree, however, to allow the International Institute of Bibliography to later create an English version of the resulting classification, considering that a violation of their agreement, as well as a violation of Dewey's copyright. Shortly after Dewey's death in 1931, however, an agreement was reached between the committee overseeing the development of the Decimal Classification and the developers of the French Classification Decimal. The English version was published as the Universal Decimal Classification and is still in use today.According to a study done in 1927, the Dewey system was used in the US in approximately 96% of responding public libraries and 89% of the college libraries. After the death of Melvil Dewey in 1931, administration of the classification was under the Decimal Classification Committee of the Lake Placid Club Education Foundation, and the editorial body was the Decimal Classification Editorial Policy Committee with participation of the American Library Association (ALA), Library of Congress, and Forest Press. By the 14th edition in 1942, the Dewey Decimal Classification index was over 1,900 pages in length and was published in two volumes.\n\n\n=== 1942–present: forging an identity ===\nThe growth of the classification to date had led to significant criticism from medium and large libraries which were too large to use the abridged edition but found the full classification overwhelming. Dewey had intended issuing the classification in three editions: the library edition, which would be the fullest edition; the bibliographic edition, in English and French, which was to be used for the organization of bibliographies rather than of books on the shelf; and the abridged edition. In 1933, the bibliographic edition became the Universal Decimal Classification, which left the library and abridged versions as the formal Dewey Decimal Classification editions. The 15th edition, edited by Milton Ferguson, implemented the growing concept of the \"standard edition\", designed for the majority of general libraries but not attempting to satisfy the needs of the very largest or of special libraries. It also reduced the size of the Dewey system by over half, from 1,900 to 700 pages. This revision was so radical that an advisory committee was formed right away for the 16th and 17th editions. The 16th and 17th editions, under the editorship of the Library of Congress, grew again to two volumes. However, by then, the Dewey Decimal system had established itself as a classification for general libraries, with the Library of Congress Classification having gained acceptance for large research libraries.The first electronic version of \"Dewey\" was created in 1993. Hard-copy editions continue to be issued at intervals; the online WebDewey and Abridged WebDewey are updated quarterly.\n\n\n== Administration and publication ==\nDewey and a small editorial staff managed the administration of the very early editions.  Beginning in 1922, the Lake Placid Club Educational Foundation, a not-for-profit organization founded by Melvil Dewey, managed administrative affairs.  The ALA set up a Special Advisory Committee on the Decimal Classification as part of the Cataloging and Classification division of ALA in 1952. The previous Decimal Classification Committee was changed to the Decimal Classification Editorial Policy Committee, with participation of the ALA Division of Cataloging and Classification, and of the Library of Congress.Melvil Dewey edited the first three editions of the classification system and oversaw the revisions of all editions until his death in 1931. May Seymour became editor in 1891 and served until her death in 1921. She was followed by Dorcas Fellows, who was editor until her death in 1938. Constantin J. Mazney edited the 14th edition. Milton Ferguson functioned as editor from 1949 to 1951. The 16th edition in 1958 was edited under an agreement between the Library of Congress and Forest Press, with David Haykin as director. Editions 16–19 were edited by Benjamin A. Custer and the editor of edition 20 was John P. Comaromi. Joan Mitchell was editor until 2013, covering editions 21 to 23. In 2013 Michael Panzer of OCLC became Editor-in-Chief. The Dewey Editorial Program Manager since 2016 has been Rebecca Green.Dewey himself held copyright in editions 1 to 6 (1876–1919). Copyright in editions 7–10 was held by the publisher, The Library Bureau. On the death of May Seymour, Dewey conveyed the \"copyrights and control of all editions\" to the Lake Placid Club Educational Foundation, a non-profit chartered in 1922.  The Online Computer Library Center of Dublin, Ohio, US, acquired the trademark and copyrights associated with the Dewey Decimal Classification system when it bought Forest Press in 1988. In 2003 the Dewey Decimal Classification came to the attention of the U.S. press when OCLC sued the Library Hotel for trademark infringement for using the classification system as the hotel theme. The case was settled shortly thereafter.The OCLC has maintained the classification since 1988, and also publishes new editions of the system. The editorial staff responsible for updates is based partly at the Library of Congress and partly at OCLC. Their work is reviewed by the Decimal Classification Editorial Policy Committee, a ten-member international board which meets twice each year. The four-volume unabridged edition was published approximately every six years, with the last edition (DDC 23) published in mid-2011. In 2017 the editorial staff announced that the English edition of DDC will no longer be printed, in favor of using the frequently updated WebDewey. An experimental version of Dewey in RDF was previously available at dewey.info beginning in 2009, but has not been available since 2015.In addition to the full version, a single-volume abridged edition designed for libraries with 20,000 titles or fewer has been made available since 1895. The last printed English abridged edition, Abridged Edition 15, was published in early 2012.\n\n\n== Design ==\nThe Dewey Decimal Classification organizes library materials by discipline or field of study. The scheme comprises ten classes, each divided into ten divisions, each having ten sections. The system's notation uses Indo-Arabic numbers, with three whole numbers making up the main classes and sub-classes and decimals designating further divisions. The classification structure is hierarchical and the notation follows the same hierarchy. Libraries not needing the full level of detail of the classification can trim right-most decimal digits from the class number to obtain more general classifications. For example:\n\n500 Natural sciences and mathematics\n510 Mathematics\n516 Geometry\n516.3 Analytic geometries\n516.37 Metric differential geometries\n516.375 Finsler geometryThe classification was originally enumerative, meaning that it listed all of the classes explicitly in the schedules. Over time it added some aspects of a faceted classification scheme, allowing classifiers to construct a number by combining a class number for a topic with an entry from a separate table. Tables cover commonly used elements such as geographical and temporal aspects, language, and bibliographic forms. For example, a class number could be constructed using 330 for economics + .9 for geographic treatment + .04 for Europe to create the class 330.94 European economy. Or one could combine the class 973 (for the United States) + .05 (for periodical publications on the topic) to arrive at the number 973.05 for periodicals concerning the United States generally. The classification also makes use of mnemonics in some areas, such that the number 5 represents the country Italy in classification numbers like 945 (history of Italy), 450 (Italian language), and 195 (Italian philosophy). The combination of faceting and mnemonics makes the classification synthetic in nature, with meaning built into parts of the classification number.The Dewey Decimal Classification has a number for all subjects, including fiction, although many libraries maintain a separate fiction section shelved by alphabetical order of the author's surname.  Each assigned number consists of two parts: a class number (from the Dewey system) and a book number, which \"prevents confusion of different books on the same subject\". A common form of the book number is called a Cutter number, which represents the author and distinguishes the book from other books on the same topic.\n\n\n=== Classes ===\n\n(From DDC 23)\n\n000 – Computer science, information and general works\n100 – Philosophy and psychology\n200 – Religion\n300 – Social sciences\n400 – Language\n500 – Pure science\n600 – Technology\n700 – Arts and recreation\n800 – Literature\n900 – History and geography\n\n\n=== Tables ===\n(From DDC 23)\n\nT1 Standard Subdivisions\nT2 Geographic Areas, Historical Periods, Biography\nT3 Subdivisions for the Arts, for Individual Literatures, for Specific Literary Forms\nT3A Subdivisions for Works by or about Individual Authors\nT3B Subdivisions for Works by or about More than One Author\nT3C Notation to Be Added Where Instructed in Table 3B, 700.4, 791.4, 808–809\nT4 Subdivisions of Individual Languages and Language Families\nT5 Ethnic and National Groups\nT6 Languages\n\n\n=== Relative Index ===\nThe Relative Index (or, as Dewey spelled it, \"Relativ Index\") is an alphabetical index to the classification, for use both by classifiers and by library users when seeking books by topic. The index was \"relative\" because the index entries pointed to the class numbers, not to the page numbers of the printed classification schedule. In this way, the Dewey Decimal Classification itself had the same relative positioning as the library shelf and could be used either as an entry point to the classification, by catalogers, or as an index to a Dewey-classed library itself.\n\n\n== Influence and criticism ==\nDewey Decimal Classification numbers formed the basis of the Universal Decimal Classification (UDC), which combines the basic Dewey numbers with selected punctuation marks (comma, colon, parentheses, etc.). Adaptations of the system for specific regions outside the English-speaking world include the Korean Decimal Classification, the New Classification Scheme for Chinese Libraries, and the Nippon Decimal Classification in Japan.Despite its widespread use, the classification has been criticized for its complexity and its limited capability for amendment. In particular, the arrangement of subheadings has been described as archaic and biased towards an Anglo-American world view. This is particularly clear in the 800s section, in which most literature, particularly from outside the United States or Europe, is relegated to the 890s particularly when contrasted with the 900s—history. In 2007–08, the Maricopa County Library District in Arizona abandoned the DDC in favor of the Book Industry Standards and Communications (BISAC) system commonly used by commercial bookstores, in an effort to make its libraries more accessible for their users. Several other libraries across the United States and other countries (including Canada and the Netherlands) followed suit.\n\n\n=== Treatment of homosexuality ===\nIn 1932, topics relating to homosexuality were first added to the system under 132 (mental derangements) and 159.9 (abnormal psychology). In 1952, homosexuality was also included under 301.424 (the study of sexes in society). In 1989, it was added to 363.49 (social problems), a classification that continues in the current edition.In 1996, homosexuality was added to 306.7 (sexual relations); this remains the preferred location in the current edition. Although books can also be found under 616.8583 (sexual practices viewed as medical disorders), the official direction states:\nUse 616.8583 for homosexuality only when the work treats homosexuality as a medical disorder, or focuses on arguing against the views of those who consider homosexuality to be a medical disorder. ... If in doubt, prefer a number other than 616.8583.\n\n\n=== Treatment of religion ===\nThe top-level class for religion heavily favors Christianity, dedicating nearly all of the 200 division to it: the world's thousands of other religions were listed under the 290s. For example, Islam is under just DDC 297, despite being almost as large as Christianity by population. The entire 200 section has remained largely unchanged since DDC 1, since restructuring would pose a significant amount of work for existing libraries. The motivation for this change is ideological rather than technical, as appending significant figures can add space as needed.\n\n\n=== Treatment of women ===\nIt has also been argued by Hope A. Olson that the placement of topics related to women shows implicit bias, but this has been simpler to address than the religion schema. Some changes made so far have been in numerical proximity, altering the placement of topics relative to each other. For example, in older versions of the DDC, some categories regarding women were adjacent to categories on etiquette; the placement of these categories next to each other imposed an association of etiquette with women, rather than treating it as gender-neutral. This was changed in DDC version 17, in 1965.\n\n\n== See also ==\nBooks in the United States\nComparison of Dewey and Library of Congress subject classification\nList of Dewey Decimal classes\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n\nOCLC's Dewey Decimal website\nFull text of Dewey Decimal Classification and Relative Index online loan from the Internet Archive (various editions available)\nFull text of A Classification and Subject Index for Cataloguing and Arranging the Books and Pamphlets of a Library (Dewey Decimal Classification) (1876) from Project Gutenberg\nBook Industry Standards and Communications (BISAC) system",
    "Geography (from Ancient Greek γεωγραφία geōgraphía; combining gê 'Earth' and gráphō 'write') is the study of the lands, features, inhabitants, and phenomena of Earth. Geography is an all-encompassing discipline that seeks an understanding of Earth and its human and natural complexities—not merely where objects are, but also how they have changed and come to be. While geography is specific to Earth, many concepts can be applied more broadly to other celestial bodies in the field of planetary science. Geography has been called \"a bridge between natural science and social science disciplines.\"The first recorded use of the word γεωγραφία was as a title of a book by Greek scholar Eratosthenes (276–194 BC). However, the concepts of geography (such as cartography) date back to the earliest attempts to understand the world spatially, with the earliest example of an attempted world map dating to the 9th century BCE in ancient Babylon. The history of geography as a discipline spans cultures and millennia, being independently developed by multiple groups, and cross-pollinated by trade between these groups. The core concepts of geography consistent between all approaches are a focus on space, place, time, and scale.Today, geography is an extremely broad discipline with multiple approaches and modalities. There have been multiple attempts to organize the discipline, including the four traditions of geography, and into branches. Techniques employed can generally be broken down into quantitative and qualitative approaches, with many studies taking mixed-methods approaches. Common techniques include cartography, remote sensing, interviews, and surveys.\n\n\n== Fundamentals ==\nGeography is a systematic study of the Earth (other celestial bodies are specified, such as \"geography of Mars\", or given another name, such as areography in the case of Mars), its features, and phenomena that take place on it. For something to fall into the domain of geography, it generally needs some sort of spatial component that can be placed on a map, such as coordinates, place names, or addresses. This has led to geography being associated with cartography and place names. Although many geographers are trained in toponymy and cartology, this is not their main preoccupation. Geographers study the Earth's spatial and temporal distribution of phenomena, processes, and features as well as the interaction of humans and their environment. Because space and place affect a variety of topics, such as economics, health, climate, plants, and animals, geography is highly interdisciplinary. The interdisciplinary nature of the geographical approach depends on an attentiveness to the relationship between physical and human phenomena and their spatial patterns.\nNames of places...are not geography...To know by heart a whole gazetteer full of them would not, in itself, constitute anyone a geographer. Geography has higher aims than this: it seeks to classify phenomena (alike of the natural and of the political world, in so far as it treats of the latter), to compare, to generalize, to ascend from effects to causes, and, in doing so, to trace out the laws of nature and to mark their influences upon man. This is 'a description of the world'—that is Geography. In a word, Geography is a Science—a thing not of mere names but of argument and reason, of cause and effect.\nGeography as a discipline can be split broadly into three main branches: human geography, physical geography, and technical geography. Human geography largely focuses on the built environment and how humans create, view, manage, and influence space. Physical geography examines the natural environment and how organisms, climate, soil, water, and landforms produce and interact. The difference between these approaches led to the development of integrated geography, which combines physical and human geography and concerns the interactions between the environment and humans. Technical geography involves studying and developing the tools and techniques used by geographers, such as remote sensing, cartography, and geographic information system.\n\n\n=== Key concepts ===\nNarrowing down geography to a few key concepts is extremely challenging, and subject to tremendous debate within the discipline. In one attempt, the 1st edition of the book \"Key Concepts in Geography\" broke down this into chapters focusing on \"Space,\" \"Place,\" \"Time,\" \"Scale,\" and \"Landscape.\" The 2nd edition of the book expanded on these key concepts by adding \"Environmental systems,\" \"Social Systems,\" \"Nature,\" \"Globalization,\" \"Development,\" and \"Risk,\" demonstrating how challenging narrowing the field can be.Another approach used extensively in teaching geography are the Five themes of geography established by \"Guidelines for Geographic Education: Elementary and Secondary Schools,\" published jointly by the National Council for Geographic Education and the Association of American Geographers in 1984. These themes are Location, place, relationships within places (often summarized as Human-Environment Interaction), movement, and regions The five themes of geography have shaped how American education approaches the topic in the years since.\n\n\n==== Space ====\n\nJust as all phenomena exist in time and thus have a history, they also exist in space and have a geography.\nFor something to exist in the realm of geography, it must be able to be described spatially. Thus, space is the most fundamental concept at the foundation of geography. The concept is so basic, that geographers often have difficulty defining exactly what it is. Absolute space is the exact site, or spatial coordinates, of objects, persons, places, or phenomena under investigation. We exist in space. Absolute space leads to the view of the world as a photograph, with everything frozen in place when the coordinates were recorded. Today, geographers are trained to recognize the world as a dynamic space where all processes interact and take place, rather than a static image on a map.\n\n\n==== Place ====\n\nPlace is one of the most complex and important terms in geography. In human geography, place is the synthesis of the coordinates on the Earth's surface, the activity and use that occurs, has occurred, and will occur at the coordinates, and the meaning ascribed to the space by human individuals and groups. This can be extraordinarily complex, as different spaces may have different uses at different times and mean different things to different people. In physical geography, a place includes all of the physical phenomena that occur in space, including the lithosphere, atmosphere, hydrosphere, and biosphere. Places do not exist in a vacuum and instead have complex spatial relationships with each other, and place is concerned how a location is situated in relation to all other locations. As a discipline then, the term place in geography includes all spatial phenomena occurring at a location, the diverse uses and meanings humans ascribe to that location, and how that location impacts and is impacted by all other locations on Earth. In one of Yi-Fu Tuan's papers, he explains that in his view, geography is the study of Earth as a home for humanity, and thus place and the complex meaning behind the term is central to the discipline of geography.\n\n\n==== Time ====\n\nTime is usually thought to be within the domain of history, however, it is of significant concern in the discipline of geography. In physics, space and time are not separated, and are combined into the concept of spacetime.\nGeography is subject to the laws of physics, and in studying things that occur in space, time must be considered. Time in geography is more than just the historical record of events that occurred at various discrete coordinates; but also includes modeling the dynamic movement of people, organisms, and things through space. Time facilitates movement through space, ultimately allowing things to flow through a system. The amount of time an individual, or group of people, spends in a place will often shape their attachment and perspective to that place. Time constrains the possible paths that can be taken through space, given a starting point, possible routes, and rate of travel. Visualizing time over space is challenging in terms of cartography, and includes Space-Prism, advanced 3D geovisualizations, and animated maps.\n\n\n==== Scale ====\n\nScale in the context of a map is the ratio between a distance measured on the map and the corresponding distance as measured on the ground. This concept is fundamental to the discipline of geography, not just cartography, in that phenomena being investigated appear different depending on the scale used. Scale is the frame that geographers use to measure space, and ultimately to try and understand a place.\n\n\n=== Laws of geography ===\n\nDuring the quantitative revolution, geography shifted to an empirical law-making (nomothetic) approach. Several laws of geography have been proposed since then, most notably by Waldo Tobler and can be viewed as a product of the quantitative revolution. In general, some dispute the entire concept of laws in geography and the social sciences. These criticisms have been addressed by Tobler and others, such as Michael Frank Goodchild. However, this is an ongoing source of debate in geography and is unlikely to be resolved anytime soon. Several laws have been proposed, and Tobler's first law of geography is the most generally accepted in geography. Some have argued that geographic laws do not need to be numbered. The existence of a first invites a second, and many have proposed themselves as that. It has also been proposed that Tobler's first law of geography should be moved to the second and replaced with another. A few of the proposed laws of geography are below:\n\nTobler's first law of geography: \"Everything is related to everything else, but near things are more related than distant\"\nTobler's second law of geography: \"The phenomenon external to a geographic area of interest affects what goes on inside.\"\nArbia's law of geography: \"Everything is related to everything else, but things observed at a coarse spatial resolution are more related than things observed at a finer resolution.\"\nSpatial heterogeneity: Geographic variables exhibit uncontrolled variance. \nThe uncertainty principle: \"That the geographic world is infinitely complex and that any representation must therefore contain elements of uncertainty, that many definitions used in acquiring geographic data contain elements of vagueness, and that it is impossible to measure location on the Earth's surface exactly.\"Additionally, several variations or amendments to these laws exist within the literature, although not as well supported. For example, one paper proposed an amendmended version of Tobler's first law of geography, referred to in the text as the Tobler–von Thünen law, which states: \"Everything is related to everything else, but near things are more related than distant things, as a consequence of accessibility.\" \n\n\n== Sub-disciplines ==\nGeography is a branch of inquiry that focuses on spatial information on Earth. It is an extremely broad topic and can be broken down multiple ways. There have been several approaches to doing this spanning at least several centuries, including \"four traditions of geography\" and into distinct branches. The Four traditions of geography are often used to divide the different historical approaches theories geographers have taken to the discipline. In contrast, geography's branches describe contemporary applied geographical approaches.\n\n\n=== Four traditions of geography ===\n\nGeography is an extremely broad field. Because of this, many view the various definitions of geography proposed over the decades as inadequate. To address this, William D. Pattison proposed the concept of the \"Four traditions of Geography\" in 1964. These traditions are the Spatial or Locational Tradition, the Man-Land or Human-Environment Interaction Tradition (sometimes referred to as Integrated geography), the Area Studies or Regional Tradition, and the Earth Science Tradition. These concepts are broad sets of geography philosophies bound together within the discipline. They are one of many ways geographers organize the major sets of thoughts and philosophies within the discipline.\n\n\n=== Branches of geography ===\n\nIn another approach to the abovementioned four traditions, geography is organized into applied branches. The UNESCO Encyclopedia of Life Support Systems organizes geography into the three categories of human geography, physical geography, and technical geography. Some publications limit the number of branches to physical and human, describing them as the principal branches. Geographers rarely focus on just one of these topics, often using one as their primary focus and then incorporating data and methods from the other branches. Often, geographers are asked to describe what they do by individuals outside the discipline and are likely to identify closely with a specific branch, or sub-branch when describing themselves to lay people. Human geography studies people and their communities, cultures, economies, and environmental interactions by studying their relations with and across space and place. Physical geography is concerned with the study of processes and patterns in the natural environment like the atmosphere, hydrosphere, biosphere, and geosphere. Technical geography is interested in studying and applying techniques and methods to store, process, analyze, visualize, and use spatial data. It is the newest of the branches, the most controversial, and often other terms are used in the literature to describe the emerging category. These branches use similar geographic philosophies, concepts, and tools and often overlap significantly.\n\n\n==== Physical ====\n\nPhysical geography (or physiography) focuses on geography as an Earth science. It aims to understand the physical problems and the issues of lithosphere, hydrosphere, atmosphere, pedosphere, and global flora and fauna patterns (biosphere). Physical geography is the study of earth's seasons, climate, atmosphere, soil, streams, landforms, and oceans. Physical geographers will often work in identifying and monitoring the use of natural resources. \n\nPhysical geography can be divided into many broad categories, including:\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n==== Human ====\n\nHuman geography (or anthropogeography) is a branch of geography that focuses on studying patterns and processes that shape human society. It encompasses the human, political, cultural, social, and economic aspects. In industry, human geographers often work in city planning, public health, or business analysis.\n\nHuman geography can be divided into many broad categories, such as:\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\nVarious approaches to the study of human geography have also arisen through time and include:\n\nBehavioral geography\nCulture theory\nFeminist geography\nGeosophy\n\n\n==== Technical ====\n\nTechnical geography concerns studying and developing tools, techniques, and statistical methods employed to collect, analyze, use, and understand spatial data. Technical geography is the most recently recognized, and controversial, of the branches. Its use dates back to 1749, when a book published by Edward Cave organized the discipline into a section containing content such as cartographic techniques and globes. There are several other terms, often used interchangeably with technical geography to subdivide the discipline, including \"techniques of geographic analysis,\" \"Geographic Information Technology,\" \"Geography method's and techniques,\" \"Geographic Information Science,\" \"geoinformatics,\" \"geomatics,\" and \"information geography\". There are subtle differences to each concept and term; however, technical geography is one of the broadest, is consistent with the naming convention of the other two branches, has been in use since the 1700s, and has been used by the UNESCO Encyclopedia of Life Support Systems to divide geography into themes. As academic fields increasingly specialize in their nature, technical geography has emerged as a branch of geography specializing in geographic methods and thought. The emergence of technical geography has brought new relevance to the broad discipline of geography by serving as a set of unique methods for managing the interdisciplinary nature of the phenomena under investigation. While human and physical geographers use the techniques employed by technical geographers, technical geography is more concerned with the fundamental spatial concepts and technologies than the nature of the data. It is therefore closely associated with the spatial tradition of geography while being applied to the other two major branches. A technical geographer might work as a GIS analyst, a GIS developer working to make new software tools, or create general reference maps incorporating human and natural features.\nTechnical geography can be divided into many broad categories, such as:\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== Techniques ==\nAll geographic research and analysis start with asking the question \"where,\" followed by \"why there.\" Geographers start with the fundamental assumption set forth in Tobler's first law of geography, that \"everything is related to everything else, but near things are more related than distant things.\"\nAs spatial interrelationships are key to this synoptic science, maps are a key tool. Classical cartography has been joined by a more modern approach to geographical analysis, computer-based geographic information systems (GIS).\nIn their study, geographers use four interrelated approaches:\n\nAnalytical – Asks why we find features and populations in a specific geographic area.\nDescriptive – Simply specifies the locations of features and populations.\nRegional – Examines systematic relationships between categories for a specific region or location on the planet.\nSystematic – Groups geographical knowledge into categories that can be explored globally.\n\n\n=== Quantitative methods ===\n\nQuantitative methods in geography became particularly influential in the discipline during the quantitative revolution of the 1950s and 60s. These methods revitalized the discipline in many ways, allowing scientific testing of hypotheses and proposing scientific geographic theories and laws. The quantitative revolution heavily influenced and revitalized technical geography, and lead to the development of the subfield of quantitative geography.\n\n\n==== Quantitative cartography ====\n\nCartography is the art, science, and technology of making maps. Cartographers study the Earth's surface representation with abstract symbols (map making). Although other subdisciplines of geography rely on maps for presenting their analyses, the actual making of maps is abstract enough to be regarded separately. Cartography has grown from a collection of drafting techniques into an actual science.\nCartographers must learn cognitive psychology and ergonomics to understand which symbols convey information about the Earth most effectively and behavioural psychology to induce the readers of their maps to act on the information. They must learn geodesy and fairly advanced mathematics to understand how the shape of the Earth affects the distortion of map symbols projected onto a flat surface for viewing. It can be said, without much controversy, that cartography is the seed from which the larger field of geography grew.\n\n\n==== Geographic information systems ====\n\nGeographic information systems (GIS) deal with storing information about the Earth for automatic retrieval by a computer in an accurate manner appropriate to the information's purpose. In addition to all of the other subdisciplines of geography, GIS specialists must understand computer science and database systems. GIS has revolutionized the field of cartography: nearly all mapmaking is now done with the assistance of some form of GIS software. The science of using GIS software and GIS techniques to represent, analyse, and predict the spatial relationships is called geographic information science (GISc).\n\n\n==== Remote sensing ====\n\nRemote sensing is the art, science, and technology of obtaining information about Earth's features from measurements made at a distance. Remotely sensed data can be either passive, such as traditional photography, or active, such as LiDAR. A variety of platforms can be used for remote sensing, including satellite imagery, aerial photography (including consumer drones), and data obtained from hand-held sensors. Products from remote sensing include Digital elevation model and cartographic base maps. Geographers increasingly use remotely sensed data to obtain information about the Earth's land surface, ocean, and atmosphere, because it: (a) supplies objective information at a variety of spatial scales (local to global), (b) provides a synoptic view of the area of interest, (c) allows access to distant and inaccessible sites, (d) provides spectral information outside the visible portion of the electromagnetic spectrum, and (e) facilitates studies of how features/areas change over time. Remotely sensed data may be analyzed independently or in conjunction with other digital data layers (e.g., in a geographic information system). Remote sensing aids in land use, land cover (LULC) mapping, by helping to determine both what is naturally occurring on a piece of land and what human activities are taking place on it.\n\n\n==== Geostatistics ====\n\nGeostatistics deal with quantitative data analysis, specifically the application of a statistical methodology to the exploration of geographic phenomena. Geostatistics is used extensively in a variety of fields, including hydrology, geology, petroleum exploration, weather analysis, urban planning, logistics, and epidemiology. The mathematical basis for geostatistics derives from cluster analysis, linear discriminant analysis and non-parametric statistical tests, and a variety of other subjects. Applications of geostatistics rely heavily on geographic information systems, particularly for the interpolation (estimate) of unmeasured points. Geographers are making notable contributions to the method of quantitative techniques.\n\n\n=== Qualitative methods ===\n\nQualitative methods geography in geography are descriptive rather than numerical or statistical in nature. They add context to concepts, and explore human concepts like beliefs and perspective that are difficult or impossible to quantify. Human geography is much more likely to employ qualitative methods than physical. Increasingly, technical geographers are attempting to employ GIS methods to qualitative datasets.\n\n\n==== Qualitative cartography ====\nQualitative cartography employs many of the same software and techniques as quantitative. It may be employed to inform on map practices, or to visualize perspectives and ideas that are not strictly quantitative in nature. An example of a form of qualitative cartography is a deep map, or maps that combine geography and storytelling to produce a product with greater information than a two-dimensional image of places, names, and topography. This approach offers more inclusive strategies than more traditional cartographic approaches for connecting the complex layers that makeup places.\n\n\n==== Ethnography ====\n\nEthnographical research techniques are used by human geographers. In cultural geography, there is a tradition of employing qualitative research techniques, also used in anthropology and sociology. Participant observation and in-depth interviews provide human geographers with qualitative data.\n\n\n==== Geopoetics ====\n\nGeopoetics is an interdisciplinary approach that combines geography and poetry to explore the interconnectedness between humans, space, place, and the environment. Geopoetics is employed as a mixed methods tool to explain the implications of geographic research. It is often employed to address and communicate the implications of complex topics, such as the anthropocene.\n\n\n==== Interviews ====\n\nGeographers employ interviews to gather data and acquire valuable understandings from individuals or groups regarding their encounters, outlooks, and opinions concerning spatial phenomena. Interviews can be carried out through various mediums, including face-to-face interactions, phone conversations, online platforms, or written exchanges. Geographers typically adopt a structured or semi-structured approach during interviews involving specific questions or discussion points when utilized for research purposes. These questions are designed to extract focused information about the research topic while being flexible enough to allow participants to express their experiences and viewpoints, such as through open-ended questions.\n\n\n== History ==\n\nThe concept of geography is present in all cultures, and therefore the history of the discipline is a series of competing narratives, with concepts emerging at various points across space and time. The oldest known world maps date back to ancient Babylon from the 9th century BC. The best known Babylonian world map, however, is the Imago Mundi of 600 BC. The map as reconstructed by Eckhard Unger shows Babylon on the Euphrates, surrounded by a circular landmass showing Assyria, Urartu, and several cities, in turn surrounded by a \"bitter river\" (Oceanus), with seven islands arranged around it so as to form a seven-pointed star. The accompanying text mentions seven outer regions beyond the encircling ocean. The descriptions of five of them have survived. In contrast to the Imago Mundi, an earlier Babylonian world map dating back to the 9th century BC depicted Babylon as being further north from the center of the world, though it is not certain what that center was supposed to represent.\nThe ideas of Anaximander (c. 610–545 BC): considered by later Greek writers to be the true founder of geography, come to us through fragments quoted by his successors. Anaximander is credited with the invention of the gnomon, the simple, yet efficient Greek instrument that allowed the early measurement of latitude. Thales is also credited with the prediction of eclipses. The foundations of geography can be traced to ancient cultures, such as the ancient, medieval, and early modern Chinese. The Greeks, who were the first to explore geography as both art and science, achieved this through Cartography, Philosophy, and Literature, or through Mathematics. There is some debate about who was the first person to assert that the Earth is spherical in shape, with the credit going either to Parmenides or Pythagoras. Anaxagoras was able to demonstrate that the profile of the Earth was circular by explaining eclipses. However, he still believed that the Earth was a flat disk, as did many of his contemporaries. One of the first estimates of the radius of the Earth was made by Eratosthenes.The first rigorous system of latitude and longitude lines is credited to Hipparchus. He employed a sexagesimal system that was derived from Babylonian mathematics. The meridians were subdivided into 360°, with each degree further subdivided into 60 (minutes). To measure the longitude at different locations on Earth, he suggested using eclipses to determine the relative difference in time. The extensive mapping by the Romans as they explored new lands would later provide a high level of information for Ptolemy to construct detailed atlases. He extended the work of Hipparchus, using a grid system on his maps and adopting a length of 56.5 miles for a degree.From the 3rd century onwards, Chinese methods of geographical study and writing of geographical literature became much more comprehensive than what was found in Europe at the time (until the 13th century). Chinese geographers such as Liu An, Pei Xiu, Jia Dan, Shen Kuo, Fan Chengda, Zhou Daguan, and Xu Xiake wrote important treatises, yet by the 17th century advanced ideas and methods of Western-style geography were adopted in China.\n\nDuring the Middle Ages, the fall of the Roman empire led to a shift in the evolution of geography from Europe to the Islamic world. Muslim geographers such as Muhammad al-Idrisi produced detailed world maps (such as Tabula Rogeriana), while other geographers such as Yaqut al-Hamawi, Abu Rayhan Biruni, Ibn Battuta, and Ibn Khaldun provided detailed accounts of their journeys and the geography of the regions they visited. Turkish geographer Mahmud al-Kashgari drew a world map on a linguistic basis, and later so did Piri Reis (Piri Reis map). Further, Islamic scholars translated and interpreted the earlier works of the Romans and the Greeks and established the House of Wisdom in Baghdad for this purpose. Abū Zayd al-Balkhī, originally from Balkh, founded the \"Balkhī school\" of terrestrial mapping in Baghdad. Suhrāb, a late tenth century Muslim geographer accompanied a book of geographical coordinates, with instructions for making a rectangular world map with equirectangular projection or cylindrical equidistant projection.Abu Rayhan Biruni (976–1048) first described a polar equi-azimuthal equidistant projection of the celestial sphere. He was regarded as the most skilled when it came to mapping cities and measuring the distances between them, which he did for many cities in the Middle East and the Indian subcontinent. He often combined astronomical readings and mathematical equations to develop methods of pin-pointing locations by recording degrees of latitude and longitude. He also developed similar techniques when it came to measuring the heights of mountains, depths of the valleys, and expanse of the horizon. He also discussed human geography and the planetary habitability of the Earth. He also calculated the latitude of Kath, Khwarezm, using the maximum altitude of the Sun, and solved a complex geodesic equation to accurately compute the Earth's circumference, which was close to modern values of the Earth's circumference. His estimate of 6,339.9 km for the Earth radius was only 16.8 km less than the modern value of 6,356.7 km. In contrast to his predecessors, who measured the Earth's circumference by sighting the Sun simultaneously from two different locations, al-Biruni developed a new method of using trigonometric calculations based on the angle between a plain and mountain top, which yielded more accurate measurements of the Earth's circumference, and made it possible for it to be measured by a single person from a single location.\nThe European Age of Discovery during the 16th and the 17th centuries, where many new lands were discovered and accounts by European explorers such as Christopher Columbus, Marco Polo, and James Cook revived a desire for both accurate geographic detail and more solid theoretical foundations in Europe. The problem facing both explorers and geographers was finding the latitude and longitude of a geographic location. The problem of latitude was solved long ago, but that of longitude remained; agreeing on what zero meridians should be was only part of the problem. It was left to John Harrison to solve it by inventing the chronometer H-4 in 1760, and later in 1884 for the International Meridian Conference to adopt by convention the Greenwich meridian as zero meridians.The 18th and 19th centuries were the times when geography became recognized as a discrete academic discipline, and became part of a typical university curriculum in Europe (especially Paris and Berlin). The development of many geographic societies also occurred during the 19th century, with the foundations of the Société de Géographie in 1821, the Royal Geographical Society in 1830, Russian Geographical Society in 1845, American Geographical Society in 1851, and the National Geographic Society in 1888. The influence of Immanuel Kant, Alexander von Humboldt, Carl Ritter, and Paul Vidal de la Blache can be seen as a major turning point in geography from philosophy to an academic subject.Over the past two centuries, the advancements in technology with computers have led to the development of geomatics and new practices such as participant observation and geostatistics being incorporated into geography's portfolio of tools. In the West during the 20th century, the discipline of geography went through four major phases: environmental determinism, regional geography, the quantitative revolution, and critical geography. The strong interdisciplinary links between geography and the sciences of geology and botany, as well as economics, sociology, and demographics, have also grown greatly, especially as a result of earth system science that seeks to understand the world in a holistic view. New concepts and philosophies have emerged from the rapid advancement of computers, quantitative methods, and interdisciplinary approaches. In 1970, Waldo Tobler proposed the first law of geography, \"everything is related to everything else, but near things are more related than distant things.\" This law summarizes the first assumption geographers make about the world.\n\n\n== Notable geographers ==\n\nAlexander von Humboldt (1769–1859) – published Cosmos and founder of the sub-field biogeography.\nAnne Kelly Knowles (Born 1957) – influential in the use of GIS and geographic methods in History.\nCarl O. Sauer (1889–1975) – cultural geographer.\nCarl Ritter (1779–1859) – occupied the first chair of geography at Berlin University.\nCynthia Brewer  – cartographic theorist that created the Apache 2.0 licensed web application ColorBrewer.\nDana Tomlin  – originator of map algebra\nDoreen Massey (1944–2016) – scholar in the space and places of globalization and its pluralities; winner of the Vautrin Lud Prize.\nEllen Churchill Semple (1863–1932) – first female president of the Association of American Geographers.\nEratosthenes (c. 276–c. 195/194 BC) – calculated the size of the Earth.\nErnest Burgess (1886–1966) – creator of the concentric zone model.\nGeorge F. Jenks (1916-1996) – influential in computer cartography and thematic mapping\nGerardus Mercator (1512–1594) – cartographer who produced the mercator projection\nMark Monmonier (born 1943) – cartographic theorist who wrote numerous books contributing to Geographic Information Systems.\nMei-Po Kwan (born 1962) – contributed significantly to the use of GPS and real-time mapping within GIS\nMichael Frank Goodchild (born 1944) – GIScience scholar and winner of the RGS founder's medal in 2003.\nMuhammad al-Idrisi (Arabic: أبو عبد الله محمد الإدريسي; Latin: Dreses) (1100–1165) – author of Nuzhatul Mushtaq.\nNigel Thrift (born 1949) – originator of non-representational theory.\nPaul Vidal de La Blache (1845–1918) – founder of the French school of geopolitics, wrote the principles of human geography.\nPtolemy (c. 100–c. 170) – compiled Greek and Roman knowledge into the book Geographia.\nRoger Tomlinson (1933 – 2014) – the primary originator of modern geographic information systems.\nSir Halford Mackinder (1861–1947) – co-founder of the LSE, Geographical Association.\nStrabo (64/63 BC – c. AD 24) – wrote Geographica, one of the first books outlining the study of geography.\nWaldo Tobler (1930–2018) – coined the first law of geography and second law of geography.\nWalter Christaller (1893–1969) – human geographer and inventor of Central place theory.\nWilliam Morris Davis (1850–1934) – father of American geography and developer of the cycle of erosion.\nYi-Fu Tuan (1930–2022) – Chinese-American scholar credited with starting Humanistic Geography as a discipline.\n\n\n== Institutions and societies ==\nMain category: Geography Organizations\n\nAmerican Association of Geographers (AAG)\nAmerican Geographical Society (US) \nAnton Melik Geographical Institute (Slovenia)\nGamma Theta Upsilon (international)\nInstitute of Geographical Information Systems (Pakistan)\nInternational Geographical Union (International)\nNational Council for Geographic Education (United States)\nNational Geographic Society (United States) \nRoyal Canadian Geographical Society (Canada)\nRoyal Danish Geographical Society (Denmark)\nRoyal Geographical Society (UK) \nRussian Geographical Society (Russia)\n\n\n== Publications ==\nMain category: Geography literature\n\nAnnals of the American Association of Geographers\nAntipode\nApplied Geography\nConcepts and Techniques in Modern Geography\nDialogues in Human Geography\nEconomic Geography\nGeographia Technica\nGeographical Review\nGeographical Bulletin\nGeoHumanities\nInternational Journal of Geographical Information Science\nISPRS International Journal of Geo-Information\nJournal of Maps\nJournal of Rural Studies\nJournal of Transport Geography\nNational Geographic\nProfessional Geographer\nProgress in Human Geography\nThe Geographical Journal\nThe Professional Geographer\n\n\n== Related fields ==\n\n\n=== Geology ===\n\nThe discipline of geography, especially physical geography, and geology have significant overlap. In the past, the two have often shared academic departments at universities, a point that has led to conflict over resources. Both disciplines do seek to understand the rocks on the Earth's surface and the processes that change them over time. Geology employs many of the tools and techniques of technical geographers, such as GIS and remote sensing to aid in geological mapping. However, geology includes research that goes beyond the spatial component, such as the chemical analysis of rocks and biogeochemistry.\n\n\n=== History ===\n\nThe discipline of History has significant overlap with geography, especially human geography. Like geology, history and geography have shared university departments.  Geography provides the spatial context within which historical events unfold. The physical geographic features of a region, such as its landforms, climate, and resources, shape human settlements, trade routes, and economic activities, which in turn influence the course of historical events. Thus, a historian must have a strong foundation in geography. Historians employ the techniques of technical geographers to create  historical atlases and maps.\n\n\n=== Planetary science ===\n\nWhile the discipline of geography is normally concerned with the Earth, the term can also be informally used to describe the study of other worlds, such as the planets of the Solar System and even beyond. The study of systems larger than the Earth itself usually forms part of Astronomy or Cosmology. The study of other planets is usually called planetary science. Alternative terms such as areography (geography of Mars) have been employed to describe the study of other celestial objects. Ultimately, geography may be considered a subdiscipline within planetary science.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n \nDefinition of geography at Dictionary.com\nDefinition of geography by Lexico\nOrigin and meaning of geography by Online Etymology Dictionary\nTopic Dictionaries at Oxford Learner's Dictionaries",
    "A library catalog (or library catalogue in British English) is a register of all bibliographic items found in a library or group of libraries, such as a network of libraries at several locations. A catalog for a group of libraries is also called a union catalog. A bibliographic item can be any information entity (e.g., books, computer files, graphics, realia, cartographic materials, etc.) that is considered library material (e.g., a single novel in an anthology), or a group of library materials (e.g., a trilogy), or linked from the catalog (e.g., a webpage) as far as it is relevant to the catalog and to the users (patrons) of the library.\nThe card catalog was a familiar sight to library users for generations, but it has been effectively replaced by the online public access catalog (OPAC). Some still refer to the online catalog as a \"card catalog\". Some libraries with OPAC access still have card catalogs on site, but these are now strictly a secondary resource and are seldom updated. Many libraries that retain their physical card catalog will post a sign advising the last year that the card catalog was updated. Some libraries have eliminated their card catalog in favor of the OPAC for the purpose of saving space for other use, such as additional shelving.\nThe largest international library catalog in the world is the WorldCat union catalog managed by the non-profit library cooperative OCLC. In January 2021, WorldCat had over half a billion catalog records and three billion library holdings.\n\n\n== Goal ==\nAntonio Genesio Maria Panizzi in 1841 and Charles Ammi Cutter in 1876 undertook pioneering work in the definition of early cataloging rule sets formulated according to theoretical models. Cutter made an explicit statement regarding the objectives of a bibliographic system in his Rules for a Printed Dictionary Catalog. According to Cutter, those objectives were\n1. to enable a person to find a book of which any of the following is known (Identifying objective):\n\nthe author\nthe title\nthe subject\nthe date of publication2. to show what the library has (Collocating objective)\n\nby a given author\non a given subject\nin a given kind of literature3. to assist in the choice of a book (Evaluating objective)\n\nas to its edition (bibliographically)\nas to its character (literary or topical)These objectives can still be recognized in more modern definitions formulated throughout the 20th century.\nOther influential pioneers in this area were Shiyali Ramamrita Ranganathan and Seymour Lubetzky.Cutter's objectives were revised by Lubetzky and the Conference on Cataloging Principles (CCP) in Paris in 1960/1961, resulting in the Paris Principles (PP).\nA more recent attempt to describe a library catalog's functions was made in 1998 with Functional Requirements for Bibliographic Records (FRBR), which defines four user tasks: find, identify, select, and obtain.A catalog helps to serve as an inventory or bookkeeping of the library's contents. If an item is not found in the catalog, the user may continue their search at another library.\n\n\n== Card ==\nA catalog card is an individual entry in a library catalog containing bibliographic information, including the author's name, title, and location. Eventually the mechanization of the modern era brought the efficiencies of card catalogs. It was around 1780 that the first card catalog appeared in Vienna. It solved the problems of the structural catalogs in marble and clay from ancient times and the later codex—handwritten and bound—catalogs that were manifestly inflexible and presented high costs in editing to reflect a changing collection. The first cards may have been French playing cards, which in the 1700s were blank on one side.In November 1789, during the dechristianization of France during the French Revolution, the process of collecting all books from religious houses was initiated. Using these books in a new system of public libraries included an inventory of all books. The backs of the playing cards contained the bibliographic information for each book and this inventory became known as the \"French Cataloging Code of 1791\".English inventor Francis Ronalds began using a catalog of cards to manage his growing book collection around 1815, which has been denoted as the first practical use of the system. In the mid-1800s, Natale Battezzati, an Italian publisher, developed a card system for booksellers in which cards represented authors, titles and subjects. Very shortly afterward, Melvil Dewey and other American librarians began to champion the card catalog because of its great expandability. In some libraries books were cataloged based on the size of the book while other libraries organized based only on the author's name. This made finding a book difficult.\nThe first issue of Library Journal, the official publication of the American Library Association (ALA), made clear that the most pressing issues facing libraries were the lack of a standardized catalog and an agency to administer a centralized catalog. Responding to the standardization matter, the ALA formed a committee that quickly recommended the 2-by-5-inch (5 cm × 13 cm) \"Harvard College-size\" cards as used at Harvard and the Boston Athenaeum. It also suggested that a larger card, approximately 3 by 5 inches (8 cm × 13 cm), would be preferable. By the end of the nineteenth century, the bigger card won out, mainly to the fact that the 3-by-5-inch (8 cm × 13 cm) card was already the \"postal size\" used for postcards.\nMelvil Dewey saw well beyond the importance of standardized cards and sought to outfit virtually all facets of library operations. To the end he established a Supplies Department as part of the ALA, later to become a stand-alone company renamed the Library Bureau. In one of its early distribution catalogs, the bureau pointed out that \"no other business had been organized with the definite purpose of supplying libraries\". With a focus on machine-cut index cards and the trays and cabinets to contain them, the Library Bureau became a veritable furniture store, selling tables, chairs, shelves and display cases, as well as date stamps, newspaper holders, hole punchers, paper weights, and virtually anything else a library could possibly need. With this one-stop shopping service, Dewey left an enduring mark on libraries across the country. Uniformity spread from library to library.Dewey and others devised a system where books were organized by subject, then alphabetized based on the author's name. Each book was assigned a call number which identified the subject and location, with a decimal point dividing different sections of the call number. The call number on the card matched a number written on the spine of each book. In 1860, Ezra Abbot began designing a card catalog that was easily accessible and secure for keeping the cards in order; he managed this by placing the cards on edge between two wooden blocks. He published his findings in the annual report of the library for 1863 and they were adopted by many American libraries.Work on the catalog began in 1862 and within the first year, 35,762 catalog cards had been created. Catalog cards were 2 by 5 inches (5 cm × 13 cm); the Harvard College size. One of the first acts of the newly formed American Library Association in 1908 was to set standards for the size of the cards used in American libraries, thus making their manufacture and the manufacture of cabinets, uniform. OCLC, major supplier of catalog cards, printed the last one in October 2015.In a physical catalog, the information about each item is on a separate card, which is placed in order in the catalog drawer depending on the type of record. If it was a non-fiction record, Charles A. Cutter's classification system would help the patron find the book they wanted in a quick fashion. Cutter's classification system is as follows:\n\n\n== Types ==\nTraditionally, there are the following types of catalog:\n\nAuthor catalog: a formal catalog, sorted alphabetically according to the names of authors, editors, illustrators, etc.\nSubject catalog: a catalog that sorted based on the Subject.\nTitle catalog: a formal catalog, sorted alphabetically according to the article of the entries.\nDictionary catalog: a catalog in which all entries (author, title, subject, series) are interfiled in a single alphabetical order. This was a widespread form of card catalog in North American libraries prior to the introduction of the computer-based catalog.\nKeyword catalog: a subject catalog, sorted alphabetically according to some system of keywords.\nMixed alphabetic catalog forms: sometimes, one finds a mixed author / title, or an author / title / keyword catalog.\nSystematic catalog: a subject catalog, sorted according to some systematic subdivision of subjects. Also called a Classified catalog.\nShelf list catalog: a formal catalog with entries sorted in the same order as bibliographic items are shelved. This catalog may also serve as the primary inventory for the library.\n\n\n== History ==\nThe earliest librarians created rules for how to record the details of the catalog. By 700 BCE the Assyrians followed the rules set down by the Babylonians. The seventh century BCE Babylonian Library of Ashurbanipal was led by the librarian Ibnissaru who prescribed a catalog of clay tablets by subject. Subject catalogs were the rule of the day, and author catalogs were unknown at that time. The frequent use of subject-only catalogs hints that there was a code of practice among early catalog librarians and that they followed some set of rules for subject assignment and the recording of the details of each item. These rules created efficiency through consistency—the catalog librarian knew how to record each item without reinventing the rules each time, and the reader knew what to expect with each visit. The task of recording the contents of libraries is more than an instinct or a compulsive tic exercised by librarians; it began as a way to broadcast to readers what is available among the stacks of materials. The tradition of open stacks of printed books is paradigmatic to modern American library users, but ancient libraries featured stacks of clay or prepaper scrolls that resisted browsing.As librarian, Gottfried van Swieten introduced the world's first card catalog (1780) as the Prefect of the Imperial Library, Austria.During the early modern period, libraries were organized through the direction of the librarian in charge.  There was no universal method, so some books were organized by language or book material, for example, but most scholarly libraries had recognizable categories (like philosophy, saints, mathematics).  The first library to list titles alphabetically under each subject was the Sorbonne library in Paris. Library catalogs originated as manuscript lists, arranged by format (folio, quarto, etc.) or in a rough alphabetical arrangement by author. Before printing, librarians had to enter new acquisitions into the margins of the catalog list until a new one was created.  Because of the nature of creating texts at this time, most catalogs were not able to keep up with new acquisitions.When the printing press became well-established, strict cataloging became necessary because of the influx of printed materials.  Printed catalogs, sometimes called dictionary catalogs, began to be published in the early modern period and enabled scholars outside a library to gain an idea of its contents. Copies of these in the library itself would sometimes be interleaved with blank leaves on which additions could be recorded, or bound as guardbooks in which slips of paper were bound in for new entries. Slips could also be kept loose in cardboard or tin boxes, stored on shelves. The first card catalogs appeared in the late 19th century after the standardization of the 5 in. x 3 in. card for personal filing systems, enabling much more flexibility, and toward the end of the 20th century the online public access catalog was developed (see below). These gradually became more common as some libraries progressively abandoned such other catalog formats as paper slips (either loose or in sheaf catalog form), and guardbooks. The beginning of the Library of Congress's catalog card service in 1911 led to the use of these cards in the majority of American libraries. An equivalent scheme in the United Kingdom was operated by the British National Bibliography from 1956  and was subscribed to by many public and other libraries.\n\nc. Seventh century BCE, the royal Library of Ashurbanipal at Nineveh had 30,000 clay tablets, in several languages, organized according to shape and separated by content. Assurbanipal sent scribes to transcribe works in other libraries within the kingdom.\nc. Third century BCE, Pinakes by Callimachus at the Library of Alexandria was arguably the first library catalog.\n9th century: Libraries of Carolingian Schools and monasteries employ library catalog system to organize and loan out books.\nc. 10th century: The Persian city of Shiraz's library had over 300 rooms and thorough catalogs to help locate texts these were kept in the storage chambers of the library and they covered every topic imaginable.\nc. 1246: Library at Amiens Cathedral in France uses call numbers associated with the location of books.\nc. 1542–1605: The Mughul emperor Akbar was a warrior, sportsman, and famous cataloger.  He organized a catalog of the Imperial Library's 24,000 texts, and he did most of the classifying himself.\n1595: Nomenclator of Leiden University Library appears, the first printed catalog of an institutional library.\nRenaissance Era: In Paris, France The Sorbonne Library was one of the first libraries to list titles alphabetically based on the subject they happened to fall under. This became a new organization method for catalogs.\nEarly 1600s: Sir Thomas Bodley divided cataloging into three different categories. History, poesy, and philosophy.\n1674: Thomas Hyde's catalog for the Bodleian Library.\n1791: The French Cataloging Code of 1791\n1815: Thomas Jefferson sells his personal library to the US government to establish the Library of Congress.  He had organized his library by adapting Francis Bacon's organization of knowledge, specifically using Memory, Reason, and Imagination as his three areas, which were then broken down into 44 subdivisions.\n1874/1886: Breslauer Instructionen (English: Wroclaw instructions) by Karl Dziatzko\n1899: Preußische Instruktionen (PI) (English: Prussian instructions) for scientific libraries in German-speaking countries and beyond\n1932: DIN 1505\n1938: Berliner Anweisungen (BA) (English: Berlin instructions) for public libraries in Germany\n1961: Paris Principles (PP), internationally agreed upon principles for cataloging\n1967: Anglo-American Cataloguing Rules (AACR)\n1971: International Standard Bibliographic Description (ISBD)\n1976/1977: Regeln für die alphabetische Katalogisierung (RAK) (English: Rules for alphabetical cataloging) in Germany and AustriaMore about the early history of library catalogs has been collected in \n1956 by Strout.\n\n\n== Sorting ==\n\nIn a title catalog, one can distinguish two sort orders:\n\nIn the grammatical sort order (used mainly in older catalogs), the most important word of the title is the first sort term. The importance of a word is measured by grammatical rules; for example, the first noun may be defined to be the most important word.\nIn the mechanical sort order, the first word of the title is the first sort term. Most new catalogs use this scheme, but still include a trace of the grammatical sort order: they neglect an article (The, A, etc.) at the beginning of the title.The grammatical sort order has the advantage that often, the most important word of the title is also a good keyword (question 3), and it is the word most users remember first when their memory is incomplete. To its disadvantage, many elaborate grammatical rules are needed, so many users may only search with help from a librarian.\nIn some catalogs, persons' names are standardized (i. e., the name of the person is always cataloged and sorted in a standard form) even if it appears differently in the library material. This standardization is achieved by a process called authority control. Simply put, authority control is defined as the establishment and maintenance of consistent forms of terms – such as names, subjects, and titles – to be used as headings in bibliographic records. An advantage of the authority control is that it is easier to answer question 2 (Which works of some author does the library have?). On the other hand, it may be more difficult to answer question 1 (Does the library have some specific material?) if the material spells the author in a peculiar variant. For the cataloger, it may incur too much work to check whether Smith, J. is Smith, John or Smith, Jack.\nFor some works, even the title can be standardized.  The technical term for this is uniform title. For example, translations and re-editions are sometimes sorted under their original title. In many catalogs, parts of the Bible are sorted under the standard name of \nthe book(s) they contain.  The plays of William Shakespeare are another frequently cited example of the role played by a uniform title in the library catalog.\nMany complications about alphabetic sorting of entries arise. Some examples:\n\nSome languages know sorting conventions that differ from the language of the catalog. For example, some Dutch catalogs sort IJ as Y. Should an English catalog follow this suit? And should a Dutch catalog sort non-Dutch words the same way? There are also pseudo-ligatures which sometimes come at the beginning of a word, such as Œdipus. See also Collation and Locale (computer software).\nSome titles contain numbers, for example 2001: A Space Odyssey. Should they be sorted as numbers, or spelled out as Two thousand and one?  (Book-titles that begin with non-numeral-non-alphabetic glyphs such as #1 are similarly very difficult.  Books which have diacritics in the first letter are a similar but far-more-common problem; casefolding of the title is standard, but stripping the diacritics off can change the meaning of the words.)\nde Balzac, Honoré or Balzac, Honoré de?  Ortega y Gasset, José or Gasset, José Ortega y?  (In the first example, \"de Balzac\" is the legal and cultural last name; splitting it apart would be the equivalent of listing a book about tennis under \"-enroe, John Mac-\" for instance.  In the second example, culturally and legally the lastname is \"Ortega y Gasset\" which is sometimes shortened to simply \"Ortega\" as the masculine lastname; again, splitting is culturally incorrect by the standards of the culture of the author, but defies the normal understanding of what a 'last name' is—i.e. the final word in the ordered list of names that define a person—in cultures where multi-word-lastnames are rare.  See also authors such as Sun Tzu, where in the author's culture the surname is traditionally printed first, and thus the 'last name' in terms of order is in fact the person's first-name culturally.)\n\n\n== Classification ==\n\nIn a subject catalog, one has to decide on which classification system to use.  The cataloger will select appropriate subject headings for the bibliographic item and a unique classification number (sometimes known as a \"call number\") which \nis used not only for identification but also for the purposes of shelving, placing items with similar subjects near one another, which aids in browsing by library users, who are thus often able to take advantage of serendipity in their search process.\n\n\n== Online ==\n\nOnline cataloging, through such systems as the Dynix software developed in 1983 and used widely through the late 1990s, has greatly enhanced the usability of catalogs, thanks to the rise of MARC standards (an acronym for MAchine Readable Cataloging) in the 1960s.Rules governing the creation of MARC catalog records include not only formal cataloging rules such as Anglo-American Cataloguing Rules, second edition (AACR2), Resource Description and Access (RDA) but also rules specific to MARC, available from both the U.S. Library of Congress and from OCLC, which builds and maintains WorldCat.MARC was originally used to automate the creation of physical catalog cards, but its use evolved into direct access to the MARC computer files during the search process.OPACs have enhanced usability over traditional card formats because:\nThe online catalog does not need to be sorted statically; the user can choose author, title, keyword, or systematic order dynamically.\nMost online catalogs allow searching for any word in a title or other field, increasing the ways to find a record.\nMany online catalogs allow links between several variants of an author's name.\nThe elimination of paper cards has made the information more accessible to many people with disabilities, such as the visually impaired, wheelchair users, and those who suffer from mold allergies or other paper- or building-related problems.\nPhysical storage space is considerably reduced.\nUpdates are significantly more efficient.\n\n\n== See also ==\nCataloging – Process of creating meta-data for information resources to include in a catalog databasePages displaying short descriptions of redirect targets\nInternational Standard Bibliographic Description – human-readable standard for description of bibliographic resourcesPages displaying wikidata descriptions as a fallback\nSocial cataloging application – collaborative cataloging of literature based in webPages displaying wikidata descriptions as a fallback\n\n\n== References ==\n\n\n== Sources ==\nMurray, Stuart (2009). The Library: An Illustrated History. Chicago: Skypoint Publishing. ISBN 978-1602397064.\n\n\n== Further reading ==\n\nChan, Lois Mai (2007). Cataloging and Classification: An Introduction (3rd ed.). Lanham: Scarecrow Press. ISBN 978-0810860001. OCLC 124031949.\nHanson, James C. M.; et al. (1908). Catalog Rules: Author and Title Entries (American ed.). Chicago: American Library Association. OCLC 1466843.\nJoudrey, Daniel N.; Taylor, Arlene G.; Miller, David P. (2015). Introduction to Cataloging and Classification (11th ed.). Santa Barbara, CA: Libraries Unlimited/ABC-CLIO. ISBN 978-1-59884-856-4. OCLC 911180115.\nLibrary of Congress (2017). The Card Catalog: Books, Cards, and Literary Treasures. Chronicle Books. ISBN 978-1452145402. OCLC 953599088.\nSvenonius, Elaine (2000). The Intellectual Foundation of Information Organization. Cambridge, Massachusetts: MIT Press. ISBN 9780262194334. OCLC 42040872.\nTaylor, Archer (1986). Book Catalogues: Their Varieties and Uses. Introductions, corrections and additions by W. P. Barlow, Jr. (2nd ed.). New York: Frederic C. Beil. ISBN 978-0913720660. OCLC 14931714. Previous edition: Taylor, Archer (1957). Book Catalogues: Their Varieties and Uses (1st ed.). Chicago: Newberry Library. OCLC 1705207.",
    "A library classification is a system of organization of knowledge in which sources are arranged according to the classification scheme and ordered very  systematically. Library classifications are a notational system that represents the order of topics in the classification and allows items to be stored in the order of classification. Library classification systems group related materials together, typically arranged as a hierarchical tree structure. A different kind of classification system, called a faceted classification system, is also widely used, which allows the assignment of multiple classifications to an object, enabling the classifications to be ordered in many ways.\n\n\n== Description ==\nLibrary classification is an  important and crucial aspect in library and information science. It is distinct from scientific classification in that it has as its goal to provide a useful ordering of documents rather than a theoretical organization of knowledge. Although it has the practical purpose of creating a physical ordering of documents, it does generally attempt to adhere to accepted scientific knowledge. Library classification helps to accommodate all the newly published literature in an already created order of  arrangement in a filial sequence.Library classification can be defined as the arrangement of books on shelves, or description of them, in the manner which is most useful to those who read with the ultimate aim of grouping similar things together. Library classification is meant to achieve these four purposes: ordering the fields of knowledge in a systematic way, bring related items together in the most helpful sequence, provide orderly access on the shelf, and provide a location for an item on the shelf.Library classification is distinct from the application of subject headings in that classification organizes knowledge into a systematic order, while subject headings provide access to intellectual materials through vocabulary terms that may or may not be organized as a knowledge system.\nThe characteristics that a bibliographic classification demands for the sake of reaching these purposes are: a useful sequence of subjects at all levels, a concise memorable notation, and a host of techniques and devices of number synthesis.\n\n\n== History ==\nLibrary classifications were preceded by classifications used by bibliographers such as Conrad Gessner. The earliest library classification schemes organized books in broad subject categories. The earliest known library classification scheme is the Pinakes by Callimachus, a scholar at the Library of Alexandria during the third century BC.  During the Renaissance and Reformation era, \"Libraries were organized according to the whims or knowledge of individuals in charge.\"   This changed the format in which various materials were classified.  Some collections were classified by language and others by how they were printed.\nAfter the printing revolution in the sixteenth century, the increase in available printed materials made such broad classification unworkable, and more granular classifications for library materials had to be developed in the nineteenth century.In 1627 Gabriel Naudé published a book called Advice on Establishing a Library. At the time, he was working in the private library of President Henri de Mesmes II. Mesmes had around 8,000 printed books and many more Greek, Latin and French written manuscripts. Although it was a private library, scholars with references could access it. The purpose of Advice on Establishing a Library was to identify rules for private book collectors to organize their collections in a more orderly way to increase the collection's usefulness and beauty. Naudé developed a classification system based on seven different classes: theology, medicine, jurisprudence, history, philosophy, mathematics and the humanities. These seven classes would later be increased to twelve. Advice on Establishing a Library was about a private library, but within the same book, Naudé encouraged the idea of public libraries open to all people regardless of their ability to pay for access to the collection. One of the most famous libraries that Naudé helped improve was the Bibliothèque Mazarine in Paris. Naudé spent ten years there as a librarian. Because of Naudé's strong belief in free access to libraries to all people, the Bibliothèque Mazarine became the first public library in France around 1644.Although libraries created order within their collections from as early as the fifth century BC, the Paris Bookseller's classification, developed in 1842 by Jacques Charles Brunet, is generally seen as the first of the modern book classifications. Brunet provided five major classes: theology, jurisprudence, sciences and arts, belles-lettres, and history. Classification can now be seen as a provider of subject access to information in a networked environment.\n\n\n== Types ==\nThere are many standard systems of library classification in use, and many more have been proposed over the years. However, in general, classification systems can be divided into three types depending on how they are used:\n\nUniversal schemes\nCovers all subjects, e.g. the Dewey Decimal Classification (DDC), Universal Decimal Classification (UDC), Library of Congress Classification (LCC), and Colon Classification (CC).\nSpecific classification schemes\nCovers particular subjects or types of materials, e.g. Iconclass (art), British Catalogue of Music Classification, and Dickinson classification (music), or the NLM Classification (medicine).\nNational schemes\nSpecially created for certain countries, e.g. Swedish library classification system, SAB (Sveriges Allmänna Biblioteksförening).In terms of functionality, classification systems are often described as:\n\nEnumerative\nSubject headings are listed alphabetically, with numbers assigned to each heading in alphabetical order.\nHierarchical\nSubjects are divided hierarchically, from most general to most specific.\nFaceted/analytico-synthetic\nSubjects are divided into mutually exclusive orthogonal facets.There are few completely enumerative systems or faceted systems; most systems are a blend but favouring one type or the other. The most common classification systems, LCC and DDC, are essentially enumerative, though with some hierarchical and faceted elements (more so for DDC), especially at the broadest and most general level. The first true faceted system was the colon classification of S. R. Ranganathan.\n\n\n== Methods or systems ==\nClassification types denote the classification or categorization according to the form or characteristics or qualities of a classification scheme or schemes. Method and system has similar meaning. Method or methods or system means the classification schemes like Dewey Decimal Classification or Universal Decimal Classification. The types of classification is for identifying and understanding or education or research purposes while classification method means those classification schemes like DDC, UDC.\n\n\n=== English language universal classification systems ===\nThe most common systems in English-speaking countries are:\n\nDewey Decimal Classification (DDC)\nLibrary of Congress Classification (LCC)\nColon classification (CC)\nUniversal Decimal Classification (UDC)Other systems include:\n\nMoys Classification Scheme, used in law libraries in many common law jurisdictions such as Canada, Australia, New Zealand, and the United Kingdom.\nHarvard-Yenching Classification, an English classification system for Chinese language materials\nVartavan Library Classification\nLondon Education Classification devised by D.J. Foskett and Joy Foskett and used at the UCL Institute of Education\nGarside classification used in most libraries of University College London\nBliss bibliographic classification used in some British libraries\nGladstone Library Classification, devised by W.E. Gladstone and used exclusively at Gladstone's Library\n\n\n=== Non-English universal classification systems ===\nGerman Regensburger Verbundklassifikation (RVK)\nA system of book classification for Chinese libraries (Liu's Classification) library classification for user\nNew Classification Scheme for Chinese Libraries\nNippon Decimal Classification (NDC)\nChinese Library Classification (CLC)\nKorean Decimal Classification (KDC)\nRussian Library-Bibliographical Classification (BBK)\n\n\n=== Universal classification systems that rely on synthesis (faceted systems) ===\nBliss bibliographic classification\nColon classification\nCutter Expansive Classification\nUniversal Decimal ClassificationNewer classification systems tend to use the principle of synthesis (combining codes from different lists to represent the different attributes of a work) heavily, which is comparatively lacking in LC or DDC.\n\n\n== The practice of classifying ==\nLibrary classification is associated with library (descriptive) cataloging under the rubric of cataloging and classification, sometimes grouped together as technical services. The library professional who engages in the process of cataloging and classifying library materials is called a cataloger or catalog librarian. Library classification systems are one of the two tools used to facilitate subject access.  The other consists of alphabetical indexing languages such as Thesauri and Subject Headings systems.\nLibrary classification of a piece of work consists of two steps. Firstly, the subject or topic of the material is ascertained. Next, a call number (essentially a book's address) based on the classification system in use at the particular library will be assigned to the work using the notation of the system.\nUnlike subject heading or thesauri where multiple terms can be assigned to the same work, in library classification systems, each work can only be placed in one class. This is due to shelving purposes: A book can have only one physical place. However, in classified catalogs one may have main entries as well as added entries. Most classification systems like the Dewey Decimal Classification (DDC) and Library of Congress Classification also add a cutter number to each work which adds a code for the main entry (primary access point) of the work (e.g. author).\nClassification systems in libraries generally play two roles. Firstly, they facilitate subject access by allowing the user to find out what works or documents the library has on a certain subject. Secondly, they provide a known location for the information source to be located (e.g. where it is shelved).\nUntil the 19th century, most libraries had closed stacks, so the library classification only served to organize the subject catalog. In the 20th century, libraries opened their stacks to the public and started to shelve library material itself according to some library classification to simplify subject browsing.\nSome classification systems are more suitable for aiding subject access, rather than for shelf location. For example, Universal Decimal Classification, which uses a complicated notation of pluses and colons, is more difficult to use for the purpose of shelf arrangement but is more expressive compared to DDC in terms of showing relationships between subjects. Similarly faceted classification schemes are more difficult to use for shelf arrangement, unless the user has knowledge of the citation order.\nDepending on the size of the library collection, some libraries might use classification systems solely for one purpose or the other. In extreme cases, a public library with a small collection might just use a classification system for location of resources but might not use a complicated subject classification system. Instead all resources might just be put into a couple of wide classes (travel, crime, magazines etc.). This is known as a \"mark and park\" classification method, more formally called reader interest classification.\n\n\n== Comparing library classification systems ==\nAs a result of differences in notation, history, use of enumeration, hierarchy, and facets, classification systems can differ in the following ways:\n\nType of Notation: Notation can be pure (consisting of only numerals, for example) or mixed (consisting of letters and numerals, or letters, numerals, and other symbols).\nExpressiveness: This is the degree to which the notation can express relationship between concepts or structure.\nWhether they support mnemonics: For example, the number 44 in DDC notation often means it concerns some aspect of France. For example, in the Dewey classification 598.0944 concerns \"Birds in France\", the 09 signifies geographic division, and 44 represents France.\nHospitality: The degree to which the system is able to accommodate new subjects.\nBrevity: The length of the notation to express the same concept.\nSpeed of updates and degree of support: The better classification systems are frequently being reviewed.\nConsistency\nSimplicity\nUsability\n\n\n== See also ==\nAttribute-value system\nCategorization\nClassification (general theory)\nDecimal classification\nDocument classification\nInformation retrieval\nKnowledge organization\nLibrary management\nLibrary of Congress Subject Headings\nW. C. Berwick Sayers\nSubject indexing\n\n\n== Notes ==\n\n\n== References ==\n\nChan, L. M. (1994). Cataloging and Classification: An Introduction. New York: McGraw-Hill. ISBN 9780070105065.",
    "The Library of Congress Classification (LCC) is a system of library classification developed by the Library of Congress in the United States, which can be used for shelving books in a library. LCC is mainly used by large research and academic libraries, while most public libraries and small academic libraries used the Dewey Decimal Classification system. The classification was developed by James Hanson (chief of the Catalog Department), with assistance from Charles Martel, in 1897, while they were working at the Library of Congress. It was designed specifically for the purposes and collection of the Library of Congress to replace the fixed location system developed by Thomas Jefferson.\nLCC has been criticized for lacking a sound theoretical basis; many of the classification decisions were driven by the practical needs of that library rather than epistemological considerations. Although it divides subjects into broad categories, it is essentially enumerative in nature. That is, it provides a guide to the books actually in one library's collections, not a classification of the world.\n\n\n== History ==\nThe central core of the modern Library of Congress was formed from books sold to the government by Thomas Jefferson after the original collection was razed by the British in the War of 1812. As a result, the original classification system used by the library was of his own invention. However, by the end of the nineteenth century, the collection had grown to over a million volumes and his system was deemed too unwieldy.John Russell Young, the seventh Librarian of Congress, hired James Hanson and Charles Martel in 1897, who began the development of a new classification system that would more accurately describe the collections the library held. Young's tenure as Librarian ended with his death in 1899, and his successor, Herbert Putnam, continued to implement the updates to the catalog through his long stay in the office. By the time he departed from his post in 1939, all the classes except K (Law) were well developed.In creating their classification system, Hanson and Martel evaluated several systems already in existence, including the Dewey Decimal System, Charles Ammi Cutter's Cutter Expansive Classification, the Index Medicus, and the Putnam Classification System (developed while Putnam was head librarian at the Minneapolis Public Library). The one closest to their needs was Cutter's; however, he died before the completion of his system. Hanson and Martel thus decided to develop their own unique system, strongly based on his ideas. They published their first outline of the classification scheme in 1904. Development of the classes continued throughout the twentieth century. The last class to be developed was K (Law): the first K schedule was published in 1969 and not completed until the 2004 publication of KB.From 1996 onwards, the LCC schedules were available online, and since 2013, there have been no new print editions of the classification system. All updates are now distributed by the Library's Cataloging Distribution Service entirely online.\n\n\n== Design and organization ==\nLCC divides all knowledge into twenty-one basic classes, exchanges given a single letter of the alphabet as an identifier. The vast majority of these classes are divided further into two and three level sub-classes. With these sub-classes, numerical ranges are assigned to topics, going from more general to more specific. Unlike in the Dewey Decimal Classification, where the numbers assigned to a topic iterate throughout the system (e.g., the \".05\" tag indicated a periodical publication on the topic), the LCC numerical ranges are strictly hierarchal, only corresponding to their level on the outline. LCC is enumerative, meaning that it lists all the classes in officially published schedules, which are updated as needed by the Library of Congress.\nAfter the range of numbers making up the topical division, call numbers often also include one or more Cutter numbers, modeled after the unfinished Cutter Expansive Classification index. The full LCC schedules contain tables that describe Cutter numbers for certain types of media, collections of work, and geographical areas. Cutter numbers also can take the form of an author-specific code, containing a letter and several numbers corresponding to the author's last name. This serves to further distinguish publications and nominally alphabetize volumes within a topic section. The final component of a typical LCC call-number is the publication year, in full. Library collections can add modifiers to distinguish specific volumes, such as \"Copy 1.\"LCC should not be confused with Library of Congress Control Numbers (LCCN), which are assigned to all books (and authors) and defines online catalog entries. Library of Congress Classification is also distinct from Library of Congress Subject Headings, the system of labels such as \"Glaciers\" and \"Glaciers—Fiction\" that describe contents systematically.One variation from the original LCC system is the National Library of Medicine classification system (NLM), which uses the initial letters W and QS–QZ, which are not used by LCC. Some libraries use NLM in conjunction with LCC, eschewing LCC's R, QM, and QP, which overlap with NLM's schema. Another is the Canadian Universities and the Canadian National Library using FC for Canadian History, a subclass that LCC has not officially adopted, but which it has agreed not to use for anything else.\n\n\n=== Classes ===\n\n\n== Use and criticism ==\nTogether with the Dewey Decimal System (DDC), LCC make up the two main classification system used in U.S. libraries. LCC is favored by large academic and research libraries.\nSystems of classification can be evaluated on several metrics, including expressiveness (the ability of the numeration system to express the hierarchal and correlative relationships between topics), hospitality (the ability of the system to accommodate new subjects), and brevity (length of call numbers). While LCC is significantly less expressive than DDC, it is extremely hospitable, mainly in the fact that five class (I, O, W, X, and Y) lack any assignment to topics. LCC call numbers also tend to be shorter than those in DDC.\nThe main difference between DDC and LCC is their approach to classifying. Dewey's system is a comprehensive classification to all topics, with no regard to the actual collections a library might hold. While this has allowed it to be successfully adapted into more modern classification systems for use outside of libraries, such as the Universal Decimal Classification (UDC), it does make it more unwieldy for large or specialized collections. On the other hand, Hanson and Martel designed LCC specifically for library use, which means while it does not completely enumerate the world, it does more reflect what books a library might hold.Because LCC was designed around the collections of the Library of Congress, it has an American, European, and Christian bias, as reflected mainly in the earlier developed schedules of D (World History), E and F (History of the Americas), and B (Philosophy, Psychology, Religion). On the other hand, the later-developed K (Law) gives fairly even weight to global law. Today, the various schedules are maintained and revised by the Library's Policy and Standards Division, in conjunction with experts in each field. However, updating various schedules with classification biases is generally assumed to be impractical due to the massive workload that would result in,  especially as the \"discipline\" based classes of LCC have been entrenched in the average library user's mind.Like all classification systems, LCC struggles with catering to interdisciplinary scholars and topics, as ultimately, a book can only be shelved in a single location.  Additionally, LCC has a problem with \"othering\" marginalized groups, making works related to or authored by members of these groups particularly difficult to locate. This is not a new issue, and libraries with more specialized collections about minority groups or issues sometimes eschew LCC, with one example alternative classification being the Harvard–Yenching Classification, specifically developed for Chinese language materials.\n\n\n== Full classification outline ==\n\n\n=== Class A – general works ===\n\nSubclass AC – Collections. Series. Collected works\nSubclass AE – Encyclopedias\nSubclass AG – Dictionaries and other general reference works\nSubclass AI – Indexes\nSubclass AM – Museums. Collectors and collecting\nSubclass AN – Newspapers\nSubclass AP – Periodicals\nSubclass AS – Academies and learned societies\nSubclass AY – Yearbooks. Almanacs. Directories\nSubclass AZ – History of scholarship and learning. The humanities\n\n\n=== Class B – Philosophy, Psychology, Religion ===\n\nSubclass B – Philosophy (General)\nSubclass BC – Logic\nSubclass BD – Speculative philosophy\nSubclass BF – Psychology\nSubclass BH – Aesthetics\nSubclass BJ – Ethics\nSubclass BL – Religions. Mythology. Rationalism\nSubclass BM – Judaism\nSubclass BP – Islam. Baháʼísm. Theosophy, etc.\nSubclass BQ – Buddhism\nSubclass BR – Christianity\nSubclass BS – The Bible\nSubclass BT – Doctrinal theology\nSubclass BV – Practical theology\nSubclass BX – Christian Denominations\n\n\n=== Class C – Auxiliary Sciences of History ===\n\nSubclass C – Auxiliary Sciences of History\nSubclass CB – History of Civilization\nSubclass CC – Archaeology\nSubclass CD – Diplomatics. Archives. Seals\nSubclass CE – Technical Chronology; Calendar\nSubclass CJ – Numismatics\nSubclass CN – Inscriptions; Epigraphy\nSubclass CR – Heraldry\nSubclass CS – Genealogy\nSubclass CT – Biography\n\n\n=== Class D – World History and History of Europe, Asia, Africa, Australia, New Zealand, etc. ===\n\nSubclass D – History (General)\nSubclass DA – Great Britain\nSubclass DAW – Central Europe\nSubclass DB – Austria – Liechtenstein – Hungary – Czechoslovakia\nSubclass DC – France – Andorra – Monaco\nSubclass DD – Germany\nSubclass DE – Greco-Roman World\nSubclass DF – Greece\nSubclass DG – Italy – Malta\nSubclass DH – Low Countries – Benelux Countries\nSubclass DJ – Netherlands (Holland)\nSubclass DJK – Eastern Europe (General)\nSubclass DK – Russia. Soviet Union. Former Soviet Republics – Poland\nSubclass DL – Northern Europe. Scandinavia\nSubclass DP – Spain – Portugal\nSubclass DQ – Switzerland\nSubclass DR – Balkan Peninsula\nSubclass DS – Asia\nSubclass DT – Africa\nSubclass DU – Oceania (South Seas)\nSubclass DX – Romanies\n\n\n=== Class E  – History of America ===\n\nClass E does not have any subclasses.\n\n\n=== Class F – Local History of the Americas ===\n\nClass F does not have any subclasses, though Canadian Universities and the Canadian National Library use FC for Canadian History, a subclass that LCC has not officially adopted, but which it has agreed not to use for anything else.\n\n\n=== Class G – Geography, Anthropology, Recreation ===\n\nSubclass G – Geography (General). Atlases. Maps\nSubclass GA – Mathematical geography. Cartography\nSubclass GB – Physical geography\nSubclass GC – Oceanography\nSubclass GE – Environmental Sciences\nSubclass GF – Human ecology. Anthropogeography\nSubclass GN – Anthropology\nSubclass GR – Folklore\nSubclass GT – Manners and customs (General)\nSubclass GV – Recreation. Leisure\n\n\n=== Class H – Social Sciences ===\n\nSubclass H – Social sciences (General)\nSubclass HA – Statistics\nSubclass HB – Economic theory. Demography\nSubclass HC – Economic history and conditions\nSubclass HD – Industries. Land use. Labor\nSubclass HE – Transportation and communications\nSubclass HF – Commerce\nSubclass HG – Finance\nSubclass HJ – Public finance\nSubclass HM – Sociology (General)\nSubclass HN – Social history and conditions. Social problems. Social reform\nSubclass HQ – The family. Marriage, Women and Sexuality\nSubclass HS – Societies: secret, benevolent, etc.\nSubclass HT – Communities. Classes. Races\nSubclass HV – Social pathology. Social and public welfare. Criminology\nSubclass HX – Socialism. Communism. Anarchism\n\n\n=== Class J – Political Science ===\n\nSubclass J – General legislative and executive papers\nSubclass JA – Political science (General)\nSubclass JC – Political theory\nSubclass JF – Political institutions and public administration\nSubclass JJ – Political institutions and public administration (North America)\nSubclass JK – Political institutions and public administration (United States)\nSubclass JL – Political institutions and public administration (Canada, Latin America, etc.)\nSubclass JN – Political institutions and public administration (Europe)\nSubclass JQ – Political institutions and public administration (Asia, Africa, Australia, Pacific Area, etc.)\nSubclass JS – Local government. Municipal government\nSubclass JV – Colonies and colonization. Emigration and immigration. International migration\nSubclass JX – International law, see JZ and KZ (obsolete)\nSubclass JZ – International relations\n\n\n=== Class K – Law ===\n\nSubclass K – Law in general. Comparative and uniform law. Jurisprudence\nSubclass KB – Religious law in general. Comparative religious law. Jurisprudence\nSubclass KBM – Jewish law\nSubclass KBP – Islamic law\nSubclass KBR – History of canon law\nSubclass KBS – Canon law of Eastern churches\nSubclass KBT – Canon law of Eastern Rite Churches in Communion with the Holy See of Rome\nSubclass KBU – Law of the Roman Catholic Church. The Holy See\nSubclasses – KD/KDK - United Kingdom and Ireland\nSubclass KDZ – America. North America\nSubclass KE – Canada\nSubclass KF – United States\nSubclass KG – Latin America – Mexico and Central America – West Indies. Caribbean area\nSubclass KH – South America\nSubclasses KJ-KKZ – Europe\nSubclasses KL-KWX – Asia and Eurasia, Africa, Pacific Area, and Antarctica\nSubclass KU/KUQ – Law of Australia and New Zealand\nSubclass KZ – Law of nations\n\n\n=== Class L – Education ===\n\nSubclass L – Education (General)\nSubclass LA – History of education\nSubclass LB – Theory and practice of education\nSubclass LC – Special aspects of education\nSubclass LD – Individual institutions – United States\nSubclass LE – Individual institutions – America (except United States)\nSubclass LF – Individual institutions – Europe\nSubclass LG – Individual institutions – Asia, Africa, Indian Ocean islands, Australia, New Zealand, Pacific islands\nSubclass LH – College and school magazines and papers\nSubclass LJ – Student fraternities and societies, United States\nSubclass LT – Textbooks\n\n\n=== Class M – Music ===\n\nSubclass M – Music\nSubclass ML – Literature on music\nSubclass MT – Instruction and study\n\n\n=== Class N – Fine Arts ===\n\nSubclass N – Visual Arts\nSubclass NA – Architecture\nSubclass NB – Sculpture\nSubclass NC – Drawing. Design. Illustration\nSubclass ND – Painting\nSubclass NE – Print media\nSubclass NK – Decorative arts\nSubclass NX – Arts in general\n\n\n=== Class P – Language and Literature ===\n\nSubclass P – Philology. Linguistics\nSubclass PA – Greek language and literature. Latin language and literature\nSubclass PB – Modern languages. Celtic languages and literature\nSubclass PC – Romanic languages\nSubclass PD – Germanic languages. Scandinavian languages\nSubclass PE – English language\nSubclass PF – West Germanic languages\nSubclass PG – Slavic languages and literature. Baltic languages. Albanian language\nSubclass PH – Uralic languages. Basque language\nSubclass PJ – Oriental languages and literatures\nSubclass PK – Indo-Iranian languages and literature\nSubclass PL – Languages and literature of Eastern Asia, Africa, Oceania\nSubclass PM – Hyperborean, Native American, and artificial languages\nSubclass PN – Literature (General)\nSubclass PQ – French literature – Italian literature – Spanish literature – Portuguese literature\nSubclass PR – English literature\nSubclass PS – American literature\nSubclass PT – German literature – Dutch literature – Flemish literature since 1830 – Afrikaans literature -Scandinavian literature – Old Norse literature: Old Icelandic and Old Norwegian – Modern Icelandic literature – Faroese literature – Danish literature – Norwegian literature – Swedish literature\nSubclass PZ – Fiction and juvenile belles lettres\n\n\n=== Class Q – Science ===\n\nSubclass Q – Science (General)\nSubclass QA – Mathematics\nSubclass QB – Astronomy\nSubclass QC – Physics\nSubclass QD – Chemistry\nSubclass QE – Geology\nSubclass QH – Natural history – Biology\nSubclass QK – Botany\nSubclass QL – Zoology\nSubclass QM – Human anatomy\nSubclass QP – Physiology\nSubclass QR – Microbiology\n\n\n=== Class R – Medicine ===\n\nSubclass R – Medicine (General)\nSubclass RA – Public aspects of medicine\nSubclass RB – Pathology\nSubclass RC – Internal medicine\nSubclass RD – Surgery\nSubclass RE – Ophthalmology\nSubclass RF – Otorhinolaryngology\nSubclass RG – Gynecology and Obstetrics\nSubclass RJ – Pediatrics\nSubclass RK – Dentistry\nSubclass RL – Dermatology\nSubclass RM – Therapeutics. Pharmacology\nSubclass RS – Pharmacy and materia medica\nSubclass RT – Nursing\nSubclass RV – Botanic, Thomsonian, and Eclectic medicine\nSubclass RX – Homeopathy\nSubclass RZ – Other systems of medicine\n\n\n=== Class S – Agriculture ===\n\nSubclass S – Agriculture (General)\nSubclass SB – Horticulture. Plant propagation. Plant breeding\nSubclass SD – Forestry. Arboriculture. Silviculture\nSubclass SF – Animal husbandry.  Animal science\nSubclass SH – Aquaculture. Fisheries. Angling\nSubclass SK – Hunting\n\n\n=== Class T – Technology ===\n\nSubclass T – Technology (General)\nSubclass TA – Engineering Civil engineering (General).\nSubclass TC – Hydraulic engineering. Ocean engineering\nSubclass TD – Environmental technology. Sanitary engineering\nSubclass TE – Highway engineering. Roads and pavements\nSubclass TF – Railroad engineering and operation\nSubclass TG – Bridges\nSubclass TH – Building construction\nSubclass TJ – Mechanical engineering and machinery\nSubclass TK – Electrical engineering. Electronics. Nuclear engineering\nSubclass TL – Motor vehicles. Aeronautics. Astronautics\nSubclass TN – Mining engineering. Metallurgy\nSubclass TP – Chemical technology\nSubclass TR – Photography\nSubclass TS – Manufacturing engineering. Mass production\nSubclass TT – Handicrafts. Arts and crafts\nSubclass TX – Home economics\n\n\n=== Class U – Military Science ===\n\nSubclass U – Military science (General)\nSubclass UA – Armies: Organization, distribution, military situation\nSubclass UB – Military administration\nSubclass UC – Military maintenance and transportation\nSubclass UD – Infantry\nSubclass UE – Cavalry. Armor\nSubclass UF – Artillery\nSubclass UG – Military engineering. Air forces\nSubclass UH – Other military services\n\n\n=== Class V – Naval Science ===\n\nSubclass V – Naval science (General)\nSubclass VA – Navies: Organization, distribution, naval situation\nSubclass VB – Naval administration\nSubclass VC – Naval maintenance\nSubclass VD – Naval seamen\nSubclass VE – Marines\nSubclass VF – Naval ordnance\nSubclass VG – Minor services of navies\nSubclass VK – Navigation. Merchant marine\nSubclass VM – Naval architecture. Shipbuilding. Marine engineering\n\n\n=== Class Z – Bibliography, Library Science ===\n\nSubclass Z – Books (General). Writing. Paleography. Book industries and trade. Libraries. Bibliography\nSubclass ZA – Information resources/materials\n\n\n== See also ==\nACM Computing Classification System\nBooks in the United States\nBrinkler classification\nChinese Library Classification\nDatabase of Recorded American Music\nDewey Decimal Classification\nComparison of Dewey and Library of Congress subject classification\nHarvard–Yenching Classification\nMoys Classification Scheme\nISBN\nMinnie Earl Sears, formulated Sears Subject Headings, simplified for use by small libraries\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n\nLibrary of Congress classification outline, loc.gov\nFull list of LCC classification schedules, loc.gov\nLibrary of Congress – classification, loc.gov\nCataloging Distribution Services – source of Library of Congress Classification schedules. loc.gov\nClassification outline, loc.gov\nHow to read LCC call numbers, geography.about.com (via The Wayback Machine)\nHow to use LCC to organize a home library, zackgrossbart.com",
    "The following outline is provided as an overview of and topical guide to geography:\nGeography – study of earth and its people.\n\n\n== Nature of geography ==\n\n\n=== Geography as ===\nan academic discipline – a body of knowledge given to − or received by − a disciple (student); a branch or sphere of knowledge, or field of study, that an individual has chosen to specialize in. Modern geography is an all-encompassing discipline that seeks to understand the Earth and its human and natural complexities − not merely where objects are, but how they have changed and come to be. Geography has been called 'the world discipline'.\na field of science – widely recognized category of specialized expertise within science, and typically embodies its own terminology and nomenclature. This field will usually be represented by one or more scientific journals, where peer-reviewed research is published. There are many geography-related scientific journals.\na natural science – field of academic scholarship that explores aspects of the natural environment (physical geography).\na social science – field of academic scholarship that explores aspects of human society (human geography).\nan interdisciplinary field – a field that crosses traditional boundaries between academic disciplines or schools of thought, as new needs and professions have emerged. Many of the branches of physical geography are also branches of Earth science\n\n\n== Branches of geography ==\nAs \"the bridge between the human and physical sciences,\" geography is divided into two main branches:\n\nhuman geography\nphysical geographyOther branches include:\n\nintegrated geography\ntechnical geography\nregional geography\n\n\n=== Physical geography ===\nPhysical geography – examines the natural environment and how the climate, vegetation & life, soil, water, and landforms are produced and interact.\n\n\n==== Fields of physical geography ====\nGeomorphology – study of landforms and the processes that them, and more broadly, of the processes controlling the topography of any planet. Seeks to understand why landscapes look the way they do, to understand landform history and dynamics, and to predict future changes through field observation, physical experiment, and numerical modeling.\nHydrology – study the movement, distribution, and quality of water throughout the Earth, including the hydrologic cycle, water resources and environmental watershed sustainability.\nGlaciology – study of glaciers, or more generally ice and natural phenomena that involve ice.\nOceanography – studies a wide range of topics about oceans, including marine organisms and ecosystem dynamics; ocean currents, waves, and geophysical fluid dynamics; plate tectonics and the geology of the sea floor; and fluxes of various chemical substances and physical properties within the ocean and across its boundaries.\nBiogeography – study of the distribution of species spatially and temporally. Over areal ecological changes, it is also tied to the concepts of species and their past, or present living 'refugium', their survival locales, or their interim living sites. It aims to reveal where organisms live, and at what abundance.\nClimatology – study of climate, scientifically defined as weather conditions averaged over a period of time.\nMeteorology is the interdisciplinary scientific study of the atmosphere that focuses on weather processes and short term forecasting (in contrast with climatology).\nPedology – study of soils in their natural environment that deals with pedogenesis, soil morphology, and soil classification.\nPalaeogeography – study of what the geography was in times past, most often concerning the physical landscape, but also the human or cultural environment.\nCoastal geography – study of the dynamic interface between the ocean and the land, incorporating both the physical geography (i.e. coastal geomorphology, geology and oceanography) and the human geography (sociology and history) of the coast. It involves an understanding of coastal weathering processes, particularly wave action, sediment movement and weather, and also the ways in which humans interact with the coast.\nQuaternary science – focuses on the Quaternary period, which encompasses the last 2.6 million years, including the last ice age and the Holocene period.\nLandscape ecology – the relationship between spatial patterns of urban development and ecological processes on a multitude of landscape scales and organizational levels.\n\n\n==== Approaches of physical geography ====\nQuantitative geography – Quantitative research tools and methods applied to geography. See also the quantitative revolution.\nSystems approach –\n\n\n=== Human geography ===\nHuman geography – one of the two main subfields of geography, it is the study of human use and understanding of the world and the processes which have affected it. Human geography broadly differs from physical geography in that it focuses on the built environment and how space is created, viewed, and managed by humans as well as the influence humans have on the space they occupy.\n\n\n==== Fields of human geography ====\nCultural geography – study of cultural products and norms and their variations across and relations to spaces and places. It focuses on describing and analyzing the ways language, religion, economy, government, and other cultural phenomena vary or remain constant from one place to another and on explaining how humans function spatially.Children's geographies – study of places and spaces of children's lives, characterized experientially, politically and ethically. Children's geographies rest on the idea that children as a social group share certain characteristics which are experientially, politically and ethically significant and which are worthy of study. The pluralization in the title is intended to imply that children's lives will be markedly different in differing times and places and in differing circumstances such as gender, family, and class. The range of foci within children's geographies include:\nChildren and the city\nChildren and the countryside\nChildren and technology\nChildren and nature,\nChildren and globalization\nMethodologies of researching children's worlds\nEthics of researching children's worlds\nOtherness of childhood\nAnimal geographies – studies the spaces and places occupied by animals in human culture because social life and space is heavily populated by animals of many different kinds and in many differing ways (e.g. farm animals, pets, wild animals in the city). Another impetuses that has influenced the development of the field is ecofeminist and other environmentalist viewpoints on nature-society relations (including questions of animal welfare and rights).\nLanguage geography – studies the geographic distribution of language or its constituent elements. There are two principal fields of study within the geography of language:\nGeography of languages – deals with the distribution through history and space of languages,\nLinguistic geography – deals with regional linguistic variations within languages.\nSexuality and space – encompasses all relationships and interactions between human sexuality, space, and place, including the geographies of LGBT residence, public sex environments, sites of queer resistance, global sexualities, sex tourism, the geographies of prostitution and adult entertainment, use of sexualised locations in the arts, and sexual citizenship.\nReligion geography – study of the influence of geography, i.e. place and space, on religious belief.\nDevelopment geography – study of the Earth's geography with reference to the standard of living and quality of life of its human inhabitants. Measures development by looking at economic, political and social factors, and seeks to understand both the geographical causes and consequences of varying development, in part by comparing More Economically Developed Countries (MEDCs) with Less Economically Developed Countries (LEDCs).\nEconomic geography – study of the location, distribution and spatial organization of economic activities across the world. Subjects of interest include but are not limited to the location of industries, economies of agglomeration (also known as \"linkages\"), transportation, international trade and development, real estate, gentrification, ethnic economies, gendered economies, core-periphery theory, the economics of urban form, the relationship between the environment and the economy (tying into a long history of geographers studying culture-environment interaction), and globalization.\nMarketing geography – a discipline within marketing analysis which uses geolocation (geographic information) in the process of planning and implementation of marketing activities. It can be used in any aspect of the marketing mix – the product, price, promotion, or place (geo targeting).\nTransportation geography – branch of economic geography that investigates spatial interactions between people, freight and information. It studies humans and their use of vehicles or other modes of traveling as well as how markets are serviced by flows of finished goods and raw materials.\nHealth geography – application of geographical information, perspectives, and methods to the study of health, disease, and health care, to provide a spatial understanding of a population's health, the distribution of disease in an area, and the environment's effect on health and disease. It also deals with accessibility to health care and spatial distribution of health care providers.\nTime geography – study of the temporal factor on spatial human activities within the following constraints:Authority - limits of accessibility to certain places or domains placed on individuals by owners or authorities\nCapability - limitations on the movement of individuals, based on their nature. For example, movement is restricted by biological factors, such as the need for food, drink, and sleep\nCoupling - restraint of an individual, anchoring him or her to a location while interacting with other individuals in order to complete a taskHistorical geography – study of the human, physical, fictional, theoretical, and \"real\" geographies of the past, and seeks to determine how cultural features of various societies across the planet emerged and evolved, by understanding how a place or region changes through time, including how people have interacted with their environment and created the cultural landscape.\nPolitical geography – study of the spatially uneven outcomes of political processes and the ways in which political processes are themselves affected by spatial structures. Basically, the inter-relationships between people, state, and territory.\nElectoral geography – study of the relationship between election results and the regions they affect (such as the environmental impact of voting decisions), and of the effects of regional factors upon voting behavior.\nGeopolitics – analysis of geography, history and social science with reference to spatial politics and patterns at various scales, ranging from the level of the state to international.\nStrategic geography – concerned with the control of, or access to, spatial areas that affect the security and prosperity of nations.\nMilitary geography – the application of geographic tools, information, and techniques to solve military problems in peacetime or war.\nPopulation geography – study of the ways in which spatial variations in the distribution, composition, migration, and growth of populations are related to the nature of places.\nTourism geography – study of travel and tourism, as an industry and as a social and cultural activity, and their effect on places, including the environmental impact of tourism, the geographies of tourism and leisure economies, answering tourism industry and management concerns and the sociology of tourism and locations of tourism.\nUrban geography – the study of urban areas, in terms of concentration, infrastructure, economy, and environmental impacts.\n\n\n==== Approaches of human geography ====\nBehavioral geography – Approach to human geography that examines human behavior using a disaggregate approach\nCognitive geography – Interdisciplinary study of cognitive science and geography\nCritical geography – Variant of social science that seeks to interpret and change the world\nFeminist geography – Approach in human geography which applies the theories, methods and critiques of feminism\nMarxist geography – Strand of critical geography\nNon-representational theory\nPostcolonialism – Critical academic study of the cultural legacy of colonialism and imperialism\nPost-structuralism – Philosophical school and tradition –\nQualitative geography – qualitative research tools and methods applied to geography.\n\n\n=== Integrated geography ===\nIntegrated geography – branch of geography that describes the spatial aspects of interactions between humans and the natural world. It requires an understanding of the dynamics of geology, meteorology, hydrology, biogeography, ecology, and geomorphology, as well as the ways in which human societies conceptualize the environment.\n\n\n=== Technical geography ===\nTechnical geography – branch of geography and the discipline of studying, developing, and applying methods to gather, store, process, and deliver geographic or spatially referenced information. It is a widespread interdisciplinary field that includes the tools and techniques used in land surveying, remote sensing, cartography, Geographic Information Systems (GIS), Global Navigation Satellite Systems, photogrammetry, and related forms of earth mapping.\n\n\n==== Fields contributing to technical geography ====\nGeomatics – Geographic data discipline\nPhotogrammetry – Taking measurements using photography\nCartography – Study and practice of making maps\nDigital terrain modelling – 3D computer-generated imagery and measurements of terrainPages displaying short descriptions of redirect targets\nGeodesy – Science of measuring the shape, orientation, and gravity of the Earth and other astronomical bodies\nGeographic information system – System to capture, manage and present geographic data\nGeospatial – Data and information having an implicit or explicit association with a locationPages displaying short descriptions of redirect targets\nGlobal navigation satellite systems represented by Satellite navigation – Use of satellite signals for geo-spatial positioning – Any system that uses satellite radio signals to provide autonomous geo-spatial positioning\nGlobal Positioning System – American satellite-based radio navigation service\nHydrography – Applied science of measurement and description of physical features of bodies of water\nMathematics – Area of knowledge\nNavigation – Process of monitoring and controlling the movement of a craft or vehicle from one place to another\nRemote sensing – Acquisition of information at a significant distance from the subject\nSurveying – Science of determining the positions of points and the distances and angles between them\n\n\n=== Regional geography ===\nRegional geography – study of world regions. Attention is paid to unique characteristics of a particular region such as its natural elements, human elements, and regionalization which covers the techniques of delineating space into regions. Regional geography breaks down into the study of specific regions.\nRegion – an area, defined by physical characteristics, human characteristics, or functional characteristics. The term is used in various ways among the different branches of geography. A region can be seen as a collection of smaller units, such as a country and its political divisions, or as one part of a larger whole, as in a country on a continent.\n\n\n==== Continents ====\nContinent – one of several large landmasses on Earth. They are generally identified by convention rather than any specific criteria, but seven areas are commonly regarded as continents. They are:\n\n1. Africa   (outline) –\n2. Antarctica –\n3. Australia   (outline) –\nThe Americas:\n4. North America   (outline) –\n5. South America   (outline) –\nEurasia:\n6. Europe   (outline) –\n7. Asia   (outline) –\n\n\n===== Subregions =====\nSubregion (list)\n\n\n==== Biogeographic regions ====\n\n\n===== Biogeographic realm =====\nThe World Wildlife Fund (WWF) developed a system of eight biogeographic realms (ecozones):\n\nNearctic 22.9 mil. km2 (including most of North America)\nPalearctic 54.1 mil. km2 (including the bulk of Eurasia and North Africa)\nAfrotropic 22.1 mil. km2 (including Sub-Saharan Africa)\nIndomalaya 7.5 mil. km2 (including the South Asian subcontinent and Southeast Asia)\nAustralasia 7.7 mil. km2 (including Australia, New Guinea, and neighboring islands). The northern boundary of this zone is known as the Wallace line.\nNeotropic 19.0 mil. km2 (including South America and the Caribbean)\nOceania 1.0 mil. km2 (including Polynesia, Fiji and Micronesia)\nAntarctic 0.3 mil. km2 (including Antarctica).\n\n\n===== Ecoregions =====\nEcoregion\nBiogeographic realms are further divided into ecoregions. The World has over 800 terrestrial ecoregions. See Lists of ecoregions by country.\n\n\n==== Geography of the political divisions of the World ====\n\n\n==== Other regions ====\nAtlantic World\nBermuda Triangle\nPacific Rim\nPacific Ring of Fire\n\n\n== History of geography ==\n\nTopics pertaining to the geographical study of the World throughout history:\n\n\n=== By period ===\nAncient roads\nAncient Greek geography\nAge of discovery\nMajor explorations after the Age of Discovery\nCritical geography\nEnvironmental determinism\n\n\n=== By region ===\nChinese geography\nHistory of human geography in China\n\n\n=== By subject ===\nHistorical population of the world\n\n\n==== By field ====\nHistory of human geography\nHistory of cartography\nHistory of longitude – Record of humanity's attempts to find east-west position on Earth\nLongitude Prize – 2014 British inducement prize contest\nHistory of cultural geography\nHistory of economic geography\nHistory of health geography\nHistory of political geography\nHistory of demography\nHistory of physical geography\nHistory of biogeography\nHistory of climatology\nHistory of meteorology\nHistory of geodesy\nHistory of geomorphology\nHistory of hydrology\nHistory of oceanography\nHistory of landscape ecology\nHistory of regional geography\n\n\n== Elements of geography ==\nTopics common to the various branches of geography include:\n\n\n=== Tasks and tools of geography ===\n\nExploration – Process of investigating unfamiliar things\nGeocode, also known as Geospatial Entity Object Code – Process of turning a place name/address to coordinatesPages displaying short descriptions of redirect targets\nGeographic information system (GIS) – System to capture, manage and present geographic data\nGlobe – Scale model of a celestial body\nMap – Symbolic depiction of relationships\nAtlas – Collection of maps\nCartography – Study and practice of making maps\nOutline of cartography – Overview of and topical guide to cartography\nMap projection – Systematic representation of the surface of a sphere or ellipsoid onto a plane\nDemographics – Science that deals with populations and their structures, statistically and theoreticallyPages displaying short descriptions of redirect targets\nSpatial analysis – Formal techniques which study entities using their topological, geometric, or geographic properties\nSurveying – Science of determining the positions of points and the distances and angles between them\n\n\n=== Types of geographic features ===\nGeographic feature – component of a planet that can be referred to as a location, place, site, area, or region, and therefore may show up on a map. A geographic feature may be natural or artificial.\n\n\n==== Location and place ====\nLocation –\nAbsolute location – Point or an area on Earth's surface or elsewherePages displaying short descriptions of redirect targets\nLatitude – Geographic coordinate specifying north–south position\nPrime meridian – Line of longitude, at which longitude is defined to be 0°\nLongitude – Geographic coordinate that specifies the east-west position of a point on the Earth's surface\nEquator – Imaginary line halfway between Earth's North and South poles\nTropic of Cancer – Line of northernmost latitude at which the Sun can be directly overhead\nTropic of Capricorn – Line of southernmost latitude at which the sun can be directly overhead\nArctic Circle – Boundary of the Arctic\nAntarctic Circle – Boundary of the Antarctic\nNorth Pole – Northern point where the Earth's axis of rotation intersects its surface\nSouth Pole – Southernmost point on Earth\nAltitude – Height in relation to a specified reference point\nElevation – Height of a geographic location above a fixed reference point\nPlace\nAspects of a place or region\nClimate – Statistics of weather conditions in a given region over long periods\nPopulation – All the organisms of a given species that live in a specified region\nDemographics – Science that deals with populations and their structures, statistically and theoreticallyPages displaying short descriptions of redirect targets\nPopulation density – Measurement of population per unit area or unit volume\nHuman overpopulation – Proposed condition wherein human numbers exceed the carrying capacity of the environment\nWorld population – Total number of living humans on Earth\nSense of place – Term used in behavioral sciences and urban planning\nTerrain – Vertical and horizontal dimension and shape of land surface\nTopography – Study of the forms of land surfaces\nTourist attraction – Place of interest where tourists visit\nLists of places – Lists of places on earth sorted by category\n\n\n==== Natural geographic features ====\nNatural geographic feature – an ecosystem or natural landform.\n\n\n===== Ecosystems =====\nEcosystem – community of living organisms in conjunction with the nonliving components of their environment (things like air, water and mineral soil), interacting as a system. These biotic and abiotic components are regarded as linked together through nutrient cycles and energy flows. \n\nBiodiversity hotspot – Biogeographic region with significant levels of biodiversity that is threatened with destruction\nRealm – broadest biogeographic division of the Earth's land surface, based on distributional patterns of terrestrial organisms.\nEcoprovince – biogeographic unit smaller than a realm that contains one or more ecoregions.\nEcoregion – Ecologically and geographically defined area that is smaller than a bioregion\nEcodistrict – Environmental planning\nEcosection\nEcosite\nEcotope – Smallest ecologically distinct landscape features in a landscape mapping and classification system\nEcoelement\nBiome – Community of organisms associated with an environment (ecosystem)\nBioregion – Ecology terminology\nBiotope – Habitat for communities made up of populations of multiple species\nBioelement\n\n\n===== Natural landforms =====\n\nNatural landform – terrain or body of water. Landforms are topographical elements, and are defined by their surface form and location in the landscape. Landforms are categorized by traits such as elevation, slope, orientation, stratification, rock exposure, and soil type. Some landforms are artificial, such as certain islands, but most landforms are natural.\n\n\n==== Natural terrain feature types ====\nContinent – Large geographical region identified by convention\nIsland – Piece of subcontinental land completely surrounded by water\nMainland – Continental part of any polity or the main island within an island nation\nMountain – Large natural elevation of the Earth's surface\nMountain range – Geographic area containing several geologically related mountains\nSubcontinent – A large, relatively self-contained landmass forming a subdivision of a continent\n\n\n==== Natural body of water types ====\nNatural bodies of water – Any significant accumulation of water, generally on a planet's surface\nBodies of seawater – Water from a sea or an ocean\nChannel – Type of landform in which part of a body of water is confined to a relatively narrow but long region\nFirth – Scottish word used for various coastal inlets and straits\nHarbor – Sheltered body of water where ships may shelter\nInlet – Indentation of a shoreline\nBay – Recessed, coastal body of water connected to an ocean or lake\nBight – Shallowly concave bend or curve in a coastline, river, or other geographical feature\nGulf – Large inlet from the ocean into the landmass\nCove – Small sheltered bay or coastal inlet\nCreek (tidal) – Inlet or estuary that is affected by ebb and flow of ocean tidesPages displaying short descriptions of redirect targets\nEstuary – Partially enclosed coastal body of brackish water\nFjord – Long, narrow inlet with steep sides or cliffs, created by glacial activity\nKettle – Depression or hole in an outwash plain formed by retreating glaciers or draining floodwaters\nKill – Creek, tidal inlet, river, strait, or arm of the sea\nLagoon – Shallow body of water separated from a larger one by a narrow landform\nBarachois – Coastal lagoon partially or totally separated from the ocean by a sand or shingle bar\nLoch – Scottish Gaelic word for a lake or sea inlet\nArm of the sea –\nMere – Shallow lake, pond, or wetland\nOcean – Body of salt water covering the majority of Earth\nPhytotelma – Small water-filled cavity in a terrestrial plant\nSalt marsh – Coastal ecosystem between land and open saltwater that is regularly flooded\nSea – Large body of salt water\nTypes of sea:\nMediterranean sea – Mostly enclosed sea with limited exchange with outer oceansPages displaying short descriptions of redirect targets\nSound – A long, relatively wide body of water, connecting two larger bodies of water\nSea components or extensions:\nSea loch – Scottish Gaelic and Irish word for a sea inlet\nSea lough – Anglicised version of Scottish Gaelic and Irish word for a sea inlet\nStrait – Naturally formed, narrow, typically navigable waterway that connects two larger bodies of water\nBodies of fresh water\nBayou – Body of water in flat, low-lying areas\nLake – Large body of relatively still water\nLists of lakes – List of lists of lakes\nOxbow lake – U-shaped lake or pool\nSubglacial lake – Lake under a glacier\nTarn – Mountain lake or pool in a glacial cirque\nPool – Deep and slow-moving stretch of a watercourse\nPond – Relatively small body of standing water\nBillabong – Australian term for a seasonal oxbow lake\nTide pool – Rocky pool on a seashore, separated from the sea at low tide, filled with seawater\nVernal pool – Seasonal pools of water that provide habitat\nPuddle – Small accumulation of liquid, usually water, on a surface\nRiver – Natural flowing watercourse\nLists of rivers – A list of rivers, organised geographically\nParts of a river:\nRapids – River section with increased velocity and turbulence\nSource – Starting point of a riverPages displaying short descriptions of redirect targets\nWaterfall – A point in a river or stream where water flows over a vertical drop\nList of waterfalls – List of notable waterfalls of the world\nRoadstead – Open anchorage affording some protection, but less than a harbor\nSpring – A point at which water emenges from an aquifer to the surface\nBoil -\nStream – Body of surface water flowing down a channel\nBeck – Body of surface water flowing down a channel\nBrook – Body of surface water flowing down a channel\nBurn – Term of Scottish origin for a small river\nCreek – Body of surface water flowing down a channel\nArroyo (creek) – Dry watercourse with flow after rainPages displaying short descriptions of redirect targets\nWash – Dry watercourse with flow after rainPages displaying short descriptions of redirect targets\nDraw – Dry watercourse with flow after rainPages displaying short descriptions of redirect targets\nRun – Body of surface water flowing down a channel\nWetland – Land area that is permanently, or seasonally saturated with water\nFreshwater marsh – Low-lying and seasonally waterlogged land\nSlough (wetland) – A forested wetland\nMangrove swamp – Shrub growing in brackish water\n\n\n==== Artificial geographic features ====\nArtificial geographic feature – a thing that was made by humans that may be indicated on a map. It may be physical and exist in the real world (like a bridge or city), or it may be abstract and exist only on maps (such as the Equator, which has a defined location, but cannot be seen where it lies).\n\nSettlement – Community of any size, in which people live\nHamlet (place) – Small human settlement in a rural area – rural settlement which is too small to be considered a village. Historically, when a hamlet became large enough to justify building a church, it was then classified as a village. One example of a hamlet is a small cluster of houses surrounding a mill.\nVillage – Human settlement smaller than a town – clustered human settlement or community, larger than a hamlet with the population ranging from a few hundred to a few thousand (sometimes tens of thousands).\nTown – Type of human settlement – human settlement larger than a village but smaller than a city. The size a settlement must be in order to be called a \"town\" varies considerably in different parts of the world, so that, for example, many American \"small towns\" seem to British people to be no more than villages, while many British \"small towns\" would qualify as cities in the United States.\nUrban hierarchy – Rank of cities based on their population – ranks the structure of towns within an area.\n1st-order towns – bare minimum of essential services, such as bread and milk.\n2nd-order towns\n3rd-order towns\n4th-order towns\nCity – Large permanent human settlement – relatively large and permanent settlement. In many regions, a city is distinguished from a town by attainment of designation according to law, for instance being required to obtain articles of incorporation or a royal charter.\nFinancial centre – Locations which are centres of financial activity\nPrimate city – Disproportionately largest city of a country or region – the leading city in its country or region, disproportionately larger than any others in the urban hierarchy.\nMetropolis – Large city or conurbation – very large city or urban area which is a significant economic, political and cultural center for a country or region, and an important hub for regional or international connections and communications.\nMetropolitan area – Administrative unit of a dense urban core and its satellite cities – region consisting of a densely populated urban core and its less-populated surrounding territories, sharing industry, infrastructure, and housing.\nGlobal city – City important to the world economy – city that is deemed to be an important node in the global economic system. Globalization is largely created, facilitated and enacted in strategic geographic locales (including global cities) according to a hierarchy of importance to the operation of the global system of finance and trade.\nMegalopolis – Grouping of neighbouring metropolisesPages displaying short descriptions of redirect targets – chain of roughly adjacent metropolitan areas. An example is the huge metropolitan area along the eastern seaboard of the U.S. extending from Boston, Massachusetts through New York City; Philadelphia, Pennsylvania; Baltimore, Maryland and ending in Washington, D.C..\nEperopolis – Hypothetical planet-spanning cityPages displaying short descriptions of redirect targets – theoretical \"continent city\". The world does not have one yet. Will Europe become the first one?\nEcumenopolis – Hypothetical planet-spanning city – theoretical \"world city\". Will the world ever become so urbanized as to be called this?\nEngineered construct – built feature of the landscape such as a highway, bridge, airport, railroad, building, dam, or reservoir. See also construction engineering and infrastructure.\nArtificial landforms\nArtificial dwelling hill – Raised ground to provide a refuge from flooding\nArtificial island – Island constructed by people\nArtificial reef – Human-made underwater structure that functions as a reef\nAirport – Facility with a runway for aircraft – place where airplanes can take off and land, including one or more runways and one or more passenger terminals.\nAqueduct – Structure constructed to convey waterPages displaying short descriptions of redirect targets – artificial channel that is constructed to convey water from one location to another.\nBreakwater – Coastal defense structure – construction designed to break the force of the sea to provide calm water for boats or ships, or to prevent erosion of a coastal feature.\nBridge – Structure built to span physical obstacles – structure built to span a valley, road, body of water, or other physical obstacle such as a canyon, for the purpose of providing passage over the obstacle.\nBuilding – Structure, typically with a roof and walls, standing more or less permanently in one place – closed structure with walls and a roof.\nCanal – Artificial channel for water – artificial waterway, often connecting one body of water with another.\nCauseway – Route raised up on an embankment\nDam – Barrier that stops or restricts the flow of surface or underground streams – structure placed across a flowing body of water to stop the flow, usually to use the water for irrigation or to generate electricity.\nDike – Ridge or wall to hold back waterPages displaying short descriptions of redirect targets – barrier of stone or earth used to hold back water and prevent flooding.\nLevee – Ridge or wall to hold back water – artificial slope or wall to regulate water levels, usually earthen and often parallel to the course of a river or the coast.\nFarm – Area of land for farming, or, for aquaculture, lake, river or sea, including various structures – place where agricultural activities take place, especially the growing of crops or the raising of livestock.\nManmade harbor – Sheltered body of water where ships may shelter – harbor that has deliberately constructed breakwaters, sea walls, or jettys, or which was constructed by dredging.\nIndustrial region – Geographical region with a high proportion of industrial use\nMarina – Dock with moorings and facilities for yachts and small boats\nOrchard – Intentionally planted trees or shrubs that are maintained for food production\nParking lot – Cleared area for parking vehicles\nPier – Raised structure in a body of water\nPipeline – Pumping fluids or gas through pipesPages displaying short descriptions of redirect targets\nPort – Maritime facility where ships may dock to load and discharge passengers and cargo\nRailway – Structure comprising rails on a foundation intended to carry trains\nRanch – Large area of land for raising livestock\nReservoir – Bulk storage space for water\nRoad – Land route for travel by vehicles\nHighway – Public road or other public way on land\nRace track – Facility built for racing of animals, vehicles, or athletes\nStreet – Public thoroughfare in a built environment\nSubsidence crater – Hole or depression left on the surface over the site of an underground explosion\nSki resort – Resort developed for skiing, snowboarding, and other winter sports\nTrain station – Railway facility for loading or unloading trains\nTree farm – Tree farmingPages displaying short descriptions of redirect targets\nTunnel – Underground passage made for traffic\nViaduct – A multiple span bridge crossing an extended lower area\nWharf – Structure on the shore of a harbor or on the bank of a river or canal where ships dockAbstract geographic feature – does not exist physically in the real world, yet has a location by definition and may be displayed on maps.\nGeographical zone – Major regions of Earth's surface demarcated by latitude\nHardiness zone – Region defined by minimum temperature relevant to the plant survival\nTime zone – Area that observes a uniform standard time\nPolitical division – A territorial entity for administration purposes\nNation – Community based on common ethnic, cultural or political identity\nAdministrative division – Territorial entity for administration purposes\nSpecial Economic Zone – A geographical region in which business and trade laws are different from the rest of the country\nAdministrative division – Territorial entity for administration purposes – a designated territory created within a country for administrative or identification purposes. Examples of the types of administrative divisions:\nBailiwick – The area of jurisdiction of a bailiff\nCanton – Type of administrative division of a country\nCommune – An urban administrative division having corporate status\nCounty – Geographical and administrative region in some countries\nDepartment – Administrative or political division in some countriesPages displaying short descriptions of redirect targets\nDistrict – Administrative division in some countries, managed by a local government\nDuchy – Territory ruled by, or representing the title of, a duke or duchess\nEmirate – Territory ruled by an emir\nFederal state – Type of political entity\nParish – Ecclesiastical subdivision of a diocese\nPrefecture – Administrative jurisdiction or subdivision in any of various countries\nProvince – Major administrative subdivision within a country or sovereign state\nRegion – Two or three-dimensionally defined  space, mainly in terrestrial and astrophysics sciences\nRural district – Former type of local government area in England, Wales, and Ireland\nSettlement – Community of any size, in which people live\nMunicipality – Local government area\nCity – Large permanent human settlement\nBorough – Administrative division in some English-speaking countries\nTownship – Designation for types of settlement as administrative territorial entities\nVillage – Human settlement smaller than a town\nShire – Traditional term for a division of land, found in some English-speaking countries\nState – Territorial and constitutional community forming part of a federal unionPages displaying short descriptions of redirect targets\nSubdistrict – low level administrative division of a countryPages displaying wikidata descriptions as a fallback\nSubprefecture – Administrative division of a country that is below prefecture\nVoivodeship – Administrative division in several countries of central and eastern Europe\nWilayat – Administrative division approximating a state or province\nCartographical feature – theoretical construct used specifically on maps that doesn't have any physical form apart from its location.\nLatitude line – Geographic coordinate specifying north–south position\nEquator – Imaginary line halfway between Earth's North and South poles\nLongitude line – Geographic coordinate that specifies the east-west position of a point on the Earth's surface\nPrime Meridian – A line of longitude, at which longitude is defined to be 0°\nGeographical pole – Points on a rotating astronomical body where the axis of rotation intersects the surface\nNorth pole – Northern point where the Earth's axis of rotation intersects its surface\nSouth pole – Southern point where the Earth's axis of rotation intersects its surface\n\n\n==== Geographic features that include the natural and artificial ====\nWaterway – Any navigable body of water\nList of waterways – List of navigable rivers, canals, estuaries, lakes, and firths\n\n\n== Geography awards ==\n\nSome awards and competitions in the field of geography:\n\nGeography Cup – 2006 online geography competition\nFounder's Medal – List of geography award winnersPages displaying short descriptions of redirect targetsPatron's Medal – Award presented by the Royal Geographical SocietyPages displaying short descriptions of redirect targetsHubbard Medal – Medal awarded by the National Geographic Society\nNational Geographic World Championship – Biennial, two-day-long international geography competition\nVictoria Medal – Award presented by the Royal Geographical Society for conspicuous merit in research in geography\n\n\n== Geographical organizations ==\nSee: List of geographical societiesEuropean Geography Association\nEUROGEO-European Association of Geographers\nGamma Theta Upsilon\nInternational Geographical Union\n\n\n== Geographical publications ==\n\n\n=== Geographical magazines ===\nAl Arab\nArizona Highways\nAsian Geographic\nAtlas (magazine)\nAustralian Geographic\nCanadian Geographic\nChinese National Geography\nLe Congo illustré\nGEO (magazine)\nGéographica\nGeographical\nIcelandic Geographic\nLe Mouvement Géographique\nNational Geographic\nNational Geographic Adventure\nNational Geographic Kids\nNational Geographic Traveler\nNew Zealand Geographic\nPodróże\nRevista Geográfica Española\nRhythms Monthly\nVokrug sveta\nWalkabout\nThe Wide World Magazine\n\n\n== Persons influential in geography ==\n\nA geographer is a scientist who studies Earth's physical environment and human habitat. Geographers are historically known for making maps, the subdiscipline of geography known as cartography. They study the physical details of the environment and also its effect on human and wildlife ecologies, weather and climate patterns, economics, and culture. Geographers focus on the spatial relationships between these elements.\n\n\n=== Influential physical geographers ===\nEratosthenes (276 – 194 BC) – who made the first known reliable estimation of the Earth's size. He is considered the father of geodesy.\nPtolemy (c. 90 – c. 168) – who compiled Greek and Roman knowledge to produce the book Geographia.\nAbū Rayhān Bīrūnī (973 – 1048 AD) – considered the father of geodesy.\nIbn Sina (Avicenna, 980–1037) – whose observations in Kitab Al-Shifa contributed to later formulations of the law of superposition and concept of uniformitarianism.\nMuhammad al-Idrisi (Dreses, 1100 – c.1165) – who drew the Tabula Rogeriana, the most accurate world map in pre-modern times.\nPiri Reis (1465 – c.1554) – whose Piri Reis map is the oldest surviving world map to include the Americas and possibly Antarctica\nGerardus Mercator (1512–1594) – an innovative cartographer and originator of the Mercator projection.\nBernhardus Varenius (1622–1650) – Wrote his important work \"General Geography\" (1650) – first overview of the geography, the foundation of modern geography.\nMikhail Lomonosov (1711–1765) – father of Russian geography and founded the study of glaciology.\nAlexander Von Humboldt (1769–1859) – considered the father of modern geography. Published Kosmos and founded the study of biogeography.\nArnold Henry Guyot (1807–1884) – who noted the structure of glaciers and advanced the understanding of glacial motion, especially in fast ice flow.\nLouis Agassiz (1807–1873) – the author of a glacial theory which disputed the notion of a steady-cooling Earth.\nAlfred Russel Wallace (1823–1913) – founder of modern biogeography and the Wallace line.\nVasily Dokuchaev (1846–1903) – patriarch of Russian geography and founder of pedology.\nWladimir Peter Köppen (1846–1940) – developer of most important climate classification and founder of Paleoclimatology.\nWilliam Morris Davis (1850–1934) – father of American geography, founder of Geomorphology and developer of the geographical cycle theory.\nWalther Penck (1888–1923) – proponent of the cycle of erosion and the simultaneous occurrence of uplift and denudation.\nSir Ernest Shackleton (1874–1922) – Antarctic explorer during the Heroic Age of Antarctic Exploration.\nRobert E. Horton (1875–1945) – founder of modern hydrology and concepts such as infiltration capacity and overland flow.\nJ Harlen Bretz (1882–1981) – pioneer of research into the shaping of landscapes by catastrophic floods, most notably the Bretz (Missoula) floods.\nWilli Dansgaard (born 1922) – palaeoclimatologist and quaternary scientist, instrumental in the use of oxygen-isotope dating and co-identifier of Dansgaard-Oeschger events.\nHans Oeschger (1927–1998) – palaeoclimatologist and pioneer in ice core research, co-identifier of Dansgaard-Orschger events.\nRichard Chorley (1927–2002) – a key contributor to the quantitative revolution and the use of systems theory in geography.\nSir Nicholas Shackleton (1937–2006) – who demonstrated that oscillations in climate over the past few million years could be correlated with variations in the orbital and positional relationship between the Earth and the Sun.\nStefan Rahmstorf (born 1960) – professor of abrupt climate changes and author on theories of thermohaline dynamics.\n\n\n=== Influential human geographers ===\nCarl Ritter (1779–1859) – considered to be one of the founding fathers of modern geography and first chair in geography at the Humboldt University of Berlin, also noted for his use of organic analogy in his works.\nFriedrich Ratzel (1844–1904) – environmental determinist, invented the term Lebensraum\nPaul Vidal de la Blache (1845–1918) – founder of the French School of geopolitics and possibilism.\nSir Halford John Mackinder (1861–1947) – author of The Geographical Pivot of History, co-founder of the London School of Economics, along with the Geographical Association.\nCarl O. Sauer (1889–1975) – critic of environmental determinism and proponent of cultural ecology.\nWalter Christaller (1893–1969) – economic geographer and developer of the central place theory.\nRichard Hartshorne (1899–1992) – scholar of the history and philosophy of geography.\nTorsten Hägerstrand (1916–2004) – critic of the quantitative revolution and regional science, noted figure in critical geography.\nMilton Santos (1926–2001) winner of the Vautrin Lud prize in 1994, one of the most important geographers in South America.\nWaldo R. Tobler (born 1930) – developer of the First law of geography.\nYi-Fu Tuan (born 1930) A Chinese-American geographer.\nDavid Harvey (born 1935) – world's most cited academic geographer and winner of the Lauréat Prix International de Géographie Vautrin Lud, also noted for his work in critical geography and critique of global capitalism.\nEvelyn Stokes (1936–2005). Professor of geography at the University of Waikato in New Zealand. Known for recognizing inequality with marginalized groups including women and Māori using geography.\nAllen J. Scott (born 1938) – winner of Vautrin Lud Prize in 2003 and the Anders Retzius Gold medal 2009; author of numerous books and papers on economic and urban geography, known for his work on regional development, new industrial spaces, agglomeration theory, global city-regions and the cultural economy.\nEdward Soja (born 1941) – noted for his work on regional development, planning and governance, along with coining the terms synekism and postmetropolis.\nDoreen Massey (born 1944) – key scholar in the space and places of globalization and its pluralities, winner of the Vautrin Lud Prize.\nMichael Watts, Class of 1963 Professor of Geography and Development Studies, University of California, Berkeley\nNigel Thrift (born 1949) – developer of non-representational theory.\nDerek Gregory (born 1951) – famous for writing on the Israeli, U.S. and UK actions in the Middle East after 9/11, influenced by Edward Said and has contributed work on imagined geographies.\nCindi Katz (born 1954) – who writes on social reproduction and the production of space. Writing on children's geographies, place and nature, everyday life and security.\nGillian Rose (born 1962) – most famous for her critique: Feminism & Geography: The Limits of Geographical Knowledge (1993) – which was one of the first moves towards a development of feminist geography.\n\n\n== Geography educational frameworks ==\nEducational frameworks upon which primary and secondary school curricula for geography are based upon include:\n\nFive themes of geography – Educational tool for teaching geographyLocation – Point or an area on Earth's surface or elsewherePages displaying short descriptions of redirect targets – a position or point that something occupies on the Earth's surface.\nPlace – Point or an area on Earth's surface or elsewherePages displaying short descriptions of redirect targets\nHuman-environment interaction – Study of interactions between societies and their natural environments\nmovement –\nRegion – Two or three-dimensionally defined  space, mainly in terrestrial and astrophysics sciences\nThe six \"essential elements\" identified by the Geography Education Standards Project, under which the National Geography Standards they developed are organized:The World in spatial terms\nPlaces and regions\nPhysical systems\nHuman systems\nEnvironment and society\nThe uses of geography\nThe three content areas of geography from the 2010 National Assessment of Educational Progress (U.S.):\nSpace and place\nEnvironment and society\nSpatial dynamics and connections\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\n\nPidwirny, Michael. (2014). Glossary of Terms for Physical Geography. Planet Earth Publishing, Kelowna, Canada. ISBN 9780987702906. Available on Google Play.\nPidwirny, Michael. (2014). Understanding Physical Geography. Planet Earth Publishing, Kelowna, Canada. ISBN 9780987702944. Available on Google Play.",
    "The Universal Decimal Classification (UDC) is a bibliographic and library classification representing the systematic arrangement of all branches of human knowledge organized as a coherent system in which knowledge fields are related and inter-linked. The UDC is an analytico-synthetic and faceted classification system featuring detailed vocabulary and syntax that enables powerful content indexing and information retrieval in large collections. Since 1991, the UDC has been owned and managed by the UDC Consortium, a non-profit international association of publishers with headquarters in The Hague, Netherlands.\nUnlike other library classification schemes that started their life as national systems, the UDC was conceived and maintained as an international scheme. Its translation into other languages started at the beginning of the 20th century and has since been published in various printed editions in over 40 languages. UDC Summary, an abridged Web version of the scheme, is available in over 50 languages. The classification has been modified and extended over the years to cope with increasing output in all areas of human knowledge, and is still under continuous review to take account of new developments.Albeit originally designed as an indexing and retrieval system, due to its logical structure and scalability, UDC has become one of the most widely used knowledge organization systems in libraries, where it is used for either shelf arrangement, content indexing or both. UDC codes can describe any type of document or object to any desired level of detail. These can include textual documents and other media such as films, video and sound recordings, illustrations, maps as well as realia such as museum objects.\n\n\n== History ==\nThe UDC was developed by the Belgian bibliographers Paul Otlet and Henri La Fontaine at the end of the 19th century. In 1895, they created the Universal Bibliographic Repertory (Répertoire Bibliographique Universel) (RBU) which was intended to become a comprehensive classified index to all published information. The idea that the RBU should take the form of a card catalogue came from the young American zoologist Herbert Haviland Field, who was at the time himself setting up a bibliographical agency in Zurich, the Concilium Bibliographicum. A means of arranging the entries would be needed, and Otlet, having heard of the Dewey Decimal Classification, wrote to Melvil Dewey and obtained permission to translate it into French. The idea outgrew the plan of mere translation, and a number of radical innovations were made, adapting the purely enumerative classification (in which all the subjects envisaged are already listed and coded) into one which allows for synthesis (that is, the construction of compound numbers to denote interrelated subjects that could never be exhaustively foreseen); various possible relations between subjects were identified, and symbols assigned to represent them. In its first edition in French \"Manuel du Répertoire bibliographique universel\" (1905), the UDC already included many features that were revolutionary in the context of knowledge classifications: tables of generally applicable (aspect-free) concepts—called common auxiliary tables; a series of special auxiliary tables with specific but re-usable attributes in a particular field of knowledge; an expressive notational system with connecting symbols and syntax rules to enable coordination of subjects and the creation of a documentation language proper.\nThe Universal Bibliographic Repertory itself has developed into a remarkable information resource. In the period before World War I it grew to more than eleven million records. The catalogue and its content organized by UDC can still be seen in Mundaneum in Mons, Belgium (in 2013 recommended for inclusion in the UNESCO Memory of the World Register).\n\n\n== The application of UDC ==\nUDC is used in around 150,000 libraries in 130 countries and in many bibliographical services which require detailed content indexing. In a number of countries it is the main classification system for information exchange and is used in all types of libraries: public, school, academic and special libraries.UDC is also used in national bibliographies of around 30 countries. Examples of large databases indexed by UDC include:\nNEBIS (The Network of Libraries and Information Centers in Switzerland) — 2.6 million records\nCOBIB.SI (Slovenian National Union Catalogue) — 3.5 million records\nHungarian National Union Catalogue (MOKKA) — 2.9 million records\nVINITI RAS database (All-Russian Scientific and Technical Information Institute of Russian Academy of Science) with 28 million records\nMeteorological & Geoastrophysical Abstracts (MGA) with 600 journal titles\nPORBASE (Portuguese National Bibliography) with 1.5 million recordsUDC has traditionally been used for the indexing of scientific articles which was an important source of information of scientific output in the period predating electronic publishing. Collections of research articles in many countries covering decades of scientific output contain UDC codes.  Examples of journal articles indexed by UDC:\n\nUDC code 663.12:57.06 in the article \"Yeast Systematics: from Phenotype to Genotype\" in the  journal Food Technology and Biotechnology (ISSN 1330-9862)\nUDC code 37.037:796.56, provided in the article \"The game method as means of interface of technical-tactical and psychological preparation in sports orienteering\" in the Russian journal \"Pedagogico-psychological and medico-biological problems of the physical culture and sport\"  (ISSN 2070-4798).\nUDC code 621.715:621.924:539.3 in the article Residual Stress in Shot-Peened Sheets of AIMg4.5Mn Alloy - in the journal Materials and technology (ISSN 1580-2949).\nThe design of UDC lends itself to machine readability, and the system has been used both with early automatic mechanical sorting devices, and modern library OPACs. Since 1993, a standard version of UDC has been maintained and distributed in a database format: UDC Master Reference File (UDC MRF) which is updated and released regularly. The 2011 version of the MRF (released in 2012) contains over 70,000 classes. In the past full printed editions used to have around 220,000 subdivisions.\n\n\n== UDC structure ==\n\n\n=== Notation ===\nA notation is a code commonly used in classification schemes to represent a class, i.e. a subject and its position in the hierarchy, to enable mechanical sorting and filing of subjects. UDC uses Arabic numerals arranged decimally. Every number is thought of as a decimal fraction with the initial decimal point omitted, which determines the filing order. An advantage of decimal notational systems is that they are infinitely extensible, and when new subdivisions are introduced, they need not disturb the existing allocation of numbers. For ease of reading, a UDC notation is usually punctuated after every third digit:\n\nIn UDC the notation has two features that make the scheme easier to browse and work with: \n\nhierarchically expressive – the longer the notation, the more specific the class: removing the final digit automatically produces a broader class code.\nsyntactically expressive – when UDC codes are combined, the sequence of digits is interrupted by a precise type of punctuation sign which indicates that the expression is a combination of classes rather than a simple class e.g. the colon in 34:32 indicates that there are two distinct notational elements: 34 Law. Jurisprudence and 32 Politics; the closing and opening parentheses and double quotes in the following code 913(574.22)\"19\"(084.3) indicate four separate notational elements: 913 Regional geography, (574.22) North Kazakhstan (Soltüstik Qazaqstan); \"19\" 20th century and (084.3) Maps (document form)\n\n\n=== Basic features and syntax ===\nUDC is an analytico-synthetic and faceted classification. It allows an unlimited combination of attributes of a subject and relationships between subjects to be expressed. UDC codes from different tables can be combined to present various aspects of document content and form, e.g. 94(410)\"19\"(075) History (main subject) of United Kingdom (place) in 20th century (time), a textbook (document form). Or: 37:2 Relationship between Education and Religion. Complex UDC expressions can be accurately parsed into constituent elements.\nUDC is also a disciplinary classification covering the entire universe of knowledge. This type of classification can also be described as aspect or perspective, which means that concepts are subsumed and placed under the field in which they are studied. Thus, the same concept can appear in different fields of knowledge. This particular feature is usually implemented in UDC by re-using the same concept in various combinations with the main subject, e.g. a code for language in common auxiliaries of language is used to derive numbers for ethnic grouping, individual languages in linguistics and individual literatures. Or, a code from the auxiliaries of place, e.g. (410) United Kingdom, uniquely representing the concept of United Kingdom can be used to express 911(410) Regional geography of United Kingdom and 94(410) History of United Kingdom.\n\n\n=== Organization of classes ===\nConcepts are organized in two kinds of tables in UDC:\nCommon auxiliary tables (including certain auxiliary signs). These tables contain facets of concepts representing general recurrent characteristics, applicable over a range of subjects throughout the main tables, including notions such as place, language of the text and physical form of the document, which may occur in almost any subject. UDC numbers from these tables, called common auxiliaries are simply added at the end of the number for the subject taken from the main tables. There are over 15,000 common auxiliaries in UDC.\nThe main tables or main schedules containing the various disciplines and branches of knowledge are arranged in 9 main classes, numbered from 0 to 9 (with class 4 being vacant). At the beginning of each class there are also series of special auxiliaries, which express aspects that are recurrent within this specific class. Main tables in UDC contain more than 60,000 subdivisions.\n\n\n==== Main classes ====\n0 Science and Knowledge. Organization. Computer Science. Information Science. Documentation. Librarianship. Institutions. Publications\n1 Philosophy. Psychology\n2 Religion. Theology\n3 Social Sciences\n4 vacant\n5 Mathematics. Natural Sciences\n6 Applied Sciences. Medicine, Technology\n7 The Arts. Entertainment. Sport\n8 Linguistics. Literature\n9 Geography. HistoryThe vacant class 4 is the result of a planned schedule expansion. This class was freed by moving linguistics into class 8 in the 1960s to make space for future developments in the rapidly expanding fields of knowledge; primarily natural sciences and technology.\n\n\n==== Common auxiliary tables ====\nCommon auxiliaries are aspect-free concepts that can be used in combination with any other UDC code from the main classes or with other common auxiliaries. They have unique notational representations that makes them stand out in complex expressions. Common auxiliary numbers always begin with a certain symbol known as a facet indicator, e.g. = (equal sign) always introduces concepts representing the language of a document; (0...) numbers enclosed in parentheses starting with zero always represent a concept designating document form. Thus (075) Textbook and =111 English can be combined to express, e.g.(075)=111 Textbooks in English, and when combined with numbers from the main UDC tables they can be used as follows: 2(075)=111 Religion textbooks in English, 51(075)=111 Mathematics textbooks in English etc.\n\n=...\tCommon auxiliaries of language. Table 1c\n(0...)\tCommon auxiliaries of form. Table 1d\n(1/9)\tCommon auxiliaries of place. Table 1e\n(=...)\tCommon auxiliaries of human ancestry, ethnic grouping and nationality. Table 1f\n\"...\"\tCommon auxiliaries of time. Table 1g helps to make minute division of time e.g.:  \"1993-1996\"\n-0...\tCommon auxiliaries of general characteristics: Properties, Materials, Relations/Processes and Persons. Table 1k.\n-02\tCommon auxiliaries of properties. Table 1k\n-03\tCommon auxiliaries of materials. Table 1k\n-04\tCommon auxiliaries of relations, processes and operations. Table 1k\n-05\tCommon auxiliaries of persons and personal characteristics. Table 1k this table is repeated\n\n\n==== Connecting signs ====\nIn order to preserve the precise meaning and enable accurate parsing of complex UDC expressions, a number of connecting symbols are made available to relate and extend UDC numbers. These are:\n\n\n== UDC outline ==\nUDC classes in this outline are taken from the Multilingual Universal Decimal Classification Summary (UDCC Publication No. 088) released by the UDC Consortium under the Creative Commons Attribution Share Alike 3.0 license (first release 2009, subsequent update 2012).\n\n\n=== Main tables ===\n\n\n==== 0 Science and knowledge. Organization. Computer science. Information. Documentation. Librarianship. Institution. Publications ====\n 00          Prolegomena. Fundamentals of knowledge and culture. Propaedeutics\n 001         Science and knowledge in general. Organization of intellectual work\n 002         Documentation. Books. Writings. Authorship\n 003         Writing systems and scripts\n 004         Computer science and technology. Computing\n 004.2       Computer architecture\n 004.3       Computer hardware\n 004.4       Software\n 004.5       Human-computer interaction\n 004.6       Data\n 004.7       Computer communication\n 004.8       Artificial intelligence\n 004.9       Application-oriented computer-based techniques\n 005         Management\n 005.1       Management Theory\n 005.2       Management agents. Mechanisms. Measures\n 005.3       Management activities\n 005.5       Management operations. Direction\n 005.6       Quality management. Total quality management (TQM)\n 005.7       Organizational management (OM)\n 005.9       Fields of management\n 005.92      Records management\n 005.93      Plant management. Physical resources management\n 005.94      Knowledge management\n 005.95/.96  Personnel management. Human Resources management\n 006         Standardization of products, operations, weights, measures and time\n 007         Activity and organizing. Information. Communication and control theory generally (cybernetics)\n 008         Civilization. Culture. Progress   \n 01          Bibliography and bibliographies. Catalogues\n 02          Librarianship\n 030         General reference works (as subject)\n 050         Serial publications, periodicals (as subject)\n 06          Organizations of a general nature\n 069         Museums\n 070         Newspapers (as subject). The Press. Outline of journalism\n 08          Polygraphies. Collective works (as subject)\n 09          Manuscripts. Rare and remarkable works (as subject)\n\n\n==== 1 Philosophy. Psychology ====\n 101        Nature and role of philosophy\n 11         Metaphysics\n 111        General metaphysics. Ontology\n 122/129    Special Metaphysics\n 13         Philosophy of mind and spirit. Metaphysics of spiritual life\n 14         Philosophical systems and points of view\n 141        Kinds  of viewpoint. Including:  Monism. Dualism. Pluralism. Ontological Materialism. Metaphysical Idealism. Platonism, etc.\n 159.9      Psychology\n 159.91     Psychophysiology (physiological psychology). Mental physiology\n 159.92     Mental development and capacity. Comparative psychology\n 159.93     Sensation. Sensory perception\n 159.94     Executive functions\n 159.95     Higher mental processes\n 159.96     Special mental states and processes\n 159.97     Abnormal psychology\n 159.98     Applied psychology (psychotechnology) in general\n 16         Logic. Epistemology. Theory of knowledge. Methodology of logic\n 17         Moral philosophy. Ethics. Practical philosophy\n\n\n==== 2 Religion. Theology ====\nThe UDC tables for religion are fully faceted. Indicated in italics below, are special auxiliary numbers that can be used to express attributes (facets) of any specific faith. Any special number can be combined with any religion e.g.  -5 Worship can be used to express e.g. 26-5 Worship in Judaism, 27-5 Worship in Christianity, 24-5 Worship in Buddhism. The complete special auxiliary tables contain around 2000 subdivisions of various attributes that can be attached to express various aspects of individual faiths to a great level of specificity allowing equal level of detail for every religion.\n\n 2-1/-9\tSpecial auxiliary subdivision for religion\n 2-1\tTheory and philosophy of religion. Nature of religion. Phenomenon of religion\n 2-2\tEvidences of religion\n 2-3\tPersons in religion\n 2-4\tReligious activities. Religious practice\n 2-5\tWorship broadly. Cult. Rites and ceremonies\n 2-6\tProcesses in religion\n 2-7\tReligious organization and administration\n 2-8\tReligions characterised by various properties\n 2-9\tHistory of the faith, religion, denomination or church\n 21/29\tReligious systems. Religions and faiths\n 21\tPrehistoric and primitive religions\n 22\tReligions originating in the Far East\n 23\tReligions originating in Indian sub-continent. Hindu religion in the broad sense\n 24\tBuddhism\n 25\tReligions of antiquity. Minor cults and religions\n 26\tJudaism\n 27\tChristianity\n 28\tIslam\n 29\tModern spiritual movements\n\n\n==== 3 Social sciences ====\n 303   Methods of the social sciences\n 304\tSocial questions. Social practice. Cultural practice. Way of life (Lebensweise)\n 305\tGender studies\n 308\tSociography. Descriptive studies of society (both qualitative and quantitative)\n 311\tStatistics as a science. Statistical theory\n 314/316 Society\n 314\tDemography. Population studies\n 316\tSociology\n 32\tPolitics\n 33\tEconomics. Economic science\n 34\tLaw. Jurisprudence\n 35\tPublic administration. Government. Military affairs\n 36\tSafeguarding the mental and material necessities of life\n 37\tEducation\n 39\tCultural anthropology. Ethnography. Customs. Manners. Traditions. Way of life\n\n\n==== 4 Currently Vacant ====\nThis section is currently vacant.\n\n\n==== 5 Mathematics. Natural sciences ====\n 502/504  Environmental science. Conservation of natural resources. Threats to the environment and protection against them\n 502\tThe environment and its protection\n 504\tThreats to the environment\n 51\tMathematics\n 510\tFundamental and general considerations of mathematics\n 511\tNumber theory\n 512\tAlgebra\n 514\tGeometry\n 517\tAnalysis\n 519.1\tCombinatorial analysis. Graph theory\n 519.2\tProbability. Mathematical statistics\n 519.6\tComputational mathematics. Numerical analysis\n 519.7\tMathematical cybernetics\n 519.8\tOperational research (OR): mathematical theories and methods\n 52\tAstronomy. Astrophysics. Space research. Geodesy\n 53\tPhysics\n 531/534  Mechanics\n 535\tOptics\n 536\tHeat. Thermodynamics. Statistical physics\n 537\tElectricity. Magnetism. Electromagnetism\n 538.9\tCondensed matter physics. Solid state physics\n 539\tPhysical nature of matter\n 54\tChemistry. Crystallography. Mineralogy\n 542\tPractical laboratory chemistry. Preparative and experimental chemistry\n 543\tAnalytical chemistry\n 544\tPhysical chemistry\n 546\tInorganic chemistry\n 547\tOrganic chemistry\n 548/549 Mineralogical sciences. Crystallography. Mineralogy\n 55\tEarth sciences. Geological sciences\n 56\tPaleontology\n 57\tBiological sciences in general\n 58\tBotany\n 59\tZoology\n\n\n==== 6 Applied sciences. Medicine. Technology ====\nClass 6 occupies the largest proportion of UDC schedules. It contains over 44,000 subdivisions. Each specific field of technology or industry usually contains more than one special auxiliary table with concepts needed to express operations, processes, materials and products. As a result, UDC codes are often created through the combination of various attributes. Equally, some parts of this class enumerate concepts to a great level of detail e.g.  621.882.212 Hexagon screws with additional shapes. Including: Flank screws. Collar screws. Cap screws\n\n 60    Biotechnology\n 61\tMedical sciences\n 611/612 Human biology\n 613\tHygiene generally. Personal health and hygiene\n 614\tPublic health and hygiene. Accident prevention\n 615\tPharmacology. Therapeutics. Toxicology\n 616\tPathology. Clinical medicine\n 617\tSurgery. Orthopaedics. Ophthalmology\n 618\tGynaecology. Obstetrics\n 62\tEngineering. Technology in general\n 620\tMaterials testing. Commercial materials. Power stations. Economics of energy\n 621\tMechanical engineering in general. Nuclear technology. Electrical engineering. Machinery\n 622\tMining\n 623\tMilitary engineering\n 624\tCivil and structural engineering in general\n 625\tCivil engineering of land transport. Railway engineering. Highway engineering\n 626/627  Hydraulic engineering and construction. Water (aquatic) structures\n 629\tTransport vehicle engineering\n 63\tAgriculture and related sciences and techniques. Forestry. Farming. Wildlife exploitation\n 630\tForestry\n 631/635\tFarm management. Agronomy. Horticulture\n 633/635\tHorticulture in general. Specific crops\n 636\tAnimal husbandry and breeding in general. Livestock rearing. Breeding of domestic animals\n 64\tHome economics. Domestic science. Housekeeping\n 65\tCommunication and transport industries. Accountancy. Business management. Public relations\n 654\tTelecommunication and telecontrol (organization, services)\n 655\tGraphic industries. Printing. Publishing. Book trade\n 656\tTransport and postal services. Traffic organization and control\n 657\tAccountancy\n 658\tBusiness management, administration. Commercial organization\n 659\tPublicity. Information work. Public relations\n 66\tChemical technology. Chemical and related industries\n 67\tVarious industries, trades and crafts\n 68\tIndustries, crafts and trades for finished or assembled articles\n 69\tBuilding (construction) trade. Building materials. Building practice and procedure\n\n\n==== 7 The arts. Recreation. Entertainment. Sport ====\n 7.01/.09\tSpecial auxiliary subdivision for the arts\n 7.01\tTheory and philosophy of art. Principles of design, proportion, optical effect\n 7.02\tArt technique. Craftsmanship\n 7.03\tArtistic periods and phases. Schools, styles, influences\n 7.04\tSubjects for artistic representation. Iconography. Iconology\n 7.05\tApplications of art (in industry, trade, the home, everyday life)\n 7.06\tVarious questions concerning art\n 7.07\tOccupations and activities associated with the arts and entertainment\n 7.08\tCharacteristic features, forms, combinations etc. (in art, entertainment and sport)\n 7.091\tPerformance, presentation (in original medium)\n 71\tPhysical planning. Regional, town and country planning. Landscapes, parks, gardens\n 72\tArchitecture\n 73\tPlastic arts\n 74\tDrawing. Design. Applied arts and crafts\n 745/749\tIndustrial and domestic arts and crafts. Applied arts\n 75\tPainting\n 76\tGraphic art, printmaking. Graphics\n 77\tPhotography and similar processes\n 78\tMusic\n 79\tRecreation. Entertainment. Games. Sport\n 791\tCinema. Films (motion pictures)\n 792\tTheatre. Stagecraft. Dramatic performances\n 793\tSocial entertainments and recreations. Art of movement. Dance\n 794\tBoard and table games (of thought, skill and chance)\n 796\tSport. Games. Physical exercises\n 797\tWater sports. Aerial sports\n 798\tRiding and driving. Horse and other animal sports\n 799\tSport fishing. Sport hunting. Shooting and target sports\n\n\n==== 8 Language. Linguistics. Literature ====\nTables for class 8 are fully faceted and details are expressed through combination with common auxiliaries of language (Table 1c) and a series of special auxiliary tables to indicate other facets or attributes in Linguistics or Literature. As a result, this class allows for great specificity in indexing although the schedules themselves occupy very little space in UDC. The subdivisions of e.g. 811 Languages or 821 Literature are derived from common auxiliaries of language =1/=9 (Table 1c) by substituting a point for the equals sign, e.g. 811.111 English language (as a subject of a linguistic study) and 821.111 English literature derives from =111 English language. Common auxiliaries of place and time are also frequently used in this class to express place and time facets of Linguistics or Literature, e.g. 821.111(71)\"18\" English literature of Canada in 19th century\n\n 80\tGeneral questions relating to both linguistics and literature. Philology\n 801\tProsody. Auxiliary sciences and sources of philology\n 808\tRhetoric. The effective use of language  \n 81\tLinguistics and languages\n 81`1/`4\tSpecial auxiliary subdivision for subject fields and facets of linguistics and languages\n 81`1\tGeneral linguistics\n 81`2\tTheory of signs. Theory of translation. Standardization. Usage. Geographical linguistics\n 81`3\tMathematical and applied linguistics. Phonetics. Graphemics. Grammar. Semantics. Stylistics\n 81`4\tText linguistics, Discourse analysis. Typological linguistics\n 81`42\tText linguistics. Discourse analysis\n 81`44\tTypological linguistics\n 811\tLanguages\n       Derived from the common auxiliaries of language =1/=9 (Table 1c) by replacing the equal sign = with prefix 811. e.g. =111 English becomes 811.111 Linguistics of English language\n 811.1/.9\tAll languages natural or artificial\n 811.1/.8\tIndividual natural languages\n 811.1/.2\tIndo-European languages\n 811.21/.22\tIndo-Iranian languages\n 811.3\tDead languages of unknown affiliation. Caucasian languages\n 811.4\tAfro-Asiatic, Nilo-Saharan, Congo-Kordofanian, Khoisan languages\n 811.5\tUral-Altaic, Palaeo-Siberian, Eskimo-Aleut, Dravidian and Sino-Tibetan languages. Japanese. Korean. Ainu\n 811.6\tAustro-Asiatic languages. Austronesian languages\n 811.7\tIndo-Pacific (non-Austronesian) languages. Australian languages\n 811.8\tAmerican indigenous languages\n 811.9\tArtificial languages\n 82\tLiterature\n 82-1/-9\tSpecial auxiliary subdivision for literary forms, genres\n 82-1\tPoetry. Poems. Verse\n 82-2\tDrama. Plays\n 82-3\tFiction. Prose narrative\n 82-31\tNovels. Full-length stories\n 82-32\tShort stories. Novellas\n 82-4\tEssays\n 82-5\tOratory. Speeches\n 82-6\tLetters. Art of letter-writing. Correspondence. Genuine letters\n 82-7\tProse satire. Humour, epigram, parody\n 82-8\tMiscellanea. Polygraphies. Selections\n 82-9\tVarious other literary forms\n 82-92\tPeriodical literature. Writings in serials, journals, reviews\n 82-94\tHistory as literary genre. Historical writing. Historiography. Chronicles. Annals. Memoirs\n 82.02/.09\tSpecial auxiliary subdivision for theory, study and technique of literature\n 82.02\tLiterary schools, trends and movements\n 82.09\tLiterary criticism. Literary studies\n 82.091\tComparative literary studies. Comparative literature\n 821\tLiteratures of individual languages and language families\n       Derived from the common auxiliaries of language =1/=9 (Table 1c) by replacing the equal sign = with prefix 821. e.g. =111 English becomes 821.111 English literature\n\n\n==== 9 Geography. Biography. History ====\nTables for Geography and History in UDC are fully faceted and place, time and ethnic grouping facets are expressed through combination with common auxiliaries of place (Table 1d), ethnic grouping (Table 1f) and time (Table 1g)\n\n 902/908\tArchaeology. Prehistory. Cultural remains. Area studies\n 902\tArchaeology\n 903\tPrehistory. Prehistoric remains, artifacts, antiquities\n 904\tCultural remains of historical times\n 908\tArea studies. Study of a locality\n 91\tGeography. Exploration of the Earth and of individual countries. Travel. Regional geography\n 910\tGeneral questions. Geography as a science. Exploration. Travel\n 911\tGeneral geography. Science of geographical factors (systematic geography). Theoretical geography\n 911.2\tPhysical geography\n 911.3\tHuman geography (cultural geography). Geography of cultural factors\n 911.5/.9\tTheoretical geography\n 912\tNonliterary, nontextual representations of a region\n 913\tRegional geography\n 92\tBiographical studies. Genealogy. Heraldry. Flags\n 929\tBiographical studies\n 929.5\tGenealogy\n 929.6\tHeraldry\n 929.7\tNobility. Titles. Peerage\n 929.9\tFlags. Standards. Banners\n 93/94\tHistory\n 930\tScience of history. Historiography\n 930.1\tHistory as a science\n 930.2\tMethodology of history. Ancillary historical sciences\n 930.25\tArchivistics. Archives (including public and other records)\n 930.85\tHistory of civilization. Cultural history\n 94\tGeneral\n\n\n=== Common auxiliary tables ===\n\n\n==== Common auxiliaries of language. Table 1c ====\n =1/=9\tLanguages (natural and artificial)\n =1/=8\tNatural languages\n =1/=2\tIndo-European languages\n =1\tIndo-European languages of Europe\n =11\tGermanic languages\n =12\tItalic languages\n =13\tRomance languages\n =14\tGreek (Hellenic)\n =15\tCeltic languages\n =16\tSlavic languages\n =17\tBaltic languages\n =18\tAlbanian\n =19\tArmenian\n =2\tIndo-Iranian, Nuristani (Kafiri) and dead Indo-European languages\n =21/=22\tIndo-Iranian languages\n =21\tIndic languages\n =22\tIranian languages\n =29\tDead Indo-European languages (not listed elsewhere)\n =3\tDead languages of unknown affiliation. Caucasian languages\n =34\tDead languages of unknown affiliation, spoken in the Mediterranean and Near East (except Semitic)\n =35\tCaucasian languages\n =4\tAfro-Asiatic, Nilo-Saharan, Congo-Kordofanian, Khoisan languages\n =41\tAfro-Asiatic (Hamito-Semitic) languages\n =42\tNilo-Saharan languages\n =43\tCongo-Kordofanian (Niger-Kordofanian) languages\n =45\tKhoisan languages\n =5\tUral-Altaic, Palaeo-Siberian, Eskimo-Aleut, Dravidian and Sino-Tibetan languages. Japanese. Korean. Ainu\n =51\tUral-Altaic languages\n =521\tJapanese\n =531\tKorean\n =541\tAinu\n =55\tPalaeo-Siberian languages\n =56\tEskimo-Aleut languages\n =58\tSino-Tibetan languages\n =6\tAustro-Asiatic languages. Austronesian languages\n =61\tAustro-Asiatic languages\n =62\tAustronesian languages\n =7\tIndo-Pacific (non-Austronesian) languages. Australian languages\n =71\tIndo-Pacific (non-Austronesian) languages\n =72\tAustralian languages\n =8\tAmerican indigenous languages\n =81\tIndigenous languages of Canada, USA and Northern-Central Mexico\n =82\tIndigenous languages of western North American Coast, Mexico and Yucatán\n =84/=88\tCentral and South American indigenous languages\n =84\tGe-Pano-Carib languages. Macro-Chibchan languages\n =85\tAndean languages. Equatorial languages\n =86\tChaco languages. Patagonian and Fuegian languages\n =88\tIsolated, unclassified Central and South American indigenous languages\n =9\tArtificial languages\n =92\tArtificial languages for use among human beings. International auxiliary languages (interlanguages)\n =93\tArtificial languages used to instruct machines. Programming languages. Computer languages\n\n\n==== (0...) Common auxiliaries of form. Table 1d ====\n (0.02/.08)\tSpecial auxiliary subdivision for document form\n (0.02)\tDocuments according to physical, external form\n (0.03)\tDocuments according to method of production\n (0.032)\tHandwritten documents (autograph, holograph copies). Manuscripts. Pictorial documents (drawings, paintings)\n (0.034)\tMachine-readable documents\n (0.04)\tDocuments according to stage of production\n (0.05)\tDocuments for particular kinds of user\n (0.06)\tDocuments according to level of presentation and availability\n (0.07)\tSupplementary matter issued with a document\n (0.08)\tSeparately issued supplements or parts of documents\n (01)\tBibliographies\n (02)\tBooks in general\n (03)\tReference works\n (04)\tNon-serial separates. Separata\n (041)\tPamphlets. Brochures\n (042)\tAddresses. Lectures. Speeches\n (043)\tTheses. Dissertations\n (044)\tPersonal documents. Correspondence. Letters. Circulars\n (045)\tArticles in serials, collections etc. Contributions\n (046)\tNewspaper articles\n (047)\tReports. Notices. Bulletins\n (048)\tBibliographic descriptions. Abstracts. Summaries. Surveys\n (049)\tOther non-serial separates\n (05)\tSerial publications. Periodicals\n (06)\tDocuments relating to societies, associations, organizations\n (07)\tDocuments for instruction, teaching, study, training\n (08)\tCollected and polygraphic works. Forms. Lists. Illustrations. Business publications\n (09)\tPresentation in historical form. Legal and historical sources\n (091)\tPresentation in chronological, historical form. Historical presentation in the strict sense\n (092)\tBiographical presentation\n (093)\tHistorical sources\n (094)\tLegal sources. Legal documents\n\n\n==== (1/9) Common auxiliaries of place. Table 1e ====\n (1)\tPlace and space in general. Localization. Orientation\n (1-0/-9)\tSpecial auxiliary subdivision for boundaries and spatial forms of various kinds\n (1-0)\tZones\n (1-1)\tOrientation. Points of the compass. Relative position\n (1-11)\tEast. Eastern\n (1-13)\tSouth. Southern\n (1-14)\tSouth-west. South-western\n (1-15)\tWest. Western\n (1-17)\tNorth. Northern\n (1-19)\tRelative location, direction and orientation\n (1-2)\tLowest administrative units. Localities\n (1-5)\tDependent or semi-dependent territories\n (1-6)\tStates or groupings of states from various points of view\n (1-7)\tPlaces and areas according to privacy, publicness and other special features\n (1-8)\tLocation. Source. Transit. Destination\n (1-9)\tRegionalization according to specialized points of view\n (100)\tUniversal as to place. International. All countries in general\n (2)\tPhysiographic designation\n (20)\tEcosphere\n (21)\tSurface of the Earth in general. Land areas in particular. Natural zones and regions\n (23)\tAbove sea level. Surface relief. Above ground generally. Mountains\n (24)\tBelow sea level. Underground. Subterranean\n (25)\tNatural flat ground (at, above or below sea level). The ground in its natural condition, cultivated or inhabited\n (26)\tOceans, seas and interconnections\n (28)\tInland waters\n (29)\tThe world according to physiographic features\n (3)\tPlaces of the ancient and mediaeval world\n (31)\tAncient China and Japan\n (32)\tAncient Egypt\n (33)\tAncient Roman Province of Judaea. The Holy Land. Region of the Israelites\n (34)\tAncient India\n (35)\tMedo-Persia\n (36)\tRegions of the so-called barbarians\n (37)\tItalia. Ancient Rome and Italy\n (38)\tAncient Greece\n (39)   Catalan regions\n (399)\tOther regions. Ancient geographical divisions other than those of classical antiquity\n (4/9)\tCountries and places of the modern world\n (4)\tEurope\n (5)\tAsia\n (6)\tAfrica\n (7)\tNorth and Central America\n (8)\tSouth America\n (9)\tStates and regions of the South Pacific and Australia. Arctic. Antarctic\n\n\n==== (=...) Common auxiliaries of human ancestry, ethnic grouping and nationality. Table 1f ====\nThey are derived mainly from the common auxiliaries of language =... (Table 1c) and so may also usefully distinguish linguistic-cultural groups, e.g. =111 English is used to represent (=111) English speaking peoples\n\n (=01)\tHuman ancestry groups\n (=011)\tEuropean Continental Ancestry Group\n (=012)\tAsian Continental Ancestry Group\n (=013)\tAfrican Continental Ancestry Group\n (=014)\tOceanic Ancestry Group\n (=017)\tAmerican Native Continental Ancestry Group\n (=1/=8)\tLinguistic-cultural groups, ethnic groups, peoples [derived from Table 1c]\n (=1:1/9)\tPeoples associated with particular places\n               e.g. (=111:71) Anglophone population of Canada\n\n\n==== \"...\" Common auxiliaries of time. Table 1g ====\n \"0/2\"\tDates and ranges of time (CE or AD) in conventional Christian (Gregorian) reckoning\n \"0\"\tFirst millennium CE\n \"1\"\tSecond millennium CE\n \"2\"\tThird millennium CE\n \"3/7\"\tTime divisions other than dates in Christian (Gregorian) reckoning\n \"3\"\tConventional time divisions and subdivisions: numbered, named, etc.\n \"4\"\tDuration. Time-span. Period. Term. Ages and age-groups\n \"5\"\tPeriodicity. Frequency. Recurrence at specified intervals.\n \"6\"\tGeological, archaeological and cultural time divisions\n \"61/62\" Geological time division\n \"63\"\tArchaeological, prehistoric, protohistoric periods and ages\n \"67/69\" Time reckonings: universal, secular, non-Christian religious\n \"67\"\tUniversal time reckoning. Before Present\n \"68\"\tSecular time reckonings other than universal and the Christian (Gregorian) calendar\n \"69\"\tDates and time units in non-Christian (non-Gregorian) religious time reckonings\n \"7\"\tPhenomena in time. Phenomenology of time\n\n\n==== -0 Common auxiliaries of general characteristics. Table 1k ====\n -02\tCommon auxiliaries of properties\n -021\tProperties of existence\n -022\tProperties of magnitude, degree, quantity, number, temporal values, dimension, size\n -023\tProperties of shape\n -024\tProperties of structure. Properties of position\n -025\tProperties of arrangement\n -026\tProperties of action and movement\n -027\tOperational properties\n -028\tProperties of style and presentation\n -029\tProperties derived from other main classes\n -03 Common auxiliaries of materials\n -032\tNaturally occurring mineral materials\n -033\tManufactured mineral-based materials\n -034\tMetals\n -035\tMaterials of mainly organic origin\n -036\tMacromolecular materials. Rubbers and plastics\n -037\tTextiles. Fibres. Yarns. Fabrics. Cloth\n -039\tOther materials\n -04 Common auxiliaries of relations, processes and operations\n -042\tPhase relations\n -043\tGeneral processes\n -043.8/.9 Processes of existence\n -045\tProcesses related to position, arrangement, movement, physical properties, states of matter\n -047/-049\tGeneral operations and activities\n -05 Common auxiliaries of persons and personal characteristics\n -051\tPersons as agents, doers, practitioners (studying, making, serving etc.)\n -052\tPersons as targets, clients, users (studied, served etc.)\n -053\tPersons according to age or age-groups\n -054\tPersons according to ethnic characteristics, nationality, citizenship etc.\n -055\tPersons according to gender and kinship\n -056\tPersons according to constitution, health, disposition, hereditary or other traits\n -057\tPersons according to occupation, work, livelihood, education\n -058\tPersons according to social class, civil status\n\n\n== See also ==\nSpecial classifications based on or used in combination with UDC\n\nUniversal Decimal Classification for Use in Polar Libraries - Scott Polar Research Institute, Cambridge\nBBC LonClass\nGlobal Forest Decimal ClassificationOther faceted classifications:\n\nBliss bibliographic classification\nColon classification\nBroad System of OrderingOther library classifications\n\nDewey Decimal Classification\nLibrary of Congress Classification\nRussian Library-Bibliographical Classification (BBK)\nChinese Library Classification\nHarvard-Yenching Classification\n\n\n== References ==\n\n\n== External links ==\n\nUniversal Decimal Classification Consortium\nAbout Universal Decimal Classification\nMultilingual UDC Summary\nUDC Linked Data"
]