[
    "Pyramid is an American game show franchise that has aired several versions domestically and internationally. The show was developed by Bob Stewart. The original series, The $10,000 Pyramid, debuted on March 26, 1973, and spawned seven subsequent Pyramid series. Most later series featured a full title format matching the original series, with the title reflecting an increasing top prize. The game features two contestants, each paired with a celebrity. In the game, the contestants and celebrities attempt to identify words or phrases through clues given by their teammates. The title refers to the show's pyramid-shaped gameboard, featuring six categories arranged in a triangular fashion. The various Pyramid series have won a total of nine Daytime Emmys for Outstanding Game Show, second only to Jeopardy!, which has won 13.\nDick Clark is the host most commonly associated with the show, having hosted the network daytime version from 1973 to 1980 (which moved from CBS to ABC in 1974, and increased its namesake top prize from $10,000 to $20,000 in 1976) and The (New) $25,000 Pyramid from 1982 to 1988 on CBS. Clark also hosted two weeknight syndicated versions, The $50,000 Pyramid in 1981 and The $100,000 Pyramid from 1985 to 1988 (concurrent with the daytime show).\nBill Cullen hosted the first weekly nighttime version of The $25,000 Pyramid from 1974 to 1979. John Davidson hosted The $100,000 Pyramid in 1991, and Donny Osmond hosted a version simply titled Pyramid from 2002 to 2004; both aired five episodes per week. Game Show Network's The Pyramid, hosted by Mike Richards, who was an executive at format owner Sony Pictures Television, aired a single forty-episode season in 2012.\nThe current incarnation of The $100,000 Pyramid debuted June 26, 2016, on ABC with Michael Strahan as host. It has aired on Sunday nights during the summer months since, completing its fourth season in September 2019. On November 20, 2019, the series was renewed for a fifth season, which premiered on May 26, 2021. On January 6, 2022, The $100,000 Pyramid renewed for a sixth season and the show moved from New York to Los Angeles. The sixth season premiered on July 10, 2022.\n\n\n== Gameplay ==\nThe Pyramid's gameboards, both in the main game and in the Winners' Circle bonus round, feature six categories arranged in a triangle (referred to as a pyramid), with three on the bottom row, two on the middle row, and one on the top. Most variations of gameplay feature two teams, each composed of a contestant and a celebrity.\n\n\n=== Main game ===\nAt the beginning of the game, the teams are shown six categories. Once the category is chosen, its exact meaning is given unless there is a bonus element that requires obscuring the category. One member of the team is then given a list of words or phrases that fit the category (displayed on a monitor before that team member), and must describe each to his or her partner within a time limit. The team member giving the clues may use any form of verbal clue that does not contain the answer (for example, using \"high up\" for \"height\"); non-verbal clues such as pantomime are also accepted. One point is scored for each item correctly guessed, and words for which illegal clues are given are eliminated from play. Each category usually consists of seven words or phrases. If a team is stuck on a word or phrase, they may pass and may go back to that word or phrase, provided if there is any time left.\nEach team alternates playing a category until all six have been played, although it is possible for a category to go unplayed if one team is so far behind that they cannot score enough points to catch up. In addition, the teams alternate in each round of play as to whether the celebrity or the contestant gives the clues.\nOn most versions of the show, in the event of a tie, the host offered the team who created the tie a choice between two letters of the alphabet. That team then played a round consisting entirely of words beginning with that letter, after which the opposing team played words beginning with the other letter. The tie was then broken by whichever team achieved more points or, if both teams successfully played all seven words in a shorter amount of time. For most versions airing in the 1980s, an additional $5,000 cash bonus was awarded for breaking a tie if both teams achieved perfect 21 scores prior to the tiebreaker (early on, a new car was awarded instead). On the 2010s version, a tie is broken by whichever team achieved their total points in a faster amount of time.\nAfter a round of gameplay, the higher-scoring team proceeds to the show's bonus round, known as the Winner's Circle. Once the Winner's Circle is completed, a new round of gameplay begins with the celebrities switching teams and a new selection of categories. After this round is completed, the winning team proceeds to the second and final Winner's Circle.\n\n\n==== Bonuses ====\nThe game board has often featured a number of spaces which award bonus prizes to the contestants.\nThroughout the 1970s, a random category during the main game doubled as the \"Big 7\", meaning that the contestant originally received a prize if all seven words were guessed correctly. Depending on the version of the show, the \"Big 7\" bonus could be a cash amount or a new car.\nBeginning in 1982, a random category in the second round was designated as the \"Mystery 7\", in which the host did not reveal the topic of the category until after the fact, and correctly guessing all seven words awarded a prize. This bonus feature was reinstated for the second round of the 2010s version.\nIn 1983, The $25,000 Pyramid introduced a new bonus space called the \"7-11\", which was randomly concealed behind a category in the first round of gameplay. If this was revealed, the team could elect to play for $1,100 cash if all seven words were guessed correctly, or $50 per correct word; the latter option was dropped in early 1985. During the $100,000 tournament weeks in the 1980s and 1990s, no bonus prizes were on the maingame board, but the perfect score tiebreaker award was still intact.\nThe 1991 version offered additional bonuses. \"Gamble for a Grand\"/\"Gamble for a Trip\" offered the choice to reduce the round's time limit from 30 to 25 seconds to win $1,000 cash or a trip, respectively, and \"Double Trouble\" offered the team 45 seconds to guess seven two-word responses for a $500 bonus.\nThe Donny Osmond-hosted version had only one bonus: \"Super Six\", which was featured in both games each day, and awarded an additional prize for guessing all six words in 20 seconds.\nOn the Game Show Network version, there were no bonuses, but correctly guessing all seven words in a category awarded a $500 bonus and added $5,000 to the Winner's Circle bank.\n\n\n=== Winner's Circle ===\nThe winning team from the main game plays the Winner's Circle, in which one player must describe six categories of increasing difficulty to their partner within sixty seconds by giving a short and concise list of items relating to each category in play. (For instance, the category \"things that clean\" could be described with clues such as \"soap\", \"a vacuum\", or \"a maid's broom\".) Which ever team member receives the clues is given credit so long as the key word of the category (\"clean\") is given. Although it has not been stated in official rules, since Strahan has been hosting, the contestant gives the clues, and the celebrity must guess the category. In prior versions of the show, celebrities usually gave the clues. In the earliest episodes of the show, the host would ask the contestant whether or not they wanted to give or receive clues in the winner's circle.The clue-giver may pass on a category and return to it after playing through all six if time remains on the clock. Giving an illegal clue removes the category from play. These include using gestures; using any part of a key word in the category, a definition, or a direct synonym of it; using a prepositional phrase; or listing an item that does not fit the category. If all six categories are guessed before time runs out, the contestant partner wins the top prize; if not, he/she wins money for each category that is correctly guessed.\n\n\n== History ==\n\n\n=== Broadcast history ===\n\n\n==== The $10,000 Pyramid ====\n\nOn March 26, 1973 (1973-03-26), The $10,000 Pyramid (equivalent to $66,000 in 2022), with host Dick Clark, made its network debut and was a ratings hit, sustaining its ratings even when episodes were delayed or preempted by the Watergate hearings. A year later, the ratings temporarily declined (against the original version of Jeopardy! on NBC) and CBS canceled it. The show was quickly picked up by ABC and began airing on that network on May 6, 1974. As per CBS custom at the time with celebrity game shows, three weeks of episodes for CBS were taped in Hollywood at Television City, Studio 31. The remainder of the CBS episodes originated in New York City at the Ed Sullivan Theater, moving to ABC's Elysee Theatre after Pyramid switched networks.\n\n\n==== The $20,000 Pyramid ====\nBeginning on January 19, 1976, the series doubled its top prize and was retitled The $20,000 Pyramid (equivalent to $103,000 in 2022). From October 1 to November 9, 1979, the series briefly became Junior Partner Pyramid, which scrapped the usual celebrity-contestant pairings in favor of children playing the game with a parent or other adult relative. Its last episode aired June 27, 1980, with Family Feud subsequently moving up a half-hour to take over the 12:00 noon (EST) slot formerly occupied by The $20,000 Pyramid.\n\n\n==== The (New) $25,000 Pyramid ====\n\nOn September 20, 1982, the series returned to the CBS daytime lineup as The (New) $25,000 Pyramid (equivalent to $76,000 in 2022), again with Clark as host, but now taped in Los Angeles full-time at CBS Television City's Studio 33 (currently used for The Price Is Right, now known as the \"Bob Barker Studio\") and remained there for the entire run up until December 31, 1987. Blackout began airing in the series' 10:00 a.m. timeslot the following Monday, but that show was canceled after 13 weeks of episodes. On April 4, 1988, The $25,000 Pyramid returned to the CBS daytime schedule, but only for 13 more weeks. The show's final episode aired on July 1. The following Monday, the show was replaced by Family Feud, hosted by Ray Combs.\n\n\n==== The $100,000 Pyramid ====\nConcurrent with the network show's run, several nighttime versions of the show were sold to local stations through syndication: the original $25,000 Pyramid and The $50,000 Pyramid were taped in the Elysee Theatre in New York, and both editions of The $100,000 Pyramid were taped at Television City. The Dick Clark-hosted episodes were taped in Studio 33 concurrently with the daytime $25,000 Pyramid, and the 1991 edition hosted by John Davidson was taped in Studio 31. Pyramid, hosted by Donny Osmond, ran from September 16, 2002 to September 10, 2004 and was taped at Sony Pictures Studios in Culver City, California. The Pyramid was taped at the CBS Studio Center.The current version of The $100,000 Pyramid, hosted by Michael Strahan, has been taped at the ABC Television Center in New York.In August 2020, production for season five of The $100,000 Pyramid resumed in New York City with new safety protocols and guidelines introduced; these guidelines include measures such as crew and contestants having their temperatures tested, Personal Protective Equipment (PPE) on-site, and social distancing measures. This season does not feature an in-studio audience due to the COVID-19 pandemic in the United States.\n\n\n=== Later developments ===\nIn late 1996, Sony Pictures Television (then-Columbia TriStar Television) produced a pilot for a new version of Pyramid, with Mark Walberg as host, which featured a format radically different from the earlier versions, including an increase of the number of celebrities to six, each of which would be assigned to a different main game subject. It did not sell, but Sony tried again the following year, this time with Chuck Woolery at the helm and a format closer to the original, although the six-celebrity motif from the previous pilot remained. This version also failed to sell, but two years later, after the success of its series Rock & Roll Jeopardy! on VH1, Sony attempted to give Pyramid similar treatment with a 1999 pilot called Pyramid Rocks. Hosted by Bil Dwyer, the format likewise attempted to incorporate music into the game, but proved no more successful than the previous two attempts at reviving the series.Following CBS's cancellation of Guiding Light in April 2009, Pyramid was one of three potential series considered as a replacement for the veteran soap opera. (Let's Make a Deal and The Dating Game as The New Dating Game or The Newlywed Game as The New Newlywed Game were the other two, with a pilot shot for the former series.) During the tapings that took place in June of that year at the Kaufman Astoria Studios in New York, the top prize was raised to a potential $1,000,000 with a tournament format similar to the $100,000 format.  Dean Cain and Tim Vincent were tapped as hosts of the pilots, with $50,000 announcer Alan Kalter returning, and Sony Pictures game show legend Ken Jennings served as a panelist in the pilots.CBS passed on Pyramid and opted to pick up Let's Make a Deal, hosted by Wayne Brady, as Guiding Light's replacement. Several months later, in December 2009, CBS announced the cancellation of another long-running soap opera, As the World Turns. Pyramid was once again among the series being considered as a potential replacement. CBS ordered a third pilot on April 9, 2010. Andy Richter was identified as a potential host.On May 18, 2011, TBS announced development of a possible new version of Pyramid, again to be hosted by Andy Richter. It was later announced that the show was not picked up.\nAnother pilot, titled The Pyramid, was taped on June 16, 2012. On July 12, 2012, GSN announced The Pyramid had been picked up and would premiere on the network on September 3, with Mike Richards hosting the show. The series ran for 40 episodes before being cancelled later in the year.\nOn January 9, 2016, ABC greenlit a new version of The $100,000 Pyramid, set to air during the summer of 2016. This version also marked the return of the show to New York City, where it had originally been produced in the 1970s. The first season comprised ten hour-long episodes, with Michael Strahan serving as host.  Each episode consists of two full games.  Two introductions and two closings are taped with ability to air either;  as with Celebrity Family Feud and Match Game, each game is its own 30-minute episode, and the introduction and closing aired depends if one game is the first or the second game to air in a single 60-minute block.The series premiered on June 26 of that year, airing as part of ABC's \"Sunday Fun & Games\" lineup at 9:00pm ET/8:00pm CT (along with the Steve Harvey-hosted Celebrity Family Feud and the Alec Baldwin-hosted Match Game). On August 4, 2016, ABC renewed The $100,000 Pyramid for a second season. On June 11, 2017, the show moved to 10/9 central in order to pair it up with the seed-funding reality competition show Steve Harvey's Funderdome along with the third season of Celebrity Family Feud. On August 6, 2017, ABC announced The $100,000 Pyramid was renewed for a third season. On June 10, 2018, the show moved back to its regular 9:00pm ET time slot. This was also paired up with the fourth season of Celebrity Feud hosted by Steve Harvey, along with the third season of To Tell the Truth hosted by Anthony Anderson. In this format, the host opens each show introducing the celebrity guests, each of whom then introduces his or her partner/contestant by first name only.\n\n\n== Conception ==\nTelevision producer Bob Stewart developed The $10,000 Pyramid in 1973. The show's format was adapted from an unsold television pilot Stewart had filmed earlier titled Cash on the Line.\n\n\n== Personnel ==\nBob Clayton was the series' original announcer and performed these duties until his death in 1979. Alan Kalter and Steve O'Brien shared the primary announcer role until The $50,000 Pyramid ended production in 1981. Substitutes included Fred Foy, John Causier, Dick Heatherton, Scott Vincent, and Ed Jordan.\nWhen the series was revived and production moved to California in 1982, Jack Clark became the announcer and held the position until 1985. Johnny Gilbert became the primary announcer for The $25,000 Pyramid while Charlie O'Donnell took the job for The $100,000 Pyramid when it launched that fall. Both Gilbert and O'Donnell substituted for each other on their respective series; other substitutes included Jerry Bishop, Rod Roddy, Bob Hilton, Charlie Tuna, and Dean Goss. In 1991, Gilbert and Goss were both featured announcers and frequent panelist Henry Polic II also announced for several weeks. John Cramer announced the 2002–04 version, and JD Roberto announced The Pyramid (2012). The 2016 ABC primetime version is announced by Brad Abelle.\nMike Gargiulo directed through 1981, with Bruce Burmester replacing him until the end of the 1991 version.The original theme tune was \"Tuning Up\" by Ken Aldin. In 1982, it was replaced by an original, similarly styled composition by Bob Cobert, which was also used in 1991. Barry Coffing and John Blaylock composed the theme and incidental music for the 2002–04 version, while Alan Ett composed a cover of Bob Cobert's 1982–91 theme for The Pyramid. Bleeding Fingers Music composed a separate cover of Cobert's theme for the 2016 version.\n\n\n== International versions ==\nThe British version was called The Pyramid Game and ran intermittently from 1981 to 1990, with Steve Jones as host. Donny Osmond hosted a short-lived incarnation in 2007, which used a similar set and the same music package as the 2002 American version.\nIn 2009, Sony created an Australian version of The Junior Partner Pyramid called simply Pyramid. This version was hosted by Shura Taft until 2012, with Graham Matters taking over the following year.\nA German version titled Die Pyramide aired on ZDF from 1979 to 1994, and was hosted by Dieter Thomas Heck. A new version aired on ZDFneo in 2012, and was co-hosted by Micky Beisenherz and Joachim Llambi.\nVersions in French, both titled Pyramide, were produced at different times in France and in Canada.\n\n\n== Home games ==\nThe first board game of The $10,000 Pyramid was released in 1974 by the Milton Bradley Company, with a total of eight editions produced through 1981. Beginning with the fourth edition, like its TV counterpart, the title and top payoff changed to The $20,000 Pyramid, while the final edition was titled The $50,000 Pyramid. However, due to concerns about players easily memorizing possible Winners' Circle subjects, the format of the board game's Winners' Circle endgame was changed to mirror that of the TV version's main game.Cardinal Games released a new home version of The $25,000 Pyramid in 1986, this time using the actual Winners' Circle rules and format, which was also given to all contestants who appeared on both the daytime and nighttime versions for most of 1987 and select 1988 episodes. This version was reissued in 2000 by Endless Games, which later released a new edition based on the Osmond version in 2003.The $100,000 Pyramid, a video game adaptation, was released in 1987. Developed and published by Box Office Software, it was originally released for Apple II and then ported to DOS and Commodore 64. Years later, Sierra Attractions released a new PC CD-ROM version of The $100,000 Pyramid in 2001, which was followed by a DVD game from MGA Entertainment in 2006.\nA version titled The $1,000,000 Pyramid was released by Ubisoft for the Nintendo Wii in 2011.\n\n\n== References ==\n\n\n=== Sources ===\n\n\n== External links ==\nOfficial website (ABC, 2016)\nProduction website\nOfficial website (GSN, at the Wayback Machine)\nThe $10,000 Pyramid on IMDb\nThe $25,000 Pyramid on IMDb\nThe $100,000 Pyramid (1985) on IMDb\nPyramid (2002) on IMDb\nThe Pyramid on IMDb\nThe $100,000 Pyramid (2016) on IMDb",
    "1000 Blank White Cards is a party game played with cards in which the deck is created as part of the game. Though it has been played by adults in organized groups worldwide, 1000 Blank White Cards is also described as well-suited for children in Hoyle's Rules of Games. Since any game rules are contained on the cards (rather than existing as all-encompassing rules or in a rule book), 1000 Blank White Cards can be considered a sort of nomic. It can be played by any number of players and provides the opportunity for card creation and gameplay outside the scope of a single sitting. Creating new cards during the game, dealing with previous cards' effects, is allowed, and rule modification is encouraged as an integral part of gameplay.\n\n\n== Game ==\nThe game consists of whatever the players define it as by creating and playing things. There are no initial rules, and while there may be conventions among certain groups of players, it is in the spirit of the game to spite and denounce these conventions, as well as to adhere to them religiously.\nFor many typical players, though, the game may be split into three logical parts: the deck creation, the play itself, and the epilogue.\n\n\n=== Deck creation ===\nA deck of cards consists of any number of cards, generally of a uniform size and of rigid enough paper stock that they may be reused. Some may bear artwork, writing or other game-relevant content created during past games, with a reasonable stock of cards that are blank at the start of gameplay. Some time may be taken to create cards before gameplay commences, although card creation may be more dynamic if no advance preparation is made, and it is suggested that the game be simply sprung upon a group of players, who may or may not have any idea what they are being caught up in. If the game has been played before, all past cards can be used in gameplay unless the game specifies otherwise, but perhaps not until the game has allowed them into play.\nA typical group's conventions for deck creation follow:\n\nThough cards are created at all times throughout the game (except the epilogue), it is necessary to start with at least some cards pre-made. Despite the name of the game, a deck of 80 to 150 cards is usual, depending on the desired duration of the game, and of these approximately half will be created before the start of play. If a group doesn't already possess a partial deck they may choose to start with fewer cards and to create most of the deck during play.\nWhether or not the group possesses a deck already (from previous games), they will usually want to add a few more cards, so the first phase of the game involves each player creating six or seven new cards to add to the deck. See structure of a card below.\nWhen the deck is ready, all of the cards (including blanks) are shuffled together and each player is dealt five cards. The remainder of the deck is placed in the centre of the table.\n\n\n=== Play ===\nThe rules of game are determined as the game is played. There exists no fixed order of play or limit to the length or scope of the game. Such parameters may be set within the game but are of course subject to alteration.\nOne sample convention suggests the following:\nPlay proceeds clockwise beginning with the player on the dealer's left. On each player's turn, he/she draws a card from the central deck and then plays a card from his/her hand. Cards can be played to any player (including the person playing the card), or to the table (so that it affects everyone). Cards with lasting effects, such as awarding points or changing the game's rules, are kept on the table to remind players of those effects. Cards with no lasting effects, or cards that have been nullified, are placed in a discard pile.\nBlank cards can be made into playable cards at any time simply by drawing on them (see structure of a card).\nPlay continues until there are no cards left in the central deck and no one can play (if they have no cards that can be played in the current situation). The \"winner\" is the player with the highest score of total points at the end of the game, though in some games points don't actually matter.\n\n\n=== Epilogue ===\nSince the cards created in any game may be used as the beginning of a deck for a future game, many players like to reduce the deck to a collection of their favourites. The epilogue is simply an opportunity for the players to collectively decide which cards to keep and which to discard (or set aside as not-for-play).\nMany players believe that having their own cards favoured during the epilogue is the true \"victory\" of 1000 Blank White Cards, although the game's creator has never discarded or destroyed a card unless that action was specified within the scope of the game. Retaining and replaying those cards which seem at the moment less than perfect can help reduce a certain stagnation and tendency to over-think that can otherwise overtake the game's momentum.\nOne group of players in Boston (not the long-dispersed Harvard cadre) have introduced the idea of the \"Suck Box\":\n\nWe don't like to destroy cards, even if they suck, so we have a notecard box called The Suck Box. If a player feels a card is boring and useless to gameplay, they will nominate it for admission to The Suck Box. All players present then vote (sometimes lobbying for their cases), and the card either goes into The Suck Box or gets to remain in the primary deck. Ironically, when The Suck Box was introduced, one player created a card for the express purpose of adding it to The Suck Box. However, the rest of us felt that it was too amusing a card and had to remain in the deck.\n\n\n== Structure of a card ==\nAt its simplest, a card is just that: a physical card, which may or may not have undergone any modifications. Its role in the game is both as itself and as whatever information it carries, which can be changed, erased or amended.  The cards used vary widely in size, from the original 11⁄2\" x 31⁄2\" Vis-Ed brand flash cards, to half or full index cards, to simply sheets of A7 sized paper. Cards may be created with any marking medium and need not conform to any conventions of size or content unless specified within the scope of the game. Cards have been made of a wide range of substances, and modifying the shape or composition of a card is entirely acceptable: the original Vis-Ed box still contains a card, created by Plan 9 From Bell Labs developer Mycroftiv, to which a tablet of zinc has been affixed with adhesive tape; the card reads \"Eat This!... In a few minutes, the ZINC will be entering your system.\" Many cards have been created which demanded their own modification, destruction or duplication, and many have been created which display nothing but a picture or text bearing no explicit significance whatsoever. Some have been eaten, burned, or cut and folded into other shapes.\nThe game does tend to fall into structural conventions, of which the following is a good example:\n\nA card consists (usually) of a title, a picture and a description of its effect. The title should uniquely identify the card. The picture can be as simple as a stick figure, or as complex as the player likes. The description, or rule, is the part that affects the game. It can award or deny points, cause a player to miss a turn, change the direction of play, or do anything the player can think of. The rules written on cards in play make up the majority of the game's total ruleset.\nIn practice, these conventions can generate rather monotonous decks of one panel cartoons bearing point values, rules or both. As conceived, the game is far broader, as it is not inherently limited in length or scope, is radically self-modifying, and can contain references to, or actual instances of, other games or activities. The game can also encode algorithms (trivially functioning as a Turing machine), store real-world data, and hold or refer to non-card objects.\n\n\n== History ==\nThe game was originally created late in 1995 by Nathan McQuillen of Madison, Wisconsin. He was inspired by seeing a product at a local coffeehouse: a box of 1000 Vis-Ed brand blank white flash cards. He introduced \"The game of 1000 blank white cards\" a few days later into a mixed group including students, improvisational theatre members and club kids. Initial play sessions were frequent and high energy, but a fire consumed the regular venue shortly after the game's introduction. The game physically survived but with the loss of their regular meeting place the majority of the original players fell out of contact with one another, and soon most had moved on to other cities.\nThe game started to spread as a meme through various social networks, mostly collegiate, in the late 1990s. Aaron Mandel, a former Madison resident, brought the game to Harvard University and started an active playgroup which changed the size of the cards to the more standard half-index dimensions (2+1⁄2 by 3+1⁄2 inches (64 mm × 89 mm)). Boston players Dave Packer and Stewart King created the first web content representing the game. Their graduation served to further spread the game to the west coast and onto the web. Subsequently, an article in GAMES Magazine and inclusion in the 2001 revision of Hoyle's Rules of Games established the game as an independent part of gaming culture. Various celebrities have also contributed cards to the game, including musicians Ben Folds and Jonatha Brooke, and cartoonist Bill Plympton.The game's inventor and its original players have frequently expressed amusement at the spread of a game they regarded mostly as a brilliant but highly idiosyncratic bit of conceptual humor which provided them with an excuse to draw goofy cartoons.\n\n\n== See also ==\nCalvinball\nDiscordianism\nDvorak (game)\nFluxx\nMao (game)\nNomic\n\n\n== References ==\n\n\n== External links ==\n\n1000 Blank White Cards at BoardGameGeek",
    "An abstract strategy game is a type of strategy game that has minimal or no narrative theme, an outcome determined only by player choice (with minimal or no randomness), and in which each player has perfect information about the game. For example, Go is a pure abstract strategy game since it fulfills all three criteria; chess and related games are nearly so but feature a recognizable theme of ancient warfare; and Stratego is borderline since it is deterministic, loosely based on 19th-century Napoleonic warfare, and features concealed information.\n\n\n== Definition ==\nCombinatorial games have no randomizers such as dice, no simultaneous movement, nor hidden information.  Some games that do have these elements are sometimes classified as abstract strategy games.  (Games such as Continuo, Octiles, Can't Stop, and Sequence, could be considered abstract strategy games, despite having a luck or bluffing element.) A smaller category of abstract strategy games manages to incorporate hidden information without using any random elements; the best known example is Stratego.\nTraditional abstract strategy games are often treated as a separate game category, hence the term 'abstract games' is often used for competitions that exclude them and can be thought of as referring to modern abstract strategy games. Two examples are the IAGO World Tour (2007–2010) and the Abstract Games World Championship held annually since 2008 as part of the Mind Sports Olympiad.Some abstract strategy games have multiple starting positions of which it is required that one be randomly determined.  For a game to be one of skill, a starting position needs to be chosen by impartial means.  Some games, such as Arimaa and DVONN, have the players build the starting position in a separate initial phase which itself conforms strictly to combinatorial game principles.  Most players, however, would consider that although one is then starting each game from a different position, the game itself contains no luck element. Indeed, Bobby Fischer promoted randomization of the starting position in chess in order to increase player dependence on thinking at the board.\nAs J. Mark Thompson wrote in his article \"Defining the Abstract\", play is sometimes said to resemble a series of puzzles the players pose to each other: There is an intimate relationship between such games and puzzles: every board position presents the player with the puzzle, What is the best move?, which in theory could be solved by logic alone. A good abstract game can therefore be thought of as a \"family\" of potentially interesting logic puzzles, and the play consists of each player posing such a puzzle to the other. Good players are the ones who find the most difficult puzzles to present to their opponents.\nMany abstract strategy games also happen to be \"combinatorial\"; i.e., there is no hidden information, no non-deterministic elements (such as shuffled cards or dice rolls), no simultaneous or hidden movement or setup, and (usually) two players or teams take a finite number of alternating turns.\nMany games which are abstract in nature historically might have developed from thematic games, such as representation of military tactics. In turn, it is common to see thematic version of such games; for example, chess is considered an abstract game, but many thematic versions, such as Star Wars-themed chess, exist.\n\n\n== History ==\nMancala is among the oldest known games to still be widely played today. Chess is believed to have originated in northwest India, in the Gupta Empire (c. 280–550), where its early form in the 6th century was known as chaturaṅga (Sanskrit: चतुरङ्ग), literally four divisions [of the military] – infantry, cavalry, elephants, and chariotry, represented by the pieces that would evolve into the modern pawn, knight, bishop, and rook, respectively. Chaturanga was played on an 8×8 uncheckered board, called ashtāpada. Shogi was the earliest chess variant to allow captured pieces to be returned to the board by the capturing player. This drop rule is speculated to have been invented in the 15th century and possibly connected to the practice of 15th century mercenaries switching loyalties when captured instead of being killed.A board resembling a Draughts board was found in Ur dating from 3000 BC. In the British Museum are specimens of ancient Egyptian checkerboards, found with their pieces in burial chambers, and the game was played by Queen Hatasu. Plato mentioned a game, πεττεία or Petteia, as being of Egyptian origin, and Homer also mentions it. The game was later imported into the Roman Empire under the name ludus latrunculorum.Go was considered one of the four essential arts of the cultured aristocratic Chinese scholars in antiquity. The earliest written reference to the game is generally recognized as the historical annal Zuo Zhuan (c. 4th century BC).Englishmen Lewis Waterman and John W. Mollett both claim to have invented the game of Reversi in 1883, each denouncing the other as a fraud. The game gained considerable popularity in England at the end of the nineteenth century. The game's first reliable mention is on 21 August 1886 edition of The Saturday Review.\n\n\n== Comparison ==\nAnalysis of \"pure\" abstract strategy games is the subject of combinatorial game theory.  Abstract strategy games with hidden information, bluffing, or simultaneous move elements are better served by Von Neumann–Morgenstern game theory, while those with a component of luck may require probability theory incorporated into either of the above.\nAs for the qualitative aspects, ranking abstract strategy games according to their interest, complexity, or strategy levels is a daunting task and subject to extreme subjectivity.  In terms of measuring how finite a mathematical field each of the three top contenders represents, it is estimated that checkers has a game-tree complexity of  1040 possible games, whereas chess has approximately 10123. As for Go, the possible legal game positions range in the magnitude of 10170.\n\n\n== Champions ==\nThe Mind Sports Olympiad first held the Abstract Games World Championship in 2008 to try to find the best abstract strategy games all-rounder. The MSO event saw a change in format in 2011 restricting the competition to players' five best events, and was renamed the Modern Abstract Games World Championship.\n\n2008:  David M. Pearce (England)\n2009:  David M. Pearce (England)\n2010:  David M. Pearce (England)\n2011:  David M. Pearce (England)\n2012:  Andres Kuusk (Estonia)\n2013:  Andres Kuusk (Estonia)\n\n\n== See also ==\nConnection games\nGame complexity\nList of abstract strategy games\nList of world championships in mind sports\nMind Sports Olympiad\nWorld Mind Sports Games\n\n\n== References ==\n\n\n== External links ==\nThe University of Alberta Games Group\nDavid Eppstein's CGT page\n\"Redefining the abstract\", by Cesco Reale in Abstract Games Magazine 23, Spring 2022",
    "Air hockey is a Pong-like tabletop sport where two opposing players try to score goals against each other on a low-friction table using two hand-held discs (\"mallets\") and a lightweight plastic puck.\nThe air hockey table has raised edges that allow the puck to reflect off horizontally, and a very smooth, slippery surface that further reduces friction by suspending the puck on a thin cushion of air ejected from tiny vent holes built inside the surface. This causes the puck to hover and move easily across the table with little loss of velocity, which simulates the lubricated sliding of an ice hockey puck across a well polished rink, hence the name of the game.\n\n\n== Air hockey tables ==\nA typical air hockey table consists of a large smooth playing surface designed to minimize friction, a surrounding rail to prevent the puck and strikers (paddles) from leaving the table, and slots in the rail at either end of the table that serve as goals. On the ends of the table behind and below the goals, there is usually a puck return. Additionally, tables will typically have some sort of machinery that produces a cushion of air on the playing surface through tiny holes, with the purpose of reducing friction and increasing play speed. In some tables, the machinery is eschewed in favor of a slick table surface, usually plastic, in the interest of saving money in both manufacturing and maintenance costs. Note that these tables are technically not air hockey tables, since no air is involved; however, they are still generally understood to be as such due to the basic similarity of gameplay. There also exist pucks that use a battery and fan to generate their own air cushion, but as they are prone to breakage, they are commonly marketed only as toys. \n\n The only tables that are approved for play and sanctioned by the USAA (United States Air Hockey Association) and the AHPA (Air Hockey Players Association) for tournament play are 8-foot tables. Approved tables include all Gold Standard Games 8-foot tables; some 8-foot tables from Dynamo; and the original 8-foot commercial Brunswick tables. Other full-size novelty-type tables with flashing lights on the field of play, painted rails, and/or smaller pucks are not approved for tournament play but can be used to learn the game. There are also tables for air hockey having a size of 1.5, 2, or 2.5 feet. They are called a mini air hockey. This is due to the small dimensions of the table, bits, washers.\n\nA striker (sometimes called a goalie, mallet or paddle) consists of a simple handle attached to a flat surface that will usually lie flush with the surface of the table. The most common paddles, called \"high-tops\", resemble small plastic sombreros, but other paddles, \"flat-tops\", are used with a shorter nub. Air Hockey pucks are discs made of Lexan polycarbonate resin. Standard USAA and AHPA-approved pucks are yellow, red, and green. In competitive play, a layer of thin white tape is placed on the face-up side. Air Hockey pucks come in circles and other shapes (triangle, hexagon, octagon, or square).\nFour-player tables also exist, but they are not sanctioned for competitive play.\n\n\n== Gameplay ==\nCompetitive (tournament) play is usually distinguished by the following:\n\nThe mallet is gripped behind the knob using one's fingertips, not on top of it. This allows more wrist action and helps the player to move the striker around the table faster.\nFor basic defense, the mallet is kept centered at least 8 inches out from the goal. In this position, very slight movements to the left and right will block virtually all straight shots.  To block bank shots, one pulls back quickly to the corners of the goal. This is known as the \"triangle defense\".\nShots are often hit out of \"drifts\", where the puck travels in set patterns designed to throw off the opponent's expectations and timing. The most popular drifts are the \"center\", \"diamond\", \"diagonal\", and \"L\".\nShots are often organized into meaning groups of shots which are hit with the same apparent delivery but opposite directions, caused by hitting the puck at slightly different locations on the striker. For example, a transverse motion of the right arm can lead to a \"cut shot\" to the left corner of the opponent's goal or a \"right wall under\" (bank off the right wall, into the right corner of the opponent's goal).\n\n\n== History ==\nAir hockey is a game resting on an older technology, the air table. Air tables began as a conveyor technology allowing heavy objects like cardboard boxes to easily slide over a table surface. The original air tables of the 1940s had rather large holes that were plugged by ball bearings. An object sitting on the table would depress the balls, allowing air to escape and lift the object slightly off the table.By 1967, this had been refined and repurposed as a tool for teaching elementary physics. The table top was a sandwich of fiberboard or plexiglass sheets separated by a honeycomb structure. The top surface was drilled with a grid of small holes, and the space between the boards was supplied with low-pressure compressed air, just enough to allow \"air pucks\" to float over the surface. While these air tables were fun to play with, they were not yet a game.\nIn 1968, Sega released an arcade electro-mechanical game similar to air hockey, MotoPolo. Based on polo, two players moved miniature motorbikes around inside a cabinet, with each player attempting to knock the balls into the opponent's goal. It also used an 8-track player to play back the sounds of the motorbikes.Air hockey was created by a group of Brunswick Billiards employees from 1969 to 1972. In 1969, a trio of Brunswick engineers – Phil Crossman, Bob Kenrick and Brad Baldwin – began work on creating a game using a low-friction surface. The project stagnated for several years until it was revived by Bob Lemieux, who then focused on implementing an abstracted version of ice hockey, with a thin disc, two strikers and slit-like goals equipped with photodetectors. It was then decided that the game might appeal to a larger market and air hockey was marketed and sold to the general public. The original patents reference Crossman, Kendrick and Lemieux. as well as earlier work on air tables.\nThe game was an immediate financial success and by the mid-1970s there arose substantial interest in tournament play. As early as 1973, players in Houston had formed the Houston Air Hockey Association, and soon thereafter, the Texas Air-Hockey Players Association, codifying rules and promoting the sport through local tournaments at Houston pubs Carnabys, Damians, and the University of Houston. To ensure uniform play standards of the highest competitive quality, the United States Air-Table Hockey Association (USAA) was formed in 1975 by J. Phillip \"Phil\" Arnold, largely as an official sanctioning body. In this way, non-player friendly rules imposed by Brunswick corporation were rendered void, and the sport of air hockey was secured under the control of players since that time. Since its inception, the USAA has sanctioned at least one national-level or World championship each year, crowning 12 different champions over 30 years. In March 2015, the Air Hockey Players Association (AHPA) was announced and is providing air hockey players with an additional organization also overseeing the sport of air hockey. The two organizations run independently but abide by a similar set of rules and share many of the same players. In July 2015, the AHPA crowned not only its first world champion but also the youngest in the history of the sport in Colin Cummings of Beaumont, TX. Today, professional air hockey is played by a close-knit community of serious players around the world, with extensive player bases near Houston, San Francisco, Sacramento, Los Angeles, North Carolina, San Diego, Denver, Chicago, New York City, Boise, and Boston in the United States, Barcelona in Spain, Saint Petersburg, Moscow, and Novgorod in Russia. and Most and Brno in the Czech Republic. From the late 1980s, Caracas, Venezuela served as a hotbed of activity; three-time World Champion Jose Mora and other finalists originated from there. By 1999 most of the Venezuelan activity had disappeared.\n\n\n== Competitive air hockey ==\n\n\n=== Tournament history ===\nUSAA World Championships\nAHPA World Championship\nUS Championship\nEuropean Championship\nTexas State Open\nCatalan Championship\nRussian Open\n\n\n== Notes ==\n\n\n== References ==",
    "In mathematics and computer science, an algorithm ( ) is a finite sequence of rigorous instructions, typically used to solve a class of specific problems or to perform a computation. Algorithms are used as specifications for performing calculations and data processing. More advanced algorithms can use conditionals to divert the code execution through various routes (referred to as automated decision-making) and deduce valid inferences (referred to as automated reasoning), achieving automation eventually. Using human characteristics as descriptors of machines in metaphorical ways was already practiced by Alan Turing with terms such as \"memory\", \"search\" and \"stimulus\".In contrast, a heuristic is an approach to problem solving that may not be fully specified or may not guarantee correct or optimal results, especially in problem domains where there is no well-defined correct or optimal result.  For example, social media recommender systems rely on heuristics in such a way that, although widely characterized as \"algorithms\" in 21st century popular media, cannot deliver correct results due to the nature of the problem.\nAs an effective method, an algorithm can be expressed within a finite amount of space and time and in a well-defined formal language for calculating a function. Starting from an initial state and initial input (perhaps empty), the instructions describe a computation that, when executed, proceeds through a finite number of well-defined successive states, eventually producing \"output\" and terminating at a final ending state. The transition from one state to the next is not necessarily deterministic; some algorithms, known as randomized algorithms, incorporate random input.\n\n\n== History ==\n\n\n=== Ancient algorithms ===\nSince antiquity, step-by-step procedures for solving mathematical problems have been attested. This includes Babylonian mathematics (around 2500 BC), Egyptian mathematics (around 1550 BC), Indian mathematics (around 800 BC and later; e.g. Shulba Sutras, Kerala School, and Brāhmasphuṭasiddhānta), The Ifa Oracle (around 500 BC), Greek mathematics (around 240 BC, e.g. sieve of Eratosthenes and Euclidean algorithm), and Arabic mathematics (9th century, e.g. cryptographic algorithms for code-breaking based on frequency analysis).\n\n\n=== Al-Khwārizmī and the term algorithm ===\nAround 825, Muḥammad ibn Mūsā al-Khwārizmī wrote kitāb al-ḥisāb al-hindī (\"Book of Indian computation\") and kitab al-jam' wa'l-tafriq al-ḥisāb al-hindī (\"Addition and subtraction in Indian arithmetic\"). Both of these texts are lost in the original Arabic at this time. (However, his other book on algebra remains.)In the early 12th century, Latin translations of said al-Khwarizmi texts involving the Hindu–Arabic numeral system and arithmetic appeared: Liber Alghoarismi de practica arismetrice (attributed to John of Seville) and Liber Algorismi de numero Indorum (attributed to Adelard of Bath). Hereby, alghoarismi or algorismi is the Latinization of Al-Khwarizmi's name; the text starts with the phrase Dixit Algorismi (\"Thus spoke Al-Khwarizmi\").In 1240, Alexander of Villedieu writes a Latin text titled Carmen de Algorismo. It begins with:\n\nHaec algorismus ars praesens dicitur, in qua / Talibus Indorum fruimur bis quinque figuris.\nwhich translates to:\n\nAlgorism is the art by which at present we use those Indian figures, which number two times five.\nThe poem is a few hundred lines long and summarizes the art of calculating with the new styled Indian dice (Tali Indorum), or Hindu numerals.\n\n\n=== English evolution of the word ===\nAround 1230, the English word algorism is attested and then by Chaucer in 1391. English adopted the French term.In the 15th century, under the influence of the Greek word ἀριθμός (arithmos, \"number\"; cf. \"arithmetic\"), the Latin word was altered to algorithmus.\nIn 1656, in the English dictionary Glossographia, it says:\n\nAlgorism ([Latin] algorismus) the Art or use of Cyphers, or of numbering by Cyphers; skill in accounting.\nAugrime ([Latin] algorithmus) skil in accounting or numbring.\n\nIn 1658, in the first edition of The New World of English Words, it says:\n\nAlgorithme, (a word compounded of Arabick and Spanish,) the art of reckoning by Cyphers.\n\nIn 1706, in the sixth edition of The New World of English Words, it says:\n\nAlgorithm, the Art of computing or reckoning by numbers, which contains the five principle Rules of Arithmetick, viz. Numeration, Addition, Subtraction, Multiplication and Division; to which may be added Extraction of Roots: It is also call'd Logistica Numeralis.\nAlgorism, the practical Operation in the several Parts of Specious Arithmetick or Algebra; sometimes it is taken for the Practice of Common Arithmetick by the ten Numeral Figures.\n\nIn 1751, in the Young Algebraist's Companion, Daniel Fenning contrasts the terms algorism and algorithm as follows:\n\nAlgorithm signifies the first Principles, and Algorism the practical Part, or knowing how to put the Algorithm in Practice.\n\nSince at least 1811, the term algorithm is attested to mean a \"step-by-step procedure\" in English.In 1842, in the Dictionary of Science, Literature and Art, it says:\n\nALGORITHM, signifies the art of computing in reference to some particular subject, or in some particular way; as the algorithm of numbers; the algorithm of the differential calculus.\n\n\n=== Machine usage ===\nIn 1928, a partial formalization of the modern concept of algorithms began with attempts to solve the Entscheidungsproblem (decision problem) posed by David Hilbert. Later formalizations were framed as attempts to define \"effective calculability\" or \"effective method\". Those formalizations included the Gödel–Herbrand–Kleene recursive functions of 1930, 1934 and 1935, Alonzo Church's lambda calculus of 1936, Emil Post's Formulation 1 of 1936, and Alan Turing's Turing machines of 1936–37 and 1939.\n\n\n== Informal definition ==\n\nOne informal definition is \"a set of rules that precisely defines a sequence of operations\", which would include all computer programs (including programs that do not perform numeric calculations), and (for example) any prescribed bureaucratic procedure\nor cook-book recipe.In general, a program is an algorithm only if it stops eventually—even though infinite loops may sometimes prove desirable.\nA prototypical example of an algorithm is the Euclidean algorithm, which is used to determine the maximum common divisor of two integers; an example (there are others) is described by the flowchart above and as an example in a later section.\nBoolos, Jeffrey & 1974, 1999 offer an informal meaning of the word \"algorithm\" in the following quotation:\n\nNo human being can write fast enough, or long enough, or small enough† ( †\"smaller and smaller without limit ... you'd be trying to write on molecules, on atoms, on electrons\") to list all members of an enumerably infinite set by writing out their names, one after another, in some notation. But humans can do something equally useful, in the case of certain enumerably infinite sets: They can give explicit instructions for determining the nth member of the set, for arbitrary finite n. Such instructions are to be given quite explicitly, in a form in which they could be followed by a computing machine, or by a human who is capable of carrying out only very elementary operations on symbols.\nAn \"enumerably infinite set\" is one whose elements can be put into one-to-one correspondence with the integers. Thus Boolos and Jeffrey are saying that an algorithm implies instructions for a process that \"creates\" output integers from an arbitrary \"input\" integer or integers that, in theory, can be arbitrarily large. For example, an algorithm can be an algebraic equation such as y = m + n (i.e., two arbitrary \"input variables\" m and n that produce an output y), but various authors' attempts to define the notion indicate that the word implies much more than this, something on the order of (for the addition example):\n\nPrecise instructions (in a language understood by \"the computer\") for a fast, efficient, \"good\" process that specifies the \"moves\" of \"the computer\" (machine or human, equipped with the necessary internally contained information and capabilities) to find, decode, and then process arbitrary input integers/symbols m and n, symbols + and = ... and \"effectively\" produce, in a \"reasonable\" time, output-integer y at a specified place and in a specified format.The concept of algorithm is also used to define the notion of decidability—a notion that is central for explaining how formal systems come into being starting from a small set of axioms and rules. In logic, the time that an algorithm requires to complete cannot be measured, as it is not apparently related to the customary physical dimension. From such uncertainties, that characterize ongoing work, stems the unavailability of a definition of algorithm that suits both concrete (in some sense) and abstract usage of the term.\nMost algorithms are intended to be implemented as computer programs. However, algorithms are also implemented by other means, such as in a biological neural network (for example, the human brain implementing arithmetic or an insect looking for food), in an electrical circuit, or in a mechanical device.\n\n\n== Formalization ==\nAlgorithms are essential to the way computers process data. Many computer programs contain algorithms that detail the specific instructions a computer should perform—in a specific order—to carry out a specified task, such as calculating employees' paychecks or printing students' report cards. Thus, an algorithm can be considered to be any sequence of operations that can be simulated by a Turing-complete system. Authors who assert this thesis include Minsky (1967), Savage (1987), and Gurevich (2000):\n\n Minsky: \"But we will also maintain, with Turing ... that any procedure which could \"naturally\" be called effective, can, in fact, be realized by a (simple) machine. Although this may seem extreme, the arguments ... in its favor are hard to refute\".\n Gurevich: \"… Turing's informal argument in favor of his thesis justifies a stronger thesis: every algorithm can be simulated by a Turing machine … according to Savage [1987], an algorithm is a computational process defined by a Turing machine\".Turing machines can define computational processes that do not terminate. The informal definitions of algorithms generally require that the algorithm always terminates. This requirement renders the task of deciding whether a formal procedure is an algorithm impossible in the general case—due to a major theorem of computability theory known as the halting problem.\nTypically, when an algorithm is associated with processing information, data can be read from an input source, written to an output device and stored for further processing. Stored data is regarded as part of the internal state of the entity performing the algorithm. In practice, the state is stored in one or more data structures.\nFor some of these computational processes, the algorithm must be rigorously defined and specified in the way it applies in all possible circumstances that could arise. This means that any conditional steps must be systematically dealt with, case by case; the criteria for each case must be clear (and computable).\nBecause an algorithm is a precise list of precise steps, the order of computation is always crucial to the functioning of the algorithm. Instructions are usually assumed to be listed explicitly, and are described as starting \"from the top\" and going \"down to the bottom\"—an idea that is described more formally by flow of control.\nSo far, the discussion on the formalization of an algorithm has assumed the premises of imperative programming. This is the most common conception—one that attempts to describe a task in discrete, \"mechanical\" terms. Associated with this conception of formalized algorithms is the assignment operation, which sets the value of a variable. It derives from the intuition of \"memory\" as a scratchpad. An example of such an assignment can be found below.\nFor some alternate conceptions of what constitutes an algorithm, see functional programming and logic programming.\n\n\n== Expressing algorithms ==\nAlgorithms can be expressed in many kinds of notation, including natural languages, pseudocode, flowcharts, drakon-charts, programming languages or control tables (processed by interpreters). Natural language expressions of algorithms tend to be verbose and ambiguous and are rarely used for complex or technical algorithms. Pseudocode, flowcharts, drakon-charts and control tables are structured ways to express algorithms that avoid many of the ambiguities common in statements based on natural language. Programming languages are primarily intended for expressing algorithms in a form that can be executed by a computer, but they are also often used as a way to define or document algorithms.\nThere is a wide variety of representations possible and one can express a given Turing machine program as a sequence of machine tables (see finite-state machine, state-transition table and control table for more), as flowcharts and drakon-charts (see state diagram for more), or as a form of rudimentary machine code or assembly code called \"sets of quadruples\" (see Turing machine for more).\nRepresentations of algorithms can be classified into three accepted levels of Turing machine description, as follows:\n1 High-level description\n\"...prose to describe an algorithm, ignoring the implementation details. At this level, we do not need to mention how the machine manages its tape or head.\"\n2 Implementation description\n\"...prose used to define the way the Turing machine uses its head and the way that it stores data on its tape. At this level, we do not give details of states or transition function.\"\n3 Formal description\nMost detailed, \"lowest level\", gives the Turing machine's \"state table\".For an example of the simple algorithm \"Add m+n\" described in all three levels, see Examples.\n\n\n== Design ==\n\nAlgorithm design refers to a method or a mathematical process for problem-solving and engineering algorithms. The design of algorithms is part of many solution theories, such as divide-and-conquer or dynamic programming within operation research. Techniques for designing and implementing algorithm designs are also called algorithm design patterns, with examples including the template method pattern and the decorator pattern.\nOne of the most important aspects of algorithm design is resource (run-time, memory usage) efficiency; the big O notation is used to describe e.g., an algorithm's run-time growth as the size of its input increases.\nTypical steps in the development of algorithms:\n\nProblem definition\nDevelopment of a model\nSpecification of the algorithm\nDesigning an algorithm\nChecking the correctness of the algorithm\nAnalysis of algorithm\nImplementation of algorithm\nProgram testing\nDocumentation preparation\n\n\n== Computer algorithms ==\n\"Elegant\" (compact) programs, \"good\" (fast) programs: The notion of \"simplicity and elegance\" appears informally in Knuth and precisely in Chaitin:\n\nKnuth: \" ... we want good algorithms in some loosely defined aesthetic sense. One criterion ... is the length of time taken to perform the algorithm .... Other criteria are adaptability of the algorithm to computers, its simplicity, and elegance, etc.\"Chaitin: \" ... a program is 'elegant,' by which I mean that it's the smallest possible program for producing the output that it does\"Chaitin prefaces his definition with: \"I'll show you can't prove that a program is 'elegant'\"—such a proof would solve the Halting problem (ibid).\nAlgorithm versus function computable by an algorithm: For a given function multiple algorithms may exist. This is true even without expanding the available instruction set available to the programmer. Rogers observes that \"It is ... important to distinguish between the notion of algorithm, i.e. procedure and the notion of function computable by algorithm, i.e. mapping yielded by procedure. The same function may have several different algorithms\".Unfortunately, there may be a tradeoff between goodness (speed) and elegance (compactness)—an elegant program may take more steps to complete a computation than one that is less elegant. An example that uses Euclid's algorithm appears below.\nComputers (and computors), models of computation: A computer (or human \"computer\") is a restricted type of machine, a \"discrete deterministic mechanical device\" that blindly follows its instructions. Melzak's and Lambek's primitive models reduced this notion to four elements: (i) discrete, distinguishable locations, (ii) discrete, indistinguishable counters (iii) an agent, and (iv) a list of instructions that are effective relative to the capability of the agent.Minsky describes a more congenial variation of Lambek's \"abacus\" model in his \"Very Simple Bases for Computability\". Minsky's machine proceeds sequentially through its five (or six, depending on how one counts) instructions unless either a conditional IF-THEN GOTO or an unconditional GOTO changes program flow out of sequence. Besides HALT, Minsky's machine includes three assignment (replacement, substitution) operations: ZERO (e.g. the contents of the location replaced by 0: L ← 0), SUCCESSOR (e.g. L ← L+1), and DECREMENT (e.g. L ← L − 1). Rarely must a programmer write \"code\" with such a limited instruction set. But Minsky shows (as do Melzak and Lambek) that his machine is Turing complete with only four general types of instructions: conditional GOTO, unconditional GOTO, assignment/replacement/substitution, and HALT. However, a few different assignment instructions (e.g. DECREMENT, INCREMENT, and ZERO/CLEAR/EMPTY for a Minsky machine) are also required for Turing-completeness; their exact specification is somewhat up to the designer. The unconditional GOTO is convenient; it can be constructed by initializing a dedicated location to zero e.g. the instruction \" Z ← 0 \"; thereafter the instruction IF Z=0 THEN GOTO xxx is unconditional.\nSimulation of an algorithm: computer (computor) language: Knuth advises the reader that \"the best way to learn an algorithm is to try it . . . immediately take pen and paper and work through an example\". But what about a simulation or execution of the real thing? The programmer must translate the algorithm into a language that the simulator/computer/computor can effectively execute. Stone gives an example of this: when computing the roots of a quadratic equation the computer must know how to take a square root. If they do not, then the algorithm, to be effective, must provide a set of rules for extracting a square root.This means that the programmer must know a \"language\" that is effective relative to the target computing agent (computer/computor).\nBut what model should be used for the simulation? Van Emde Boas observes \"even if we base complexity theory on abstract instead of concrete machines, the arbitrariness of the choice of a model remains. It is at this point that the notion of simulation enters\". When speed is being measured, the instruction set matters. For example, the subprogram in Euclid's algorithm to compute the remainder would execute much faster if the programmer had a \"modulus\" instruction available rather than just subtraction (or worse: just Minsky's \"decrement\").\nStructured programming, canonical structures: Per the Church–Turing thesis, any algorithm can be computed by a model known to be Turing complete, and per Minsky's demonstrations, Turing completeness requires only four instruction types—conditional GOTO, unconditional GOTO, assignment, HALT. Kemeny and Kurtz observe that, while \"undisciplined\" use of unconditional GOTOs and conditional IF-THEN GOTOs can result in \"spaghetti code\", a programmer can write structured programs using only these instructions; on the other hand \"it is also possible, and not too hard, to write badly structured programs in a structured language\". Tausworthe augments the three Böhm-Jacopini canonical structures: SEQUENCE, IF-THEN-ELSE, and WHILE-DO, with two more: DO-WHILE and CASE. An additional benefit of a structured program is that it lends itself to proofs of correctness using mathematical induction.Canonical flowchart symbols: The graphical aid called a flowchart offers a way to describe and document an algorithm (and a computer program corresponding to it). Like the program flow of a Minsky machine, a flowchart always starts at the top of a page and proceeds down. Its primary symbols are only four: the directed arrow showing program flow, the rectangle (SEQUENCE, GOTO), the diamond (IF-THEN-ELSE), and the dot (OR-tie). The Böhm–Jacopini canonical structures are made of these primitive shapes. Sub-structures can \"nest\" in rectangles, but only if a single exit occurs from the superstructure. The symbols and their use to build the canonical structures are shown in the diagram.\n\n\n== Examples ==\n\n\n=== Algorithm example ===\nOne of the simplest algorithms is to find the largest number in a list of numbers of random order. Finding the solution requires looking at every number in the list. From this follows a simple algorithm, which can be stated in a high-level description in English prose, as:\nHigh-level description:\n\nIf there are no numbers in the set, then there is no highest number.\nAssume the first number in the set is the largest number in the set.\nFor each remaining number in the set: if this number is larger than the current largest number, consider this number to be the largest number in the set.\nWhen there are no numbers left in the set to iterate over, consider the current largest number to be the largest number of the set.(Quasi-)formal description:\nWritten in prose but much closer to the high-level language of a computer program, the following is the more formal coding of the algorithm in pseudocode or pidgin code:\n\n\n=== Euclid's algorithm ===\n\nIn mathematics, the Euclidean algorithm or Euclid's algorithm, is an efficient method for computing the greatest common divisor (GCD) of two integers (numbers), the largest number that divides them both without a remainder. It is named after the ancient Greek mathematician Euclid, who first described it in his Elements (c. 300 BC). It is one of the oldest algorithms in common use. It can be used to reduce fractions to their simplest form, and is a part of many other number-theoretic and cryptographic calculations.\n\nEuclid poses the problem thus: \"Given two numbers not prime to one another, to find their greatest common measure\". He defines \"A number [to be] a multitude composed of units\": a counting number, a positive integer not including zero. To \"measure\" is to place a shorter measuring length s successively (q times) along longer length l until the remaining portion r is less than the shorter length s. In modern words, remainder r = l − q×s, q being the quotient, or remainder r is the \"modulus\", the integer-fractional part left over after the division.For Euclid's method to succeed, the starting lengths must satisfy two requirements: (i) the lengths must not be zero, AND (ii) the subtraction must be \"proper\"; i.e., a test must guarantee that the smaller of the two numbers is subtracted from the larger (or the two can be equal so their subtraction yields zero).\nEuclid's original proof adds a third requirement: the two lengths must not be prime to one another. Euclid stipulated this so that he could construct a reductio ad absurdum proof that the two numbers' common measure is in fact the greatest. While Nicomachus' algorithm is the same as Euclid's, when the numbers are prime to one another, it yields the number \"1\" for their common measure. So, to be precise, the following is really Nicomachus' algorithm.\n\n\n==== Computer language for Euclid's algorithm ====\nOnly a few instruction types are required to execute Euclid's algorithm—some logical tests (conditional GOTO), unconditional GOTO, assignment (replacement), and subtraction.\n\nA location is symbolized by upper case letter(s), e.g. S, A, etc.\nThe varying quantity (number) in a location is written in lower case letter(s) and (usually) associated with the location's name. For example, location L at the start might contain the number l = 3009.\n\n\n==== An inelegant program for Euclid's algorithm ====\nThe following algorithm is framed as Knuth's four-step version of Euclid's and Nicomachus', but, rather than using division to find the remainder, it uses successive subtractions of the shorter length s from the remaining length r until r is less than s. The high-level description, shown in boldface, is adapted from Knuth 1973:2–4:\nINPUT:\n\n1 [Into two locations L and S put the numbers l and s that represent the two lengths]:\nINPUT L, S\n2 [Initialize R: make the remaining length r equal to the starting/initial/input length l]:\nR ← L\n\nE0: [Ensure r ≥ s.]\n\n3 [Ensure the smaller of the two numbers is in S and the larger in R]:\nIF R > S THEN\nthe contents of L is the larger number so skip over the exchange-steps 4, 5 and 6:\nGOTO step 7\nELSE\nswap the contents of R and S.\n4 L ← R (this first step is redundant, but is useful for later discussion).\n5 R ← S\n6 S ← L\n\nE1: [Find remainder]: Until the remaining length r in R is less than the shorter length s in S, repeatedly subtract the measuring number s in S from the remaining length r in R.\n\n7 IF S > R THEN\ndone measuring so\nGOTO 10\nELSE\nmeasure again,\n8 R ← R − S\n9 [Remainder-loop]:\nGOTO 7.\n\nE2: [Is the remainder zero?]: EITHER (i) the last measure was exact, the remainder in R is zero, and the program can halt, OR (ii) the algorithm must continue: the last measure left a remainder in R less than measuring number in S.\n\n10 IF R = 0 THEN\ndone so\nGOTO step 15\nELSE\nCONTINUE TO step 11,\n\nE3: [Interchange s and r]: The nut of Euclid's algorithm. Use remainder r to measure what was previously smaller number s; L serves as a temporary location.\n\n11 L ← R\n12 R ← S\n13 S ← L\n14 [Repeat the measuring process]:\nGOTO 7\n\nOUTPUT:\n\n15 [Done. S contains the greatest common divisor]:\nPRINT S\n\nDONE:\n\n16 HALT, END, STOP.\n\n\n==== An elegant program for Euclid's algorithm ====\nThe following version of Euclid's algorithm requires only six core instructions to do what thirteen are required to do by \"Inelegant\"; worse, \"Inelegant\" requires more types of instructions. The flowchart of \"Elegant\" can be found at the top of this article. In the (unstructured) Basic language, the steps are numbered, and the instruction LET [] = [] is the assignment instruction symbolized by ←.\n\nHow \"Elegant\" works: instead of an outer \"Euclid loop\", \"Elegant\" calculates the remainder of a division using modulo and shifts the variables A and B in each iteration. The following algorithm can be used with programming languages from the C-family:\n\nThe standard function abs changes negative integer to positive integer\nWhen input A or B has the value 0, the algorithm stops and the result is 0\nIf input A is greater than input B, the algorithm will automatically swap variables A and B during the first iteration via modulo\nThe iteration (a do while loop) starts and only stops when the variable B is set to 0:\n% calculates the modulo of division A and B, which reduces the number (e.g.: 23 = 3 × 6 + remainder 5)\nA is equated with B\nB is equated with the modulo-result\nThe iteration continues as long as B is greater than 0\nWhen the iteration stops, variable A always contains the greatest common divisor\n\n\n=== Testing the Euclid algorithms ===\nDoes an algorithm do what its author wants it to do? A few test cases usually give some confidence in the core functionality. But tests are not enough. For test cases, one source uses 3009 and 884. Knuth suggested 40902, 24140. Another interesting case is the two relatively prime numbers 14157 and 5950.\nBut \"exceptional cases\" must be identified and tested. Will \"Inelegant\" perform properly when R > S, S > R, R = S? Ditto for \"Elegant\": B > A, A > B, A = B? (Yes to all). What happens when one number is zero, both numbers are zero? (\"Inelegant\" computes forever in all cases; \"Elegant\" computes forever when A = 0.) What happens if negative numbers are entered? Fractional numbers? If the input numbers, i.e. the domain of the function computed by the algorithm/program, is to include only positive integers including zero, then the failures at zero indicate that the algorithm (and the program that instantiates it) is a partial function rather than a total function. A notable failure due to exceptions is the Ariane 5 Flight 501 rocket failure (June 4, 1996).\nProof of program correctness by use of mathematical induction: Knuth demonstrates the application of mathematical induction to an \"extended\" version of Euclid's algorithm, and he proposes \"a general method applicable to proving the validity of any algorithm\". Tausworthe proposes that a measure of the complexity of a program be the length of its correctness proof.\n\n\n=== Measuring and improving the Euclid algorithms ===\nElegance (compactness) versus goodness (speed): With only six core instructions, \"Elegant\" is the clear winner, compared to \"Inelegant\" at thirteen instructions. However, \"Inelegant\" is faster (it arrives at HALT in fewer steps). Algorithm analysis indicates why this is the case: \"Elegant\" does two conditional tests in every subtraction loop, whereas \"Inelegant\" only does one. As the algorithm (usually) requires many loop-throughs, on average much time is wasted doing a \"B = 0?\" test that is needed only after the remainder is computed.\nCan the algorithms be improved?: Once the programmer judges a program \"fit\" and \"effective\"—that is, it computes the function intended by its author—then the question becomes, can it be improved?\nThe compactness of \"Inelegant\" can be improved by the elimination of five steps. But Chaitin proved that compacting an algorithm cannot be automated by a generalized algorithm; rather, it can only be done heuristically; i.e., by exhaustive search (examples to be found at Busy beaver), trial and error, cleverness, insight, application of inductive reasoning, etc. Observe that steps 4, 5 and 6 are repeated in steps 11, 12 and 13. Comparison with \"Elegant\" provides a hint that these steps, together with steps 2 and 3, can be eliminated. This reduces the number of core instructions from thirteen to eight, which makes it \"more elegant\" than \"Elegant\", at nine steps.\nThe speed of \"Elegant\" can be improved by moving the \"B=0?\" test outside of the two subtraction loops. This change calls for the addition of three instructions (B = 0?, A = 0?, GOTO). Now \"Elegant\" computes the example-numbers faster; whether this is always the case for any given A, B, and R, S would require a detailed analysis.\n\n\n== Algorithmic analysis ==\n\nIt is frequently important to know how much of a particular resource (such as time or storage) is theoretically required for a given algorithm. Methods have been developed for the analysis of algorithms to obtain such quantitative answers (estimates); for example, an algorithm which adds up the elements of a list of n numbers would have a time requirement of \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n  , using big O notation. At all times the algorithm only needs to remember two values: the sum of all the elements so far, and its current position in the input list. Therefore, it is said to have a space requirement of \n  \n    \n      \n        O\n        (\n        1\n        )\n      \n    \n    {\\displaystyle O(1)}\n  , if the space required to store the input numbers is not counted, or \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n   if it is counted.\nDifferent algorithms may complete the same task with a different set of instructions in less or more time, space, or 'effort' than others. For example, a binary search algorithm (with cost \n  \n    \n      \n        O\n        (\n        log\n        ⁡\n        n\n        )\n      \n    \n    {\\displaystyle O(\\log n)}\n  ) outperforms a sequential search (cost \n  \n    \n      \n        O\n        (\n        n\n        )\n      \n    \n    {\\displaystyle O(n)}\n   ) when used for table lookups on sorted lists or arrays.\n\n\n=== Formal versus empirical ===\n\nThe analysis, and study of algorithms is a discipline of computer science, and is often practiced abstractly without the use of a specific programming language or implementation. In this sense, algorithm analysis resembles other mathematical disciplines in that it focuses on the underlying properties of the algorithm and not on the specifics of any particular implementation. Usually pseudocode is used for analysis as it is the simplest and most general representation. However, ultimately, most algorithms are usually implemented on particular hardware/software platforms and their algorithmic efficiency is eventually put to the test using real code. For the solution of a \"one off\" problem, the efficiency of a particular algorithm may not have significant consequences (unless n is extremely large) but for algorithms designed for fast interactive, commercial or long life scientific usage it may be critical. Scaling from small n to large n frequently exposes inefficient algorithms that are otherwise benign.\nEmpirical testing is useful because it may uncover unexpected interactions that affect performance. Benchmarks may be used to compare before/after potential improvements to an algorithm after program optimization.\nEmpirical tests cannot replace formal analysis, though, and are not trivial to perform in a fair manner.\n\n\n=== Execution efficiency ===\n\nTo illustrate the potential improvements possible even in well-established algorithms, a recent significant innovation, relating to FFT algorithms (used heavily in the field of image processing), can decrease processing time up to 1,000 times for applications like medical imaging. In general, speed improvements depend on special properties of the problem, which are very common in practical applications. Speedups of this magnitude enable computing devices that make extensive use of image processing (like digital cameras and medical equipment) to consume less power.\n\n\n== Classification ==\nThere are various ways to classify algorithms, each with its own merits.\n\n\n=== By implementation ===\nOne way to classify algorithms is by implementation means.\n\nRecursion\nA recursive algorithm is one that invokes (makes reference to) itself repeatedly until a certain condition (also known as termination condition) matches, which is a method common to functional programming. Iterative algorithms use repetitive constructs like loops and sometimes additional data structures like stacks to solve the given problems. Some problems are naturally suited for one implementation or the other. For example, towers of Hanoi is well understood using recursive implementation. Every recursive version has an equivalent (but possibly more or less complex) iterative version, and vice versa.\nSerial, parallel or distributed\nAlgorithms are usually discussed with the assumption that computers execute one instruction of an algorithm at a time. Those computers are sometimes called serial computers. An algorithm designed for such an environment is called a serial algorithm, as opposed to parallel algorithms or distributed algorithms. Parallel algorithms are algorithms that take advantage of computer architectures where multiple processors can work on a problem at the same time. Distributed algorithms are algorithms that use multiple machines connected with a computer network. Parallel and distributed algorithms divide the problem into more symmetrical or asymmetrical subproblems and collect the results back together. For example, a CPU would be an example of a parallel algorithm. The resource consumption in such algorithms is not only processor cycles on each processor but also the communication overhead between the processors. Some sorting algorithms can be parallelized efficiently, but their communication overhead is expensive. Iterative algorithms are generally parallelizable, but some problems have no parallel algorithms and are called inherently serial problems.\nDeterministic or non-deterministic\nDeterministic algorithms solve the problem with exact decision at every step of the algorithm whereas non-deterministic algorithms solve problems via guessing although typical guesses are made more accurate through the use of heuristics.\nExact or approximate\nWhile many algorithms reach an exact solution, approximation algorithms seek an approximation that is closer to the true solution. The approximation can be reached by either using a deterministic or a random strategy. Such algorithms have practical value for many hard problems. One of the examples of an approximate algorithm is the Knapsack problem, where there is a set of given items. Its goal is to pack the knapsack to get the maximum total value. Each item has some weight and some value. Total weight that can be carried is no more than some fixed number X. So, the solution must consider weights of items as well as their value.\nQuantum algorithm\nThey run on a realistic model of quantum computation. The term is usually used for those algorithms which seem inherently quantum, or use some essential feature of Quantum computing such as quantum superposition or quantum entanglement.\n\n\n=== By design paradigm ===\nAnother way of classifying algorithms is by their design methodology or paradigm. There is a certain number of paradigms, each different from the other. Furthermore, each of these categories includes many different types of algorithms. Some common paradigms are:\n\nBrute-force or exhaustive search\nBrute force is a method of problem-solving that involves systematically trying every possible option until the optimal solution is found. This approach can be very time consuming, as it requires going through every possible combination of variables. However, it is often used when other methods are not available or too complex. Brute force can be used to solve a variety of problems, including finding the shortest path between two points and cracking passwords.\nDivide and conquer\nA divide-and-conquer algorithm repeatedly reduces an instance of a problem to one or more smaller instances of the same problem (usually recursively) until the instances are small enough to solve easily. One such example of divide and conquer is merge sorting. Sorting can be done on each segment of data after dividing data into segments and sorting of entire data can be obtained in the conquer phase by merging the segments. A simpler variant of divide and conquer is called a decrease-and-conquer algorithm, which solves an identical subproblem and uses the solution of this subproblem to solve the bigger problem. Divide and conquer divides the problem into multiple subproblems and so the conquer stage is more complex than decrease and conquer algorithms. An example of a decrease and conquer algorithm is the binary search algorithm.\nSearch and enumeration\nMany problems (such as playing chess) can be modeled as problems on graphs. A graph exploration algorithm specifies rules for moving around a graph and is useful for such problems. This category also includes search algorithms, branch and bound enumeration and backtracking.\nRandomized algorithm\nSuch algorithms make some choices randomly (or pseudo-randomly). They can be very useful in finding approximate solutions for problems where finding exact solutions can be impractical (see heuristic method below). For some of these problems, it is known that the fastest approximations must involve some randomness. Whether randomized algorithms with polynomial time complexity can be the fastest algorithms for some problems is an open question known as the P versus NP problem. There are two large classes of such algorithms:Monte Carlo algorithms return a correct answer with high-probability. E.g. RP is the subclass of these that run in polynomial time.\nLas Vegas algorithms always return the correct answer, but their running time is only probabilistically bound, e.g. ZPP.Reduction of complexity\nThis technique involves solving a difficult problem by transforming it into a better-known problem for which we have (hopefully) asymptotically optimal algorithms. The goal is to find a reducing algorithm whose complexity is not dominated by the resulting reduced algorithm's. For example, one selection algorithm for finding the median in an unsorted list involves first sorting the list (the expensive portion) and then pulling out the middle element in the sorted list (the cheap portion). This technique is also known as transform and conquer.\nBack tracking\nIn this approach, multiple solutions are built incrementally and abandoned when it is determined that they cannot lead to a valid full solution.\n\n\n=== Optimization problems ===\nFor optimization problems there is a more specific classification of algorithms; an algorithm for such problems may fall into one or more of the general categories described above as well as into one of the following:\n\nLinear programming\nWhen searching for optimal solutions to a linear function bound to linear equality and inequality constraints, the constraints of the problem can be used directly in producing the optimal solutions. There are algorithms that can solve any problem in this category, such as the popular simplex algorithm. Problems that can be solved with linear programming include the maximum flow problem for directed graphs. If a problem additionally requires that one or more of the unknowns must be an integer then it is classified in integer programming. A linear programming algorithm can solve such a problem if it can be proved that all restrictions for integer values are superficial, i.e., the solutions satisfy these restrictions anyway. In the general case, a specialized algorithm or an algorithm that finds approximate solutions is used, depending on the difficulty of the problem.\nDynamic programming\nWhen a problem shows optimal substructures—meaning the optimal solution to a problem can be constructed from optimal solutions to subproblems—and overlapping subproblems, meaning the same subproblems are used to solve many different problem instances, a quicker approach called dynamic programming avoids recomputing solutions that have already been computed. For example, Floyd–Warshall algorithm, the shortest path to a goal from a vertex in a weighted graph can be found by using the shortest path to the goal from all adjacent vertices. Dynamic programming and memoization go together. The main difference between dynamic programming and divide and conquer is that subproblems are more or less independent in divide and conquer, whereas subproblems overlap in dynamic programming. The difference between dynamic programming and straightforward recursion is in caching or memoization of recursive calls. When subproblems are independent and there is no repetition, memoization does not help; hence dynamic programming is not a solution for all complex problems. By using memoization or maintaining a table of subproblems already solved, dynamic programming reduces the exponential nature of many problems to polynomial complexity.\nThe greedy method\nA greedy algorithm is similar to a dynamic programming algorithm in that it works by examining substructures, in this case not of the problem but of a given solution. Such algorithms start with some solution, which may be given or have been constructed in some way, and improve it by making small modifications. For some problems they can find the optimal solution while for others they stop at local optima, that is, at solutions that cannot be improved by the algorithm but are not optimum. The most popular use of greedy algorithms is for finding the minimal spanning tree where finding the optimal solution is possible with this method. Huffman Tree, Kruskal, Prim, Sollin are greedy algorithms that can solve this optimization problem.\nThe heuristic method\nIn optimization problems, heuristic algorithms can be used to find a solution close to the optimal solution in cases where finding the optimal solution is impractical. These algorithms work by getting closer and closer to the optimal solution as they progress. In principle, if run for an infinite amount of time, they will find the optimal solution. Their merit is that they can find a solution very close to the optimal solution in a relatively short time. Such algorithms include local search, tabu search, simulated annealing, and genetic algorithms. Some of them, like simulated annealing, are non-deterministic algorithms while others, like tabu search, are deterministic. When a bound on the error of the non-optimal solution is known, the algorithm is further categorized as an approximation algorithm.\n\n\n=== By field of study ===\n\nEvery field of science has its own problems and needs efficient algorithms. Related problems in one field are often studied together. Some example classes are search algorithms, sorting algorithms, merge algorithms, numerical algorithms, graph algorithms, string algorithms, computational geometric algorithms, combinatorial algorithms, medical algorithms, machine learning, cryptography, data compression algorithms and parsing techniques.\nFields tend to overlap with each other, and algorithm advances in one field may improve those of other, sometimes completely unrelated, fields. For example, dynamic programming was invented for optimization of resource consumption in industry but is now used in solving a broad range of problems in many fields.\n\n\n=== By complexity ===\n\nAlgorithms can be classified by the amount of time they need to complete compared to their input size:\n\nConstant time: if the time needed by the algorithm is the same, regardless of the input size. E.g. an access to an array element.\nLogarithmic time: if the time is a logarithmic function of the input size. E.g. binary search algorithm.\nLinear time: if the time is proportional to the input size. E.g. the traverse of a list.\nPolynomial time: if the time is a power of the input size. E.g. the bubble sort algorithm has quadratic time complexity.\nExponential time: if the time is an exponential function of the input size. E.g. Brute-force search.Some problems may have multiple algorithms of differing complexity, while other problems might have no algorithms or no known efficient algorithms. There are also mappings from some problems to other problems. Owing to this, it was found to be more suitable to classify the problems themselves instead of the algorithms into equivalence classes based on the complexity of the best possible algorithms for them.\n\n\n=== Continuous algorithms ===\nThe adjective \"continuous\" when applied to the word \"algorithm\" can mean:\n\nAn algorithm operating on data that represents continuous quantities, even though this data is represented by discrete approximations—such algorithms are studied in numerical analysis; or\nAn algorithm in the form of a differential equation that operates continuously on the data, running on an analog computer.\n\n\n== Algorithm = Logic + Control ==\nIn logic programming, algorithms are viewed as having both \"a logic component, which specifies the knowledge to be  used in solving problems, and a control component, which determines the problem-solving strategies by means of which that knowledge is used.\"The Euclidean algorithm illustrates this view of an algorithm. Here is a logic programming representation, using :- to represent \"if\", and the relation gcd(A, B, C) to represent the function gcd(A, B) = C: \n\nIn the logic programming language Ciao the gcd relation can be represented directly in functional notation:\n\nThe Ciao implementation translates the functional notation into a relational representation in   Prolog, extracting the embedded subtractions, A-B and B-A, as separate conditions:\n\nThe resulting program has a purely logical (and \"declarative\") reading, as a recursive (or inductive) definition, which is independent of how the logic is used to solve problems:\n\nDifferent problem-solving strategies turn the logic into different algorithms. In theory, given a pair of integers A and B, forward (or \"bottom-up\") reasoning could be used to generate all instances of the gcd relation, terminating when the desired gcd of A and B is generated. Of course, forward reasoning is entirely useless in this case. But in other cases, such as the definition of the Fibonacci sequence and Datalog, forward reasoning can be an efficient problem solving strategy. (See for example the logic program for computing fibonacci numbers in Algorithm = Logic + Control).\nIn contrast with the inefficiency of forward reasoning in this example, backward (or \"top-down\") reasoning using SLD resolution turns the logic into the Euclidean algorithm:\n\nOne of the advantages of the logic programming representation of the algorithm is that its purely logical reading makes it easier to verify that the algorithm is correct relative to the standard non-recursive definition of gcd. Here is the standard definition written in Prolog:\n\nThis definition, which is the specification of the Euclidean algorithm, is also executable in Prolog: Backward reasoning treats the specification as the brute-force algorithm that iterates through all of the integers C between 1 and A, checking whether C divides both A and B, and then for each such C iterates again through all of the integers D between 1 and A, until it finds a C such that C is greater than or equal to all of the D that also divide both A and B. Although this algorithm is hopelessly inefficient, it shows that formal specifications can often be written in logic programming form, and they can be executed by Prolog, to check that they correctly represent informal requirements.\n\n\n== Legal issues ==\n\nAlgorithms, by themselves, are not usually patentable. In the United States, a claim consisting solely of simple manipulations of abstract concepts, numbers, or signals does not constitute \"processes\" (USPTO 2006), so algorithms are not patentable (as in Gottschalk v. Benson). However practical applications of algorithms are sometimes patentable. For example, in Diamond v. Diehr, the application of a simple feedback algorithm to aid in the curing of synthetic rubber was deemed patentable. The patenting of software is controversial, and there are criticized patents involving algorithms, especially data compression algorithms, such as Unisys's LZW patent.\nAdditionally, some cryptographic algorithms have export restrictions (see export of cryptography).\n\n\n== History: Development of the notion of \"algorithm\" ==\n\n\n=== Ancient Near East ===\nThe earliest evidence of algorithms is found in the Babylonian mathematics of ancient Mesopotamia (modern Iraq). A Sumerian clay tablet found in Shuruppak near Baghdad and dated to c. 2500 BC described the earliest division algorithm. During the Hammurabi dynasty c. 1800 – c. 1600 BC, Babylonian clay tablets described algorithms for computing formulas. Algorithms were also used in Babylonian astronomy. Babylonian clay tablets describe and employ algorithmic procedures to compute the time and place of significant astronomical events.Algorithms for arithmetic are also found in ancient Egyptian mathematics, dating back to the Rhind Mathematical Papyrus c. 1550 BC. Algorithms were later used in ancient Hellenistic mathematics. Two examples are the Sieve of Eratosthenes, which was described in the Introduction to Arithmetic by Nicomachus,: Ch 9.2  and the Euclidean algorithm, which was first described in Euclid's Elements (c. 300 BC).: Ch 9.1 \n\n\n=== Discrete and distinguishable symbols ===\nTally-marks: To keep track of their flocks, their sacks of grain and their money the ancients used tallying: accumulating stones or marks scratched on sticks or making discrete symbols in clay. Through the Babylonian and Egyptian use of marks and symbols, eventually Roman numerals and the abacus evolved (Dilson, p. 16–41). Tally marks appear prominently in unary numeral system arithmetic used in Turing machine and Post–Turing machine computations.\n\n\n=== Manipulation of symbols as \"place holders\" for numbers: algebra ===\nMuhammad ibn Mūsā al-Khwārizmī, a Persian mathematician, wrote the Al-jabr in the 9th century. The terms \"algorism\" and \"algorithm\" are derived from the name al-Khwārizmī, while the term \"algebra\" is derived from the book Al-jabr. In Europe, the word \"algorithm\" was originally used to refer to the sets of rules and techniques used by Al-Khwarizmi to solve algebraic equations, before later being generalized to refer to any set of rules or techniques. This eventually culminated in Leibniz's notion of the calculus ratiocinator (c. 1680):\n\nA good century and a half ahead of his time, Leibniz proposed an algebra of logic, an algebra that would specify the rules for manipulating logical concepts in the manner that ordinary algebra specifies the rules for manipulating numbers.\n\n\n=== Cryptographic algorithms ===\nThe first cryptographic algorithm for deciphering encrypted code was developed by Al-Kindi, a 9th-century Arab mathematician, in A Manuscript On Deciphering Cryptographic Messages. He gave the first description of cryptanalysis by frequency analysis, the earliest codebreaking algorithm.\n\n\n=== Mechanical contrivances with discrete states ===\nThe clock: Bolter credits the invention of the weight-driven clock as \"The key invention [of Europe in the Middle Ages]\", in particular, the verge escapement that provides us with the tick and tock of a mechanical clock. \"The accurate automatic machine\" led immediately to \"mechanical automata\" beginning in the 13th century and finally to \"computational machines\"—the difference engine and analytical engines of Charles Babbage and Countess Ada Lovelace, mid-19th century. Lovelace is credited with the first creation of an algorithm intended for processing on a computer—Babbage's analytical engine, the first device considered a real Turing-complete computer instead of just a calculator—and is sometimes called \"history's first programmer\" as a result, though a full implementation of Babbage's second device would not be realized until decades after her lifetime.\nLogical machines 1870 – Stanley Jevons' \"logical abacus\" and \"logical machine\": The technical problem was to reduce Boolean equations when presented in a form similar to what is now known as Karnaugh maps. Jevons (1880) describes first a simple \"abacus\" of \"slips of wood furnished with pins, contrived so that any part or class of the [logical] combinations can be picked out mechanically ... More recently, however, I have reduced the system to a completely mechanical form, and have thus embodied the whole of the indirect process of inference in what may be called a Logical Machine\" His machine came equipped with \"certain moveable wooden rods\" and \"at the foot are 21 keys like those of a piano [etc.] ...\". With this machine he could analyze a \"syllogism or any other simple logical argument\".This machine he displayed in 1870 before the Fellows of the Royal Society. Another logician John Venn, however, in his 1881 Symbolic Logic, turned a jaundiced eye to this effort: \"I have no high estimate myself of the interest or importance of what are sometimes called logical machines ... it does not seem to me that any contrivances at present known or likely to be discovered really deserve the name of logical machines\"; see more at Algorithm characterizations. But not to be outdone he too presented \"a plan somewhat analogous, I apprehend, to Prof. Jevon's abacus ... [And] [a]gain, corresponding to Prof. Jevons's logical machine, the following contrivance may be described. I prefer to call it merely a logical-diagram machine ... but I suppose that it could do very completely all that can be rationally expected of any logical machine\".Jacquard loom, Hollerith punch cards, telegraphy and telephony – the electromechanical relay: Bell and Newell (1971) indicate that the Jacquard loom (1801), precursor to Hollerith cards (punch cards, 1887), and \"telephone switching technologies\" were the roots of a tree leading to the development of the first computers. By the mid-19th century the telegraph, the precursor of the telephone, was in use throughout the world, its discrete and distinguishable encoding of letters as \"dots and dashes\" a common sound. By the late 19th century the ticker tape (c. 1870s) was in use, as was the use of Hollerith cards in the 1890 U.S. census. Then came the teleprinter (c. 1910) with its punched-paper use of Baudot code on tape.\nTelephone-switching networks of electromechanical relays (invented 1835) was behind the work of George Stibitz (1937), the inventor of the digital adding device. As he worked in Bell Laboratories, he observed the \"burdensome' use of mechanical calculators with gears. \"He went home one evening in 1937 intending to test his idea... When the tinkering was over, Stibitz had constructed a binary adding device\".The mathematician Martin Davis observes the particular importance of the electromechanical relay (with its two \"binary states\" open and closed):\n\nIt was only with the development, beginning in the 1930s, of electromechanical calculators using electrical relays, that machines were built having the scope Babbage had envisioned.\"\n\n\n=== Mathematics during the 19th century up to the mid-20th century ===\nSymbols and rules: In rapid succession, the mathematics of George Boole (1847, 1854), Gottlob Frege (1879), and Giuseppe Peano (1888–1889) reduced arithmetic to a sequence of symbols manipulated by rules. Peano's The principles of arithmetic, presented by a new method (1888) was \"the first attempt at an axiomatization of mathematics in a symbolic language\".But Heijenoort gives Frege (1879) this kudos: Frege's is \"perhaps the most important single work ever written in logic. ... in which we see a \"'formula language', that is a lingua characterica, a language written with special symbols, \"for pure thought\", that is, free from rhetorical embellishments ... constructed from specific symbols that are manipulated according to definite rules\". The work of Frege was further simplified and amplified by Alfred North Whitehead and Bertrand Russell in their Principia Mathematica (1910–1913).\nThe paradoxes: At the same time a number of disturbing paradoxes appeared in the literature, in particular, the Burali-Forti paradox (1897), the Russell paradox (1902–03), and the Richard Paradox. The resultant considerations led to Kurt Gödel's paper (1931)—he specifically cites the paradox of the liar—that completely reduces rules of recursion to numbers.\nEffective calculability: In an effort to solve the Entscheidungsproblem defined precisely by Hilbert in 1928, mathematicians first set about to define what was meant by an \"effective method\" or \"effective calculation\" or \"effective calculability\" (i.e., a calculation that would succeed). In rapid succession the following appeared: Alonzo Church, Stephen Kleene and J.B. Rosser's λ-calculus a finely honed definition of \"general recursion\" from the work of Gödel acting on suggestions of Jacques Herbrand (cf. Gödel's Princeton lectures of 1934) and subsequent simplifications by Kleene. Church's proof that the Entscheidungsproblem was unsolvable, Emil Post's definition of effective calculability as a worker mindlessly following a list of instructions to move left or right through a sequence of rooms and while there either mark or erase a paper or observe the paper and make a yes-no decision about the next instruction. Alan Turing's proof of that the Entscheidungsproblem was unsolvable by use of his \"a- [automatic-] machine\"—in effect almost identical to Post's \"formulation\", J. Barkley Rosser's definition of \"effective method\" in terms of \"a machine\". Kleene's proposal of a precursor to \"Church thesis\" that he called \"Thesis I\", and a few years later Kleene's renaming his Thesis \"Church's Thesis\" and proposing \"Turing's Thesis\".\n\n\n=== Emil Post (1936) and Alan Turing (1936–37, 1939) ===\nEmil Post (1936) described the actions of a \"computer\" (human being) as follows:\n\n\"...two concepts are involved: that of a symbol space in which the work leading from problem to answer is to be carried out, and a fixed unalterable set of directions.His symbol space would be\n\n\"a two-way infinite sequence of spaces or boxes ... The problem solver or worker is to move and work in this symbol space, being capable of being in, and operating in but one box at a time. ... a box is to admit of but two possible conditions, i.e., being empty or unmarked, and having a single mark in it, say a vertical stroke.\"One box is to be singled out and called the starting point. ... a specific problem is to be given in symbolic form by a finite number of boxes [i.e., INPUT] being marked with a stroke. Likewise, the answer [i.e., OUTPUT] is to be given in symbolic form by such a configuration of marked boxes...\"A set of directions applicable to a general problem sets up a deterministic process when applied to each specific problem. This process terminates only when it comes to the direction of type (C ) [i.e., STOP]\". See more at Post–Turing machineAlan Turing's work preceded that of Stibitz (1937); it is unknown whether Stibitz knew of the work of Turing. Turing's biographer believed that Turing's use of a typewriter-like model derived from a youthful interest: \"Alan had dreamt of inventing typewriters as a boy; Mrs. Turing had a typewriter, and he could well have begun by asking himself what was meant by calling a typewriter 'mechanical'\". Given the prevalence at the time of Morse code, telegraphy, ticker tape machines, and teletypewriters, it is quite possible that all were influences on Turing during his youth.\nTuring—his model of computation is now called a Turing machine—begins, as did Post, with an analysis of a human computer that he whittles down to a simple set of basic motions and \"states of mind\". But he continues a step further and creates a machine as a model of computation of numbers.\n\"Computing is normally done by writing certain symbols on paper. We may suppose this paper is divided into squares like a child's arithmetic book...I assume then that the computation is carried out on one-dimensional paper, i.e., on a tape divided into squares. I shall also suppose that the number of symbols which may be printed is finite...\"The behavior of the computer at any moment is determined by the symbols which he is observing, and his \"state of mind\" at that moment. We may suppose that there is a bound B to the number of symbols or squares that the computer can observe at one moment. If he wishes to observe more, he must use successive observations. We will also suppose that the number of states of mind which need be taken into account is finite...\"Let us imagine that the operations performed by the computer to be split up into 'simple operations' which are so elementary that it is not easy to imagine them further divided.\"Turing's reduction yields the following:\n\n\"The simple operations must therefore include:\n\"(a) Changes of the symbol on one of the observed squares\n\"(b) Changes of one of the squares observed to another square within L squares of one of the previously observed squares.\"It may be that some of these change necessarily invoke a change of state of mind. The most general single operation must, therefore, be taken to be one of the following:\n\n\"(A) A possible change (a) of symbol together with a possible change of state of mind.\n\"(B) A possible change (b) of observed squares, together with a possible change of state of mind\"\"We may now construct a machine to do the work of this computer.\"A few years later, Turing expanded his analysis (thesis, definition) with this forceful expression of it:\n\n\"A function is said to be \"effectively calculable\" if its values can be found by some purely mechanical process. Though it is fairly easy to get an intuitive grasp of this idea, it is nevertheless desirable to have some more definite, mathematical expressible definition ... [he discusses the history of the definition pretty much as presented above with respect to Gödel, Herbrand, Kleene, Church, Turing, and Post] ... We may take this statement literally, understanding by a purely mechanical process one which could be carried out by a machine. It is possible to give a mathematical description, in a certain normal form, of the structures of these machines. The development of these ideas leads to the author's definition of a computable function, and to an identification of computability † with effective calculability...\n\"† We shall use the expression \"computable function\" to mean a function calculable by a machine, and we let \"effectively calculable\" refer to the intuitive idea without particular identification with any one of these definitions\".\n\n\n=== J. B. Rosser (1939) and S. C. Kleene (1943) ===\nJ. Barkley Rosser defined an \"effective [mathematical] method\" in the following manner (italicization added):\n\n\"'Effective method' is used here in the rather special sense of a method each step of which is precisely determined and which is certain to produce the answer in a finite number of steps. With this special meaning, three different precise definitions have been given to date. [his footnote #5; see discussion immediately below]. The simplest of these to state (due to Post and Turing) says essentially that an effective method of solving certain sets of problems exists if one can build a machine which will then solve any problem of the set with no human intervention beyond inserting the question and (later) reading the answer. All three definitions are equivalent, so it doesn't matter which one is used. Moreover, the fact that all three are equivalent is a very strong argument for the correctness of any one.\" (Rosser 1939:225–226)Rosser's footnote No. 5 references the work of (1) Church and Kleene and their definition of λ-definability, in particular, Church's use of it in his An Unsolvable Problem of Elementary Number Theory (1936); (2) Herbrand and Gödel and their use of recursion, in particular, Gödel's use in his famous paper On Formally Undecidable Propositions of Principia Mathematica and Related Systems I (1931); and (3) Post (1936) and Turing (1936–37) in their mechanism-models of computation.\nStephen C. Kleene defined as his now-famous \"Thesis I\" known as the Church–Turing thesis. But he did this in the following context (boldface in original):\n\n\"12. Algorithmic theories... In setting up a complete algorithmic theory, what we do is to describe a procedure, performable for each set of values of the independent variables, which procedure necessarily terminates and in such manner that from the outcome we can read a definite answer, \"yes\" or \"no,\" to the question, \"is the predicate value true?\"\" (Kleene 1943:273)\n\n\n=== History after 1950 ===\nA number of efforts have been directed toward further refinement of the definition of \"algorithm\", and activity is on-going because of issues surrounding, in particular, foundations of mathematics (especially the Church–Turing thesis) and philosophy of mind (especially arguments about artificial intelligence). For more, see Algorithm characterizations.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== Bibliography ==\n\nZaslavsky, C. (1970). Mathematics of the Yoruba People and of Their Neighbors in Southern Nigeria. The Two-Year College Mathematics Journal, 1(2), 76–99. https://doi.org/10.2307/3027363\n\n\n== Further reading ==\n\n\n== External links ==\n\n\"Algorithm\". Encyclopedia of Mathematics. EMS Press. 2001 [1994].\nAlgorithms at Curlie\nWeisstein, Eric W. \"Algorithm\". MathWorld.\nDictionary of Algorithms and Data Structures – National Institute of Standards and TechnologyAlgorithm repositoriesThe Stony Brook Algorithm Repository – State University of New York at Stony Brook\nCollected Algorithms of the ACM – Associations for Computing Machinery\nThe Stanford GraphBase Archived December 6, 2015, at the Wayback Machine – Stanford University",
    "Amenhotep III (Ancient Egyptian: jmn-ḥtp(.w)/Amānəḥūtpū, IPA: [ʔaˌmaːnəʔˈħutpu]; \"Amun is Satisfied\"), also known as Amenhotep the Magnificent or Amenhotep the Great and Hellenized as Amenophis III, was the ninth pharaoh of the Eighteenth Dynasty. According to different authors, he ruled Egypt from June 1386 to 1349 BC, or from June 1388 BC to December 1351 BC/1350 BC, after his father Thutmose IV died. Amenhotep was Thutmose's son by a minor wife, Mutemwiya.His reign was a period of unprecedented prosperity and splendour, when Egypt reached the peak of its artistic and international power, and as such is considered one of ancient Egypt's greatest pharaohs.When he died in the 38th or 39th year of his reign he was succeeded by his son Amenhotep IV, who later changed his name to Akhenaten.\n\n\n== Family and early life ==\nAmenhotep was the son of Thutmose IV and his minor wife Mutemwiya. He was born probably around 1401 BC. Later in his life, Amenhotep commissioned the depiction of his divine birth to be displayed at Luxor Temple. Amenhotep claimed that his true father was the god Amun, who had taken the form of Thutmose IV to father a child with Mutemwiya.\nIn Regnal Year 2, Amenhotep married Tiye, the daughter of Yuya and Thuya. Tiye was Great Royal Wife throughout Amenhotep's reign. Many commemorative scarabs were commissioned and distributed during Amenhotep's reign. On the \"marriage scarabs,\" Amenhotep affirmed his divine power and the legitimacy of his wife. With Tiye, Amenhotep fathered at least two sons, Crown Prince Thutmose and Amenhotep IV (later called Akhenaten). In addition, several daughters are frequently credited to the couple: Sitamun, Henuttaneb, Iset, Nebetah, and Beketaten. Most of the daughters appear frequently on statues and reliefs from Amenhotep's reign. However, Nebetah is attested only once, on a colossal limestone group of statues from Medinet Habu, and Beketaten only appears in Amarna.Amenhotep is also sometimes credited as the father of Smenkhkare or Tutankhamun, with varying proposals for their mothers, but these theories are not as accepted as his other, known children.\nIn addition to Tiye, Amenhotep had several other wives. In Regnal Year 10, Amenhotep married Gilukhepa, the daughter of Shuttarna II of Mitanni. He later married Tadukhepa, daughter of Tushratta of Mitanni, in or around Regnal Year 36 of his reign. Other wives, whose names are unknown, included: a daughter of Kurigalzu, king of Babylon; a daughter of Kadashman-Enlil, king of Babylon; a daughter of Tarhundaradu, ruler of Arzawa; and a daughter of the ruler of Ammia (modern-day Syria).Finally, he married at least two of his daughters, Sitamun and Iset, in the last decade of his reign. Jar-label inscriptions from Regnal Year 30 indicate that Sitamun was elevated to the status of Great Royal Wife by that time. Although shunned by common Egyptians, incest was not uncommon among royalty. A sculpture restored by Amenhotep for his grandfather, Amenhotep II, shows Sitamun with a young prince beside her. This has led to theories that Sitamun was the mother of Smekhkare and/or Tutankhamun.\n\n\n== Life and reign ==\nAmenhotep probably became pharaoh when he was between the ages of 6 and 12. While it is likely that a regent would have ruled until he came of age, none is attested in the surviving records. In Regnal Year 11, Amenhotep commanded the construction of an artificial lake at Tiye's hometown of Djakaru. He then celebrated a Festival of Opening the Lake in the third month of Inundation, day sixteen, and rowed the royal barge Aten-tjehen on the lake. This event was commemorated on at least eleven commemorative scarabs.From other scarabs, Amenhotep is known to have killed either 102 or 110 lions in the first ten years of his reign.Despite the martial prowess Amenhotep displayed during the hunt, he is known to have participated in only one military incident. In Regnal Year Five, he led a victorious campaign against a rebellion in Kush. This victory was commemorated by three rock-carved stelae found near Aswan and Saï in Nubia. The official account of Amenhotep's military victory emphasizes his martial prowess with the hyperbole typical of the period.\n\n\n=== Court of Amenhotep III ===\nThere is a significant attestation for the court officials who served during Amenhotep's reign, primarily through the discovery of their tombs in the Theban Necropolis. Among these court officials were the viziers Ramose, Amenhotep, Aperel, and Ptahmose. Other officials included the treasurers Ptahmose and Merire; the high stewards, Amenemhat Surer and Amenhotep (Huy); and the Viceroy of Kush, Merimose.\nAmenhotep, son of Hapu held many offices during the reign of Amenhotep the pharaoh, but is best known for receiving the right to build his mortuary temple behind that of the king. Amenhotep, son of Hapu, was deified after his death and was one of the few non-royals to be worshiped in such a manner.\n\n\n=== Malkata Palace ===\nThe palace of Malkata was built in the 14th century BC and its ancient name was Per-Hay, \"House of Rejoicing\". Originally, the palace was known as the Palace of the Dazzling Aten. Built mostly out of mud-brick, it was Amenhotep's residence throughout most of the later part of his reign. Construction began around Regnal Year 11 and continued until the king moved to the palace permanently around Regnal Year 29. Once completed, it was the largest royal residence in Egypt.\n\n\n=== Sed festivals ===\nAmenhotep celebrated three Sed festivals in Regnal Years 30, 34, and 37, each at Malkata palace in Western Thebes.  A temple of Amun and festival hall were built especially for the celebrations. The Sed festival was a tradition that dated to the Old Kingdom, consisting of a series of tests that demonstrated the pharaoh's fitness for continuing as ruler of Egypt. Based on indications left by Queen Tiye's steward Khenruef, the festival may have lasted two to eight months.Amenhotep wanted his Sed Festivals to be far more spectacular than those of the past. He appointed Amenhotep, son of Hapu to plan the ceremony, potentially because he was one of the few courtiers still alive to have served at the last Sed Festival, held for Amenhotep II. In preparation for the first Sed Festival, Amenhotep, son of Hapu enlisted scribes to gather information from records and inscriptions, most found in ancient funerary temples, describing the appropriate rituals and costumes.\nTemples were built and statues erected up and down the Nile. Craftsmen and jewelers created ornaments commentating the event including jewelry, ornaments, and stelae. The scribe Nebmerutef coordinated every step of the event. He directed Amenhotep to use his mace to knock on the temple doors. Beside him, Amenhotep-Hapu mirrored his effort like a royal shadow. The king was followed by Queen Tiye and the royal daughters. When moving to another venue, the banner of the jackal god Wepwawet, \"Opener of Ways\" preceded the King. The king changed his costume at each major activity of the celebration.One of the major highlights of the festival was the king's dual coronation. He was enthroned separately for Upper and Lower Egypt. For Upper Egypt, Amenhotep wore the white crown but changed to the red crown for the Lower Egypt coronation.After the Sed festival, Amenhotep transcended from being a near-god to one divine. The king may have later traveled across Egypt following the festival, potentially reenacting the ceremony for different audiences. Few Egyptian kings lived long enough for their own celebration. Those who survived used the celebration as the affirmation of transition to divinity.\n\n\n=== International relations ===\nDiplomatic correspondence from Amenhotep's reign are partially preserved in the Amarna Letters, a collection of documents found near the city of Amarna. The letters come from the rulers of Assyria, Mitanni, Babylon, Hatti, and other states, typically including requests by those rulers for gold and other gifts from Amenhotep. The letters cover the period from Year 30 of Amenhotep until at least the end of Akhenaten's reign. In Amarna Letter EA 4, Amenhotep is quoted by the Babylonian king Kadashman-Enlil I in firmly rejecting the latter's entreaty to marry one of this pharaoh's daughters:\n\nFrom time immemorial, no daughter of the king of Egy[pt] is given to anyone.\nAmenhotep's refusal to allow one of his daughters to be married to the Babylonian monarch may indeed have followed from Egyptian royal custom, which allowed a claim upon the throne through descent from a royal princess. It could also be viewed as a diplomatic stratagem to enhance Egypt's prestige, as Amenhotep himself married the daughters of several foreign rulers while refusing them his own daughters.\nThe Amarna Letters also reference the exchange between Amenhotep and the Mitanni King Tushratta of the statue of a healing goddess, Ishtar of Nineveh, late in Amenhotep's reign. Scholars have generally assumed that the statue's sojourn to Egypt was requested by Amenhotep in order to cure him of his various ailments, which included painful abscesses in his teeth. However, William L. Moran's analysis of Amarna Letter EA 23, relating to the dispatch of the statue to Thebes, discounts this theory.\nThe arrival of the statue is known to have coincided with Amenhotep's marriage with Tadukhepa, Tushratta's daughter, in the pharaoh's 36th year; letter EA 23's arrival in Egypt is dated to \"regnal year 36, the fourth month of winter, day 1\" of his reign. Furthermore, Tushratta never mentions in EA 23 that the statue's dispatch was meant to heal Amenhotep of his maladies. Instead, Tushratta writes in part:\n\n... Thus Šauška of Nineveh, mistress of all lands: \"I wish to go to Egypt, a country that I love, and then return.\" Now I herewith send her, and she is on her way. Now, in the time, too, of my father,...[she] went to this country, and just as earlier she dwelt there and they honored her, may my brother now honor her 10 times more than before. May my brother honor her, [then] at [his] pleasure let her go so that she may come back. May Šauška (i.e., Ishtar), the mistress of heaven, protect us, my brother and me, a 100,000 years, and may our mistress grant both of us great joy. And let us act as friends. Is Šauška for me alone my god[dess], and for my brother not his god[dess]?\nThe likeliest explanation is that the statue was sent to Egypt \"to shed her blessings on the wedding of Amenhotep and Tadukhepa, as she had been sent previously for Amenhotep and Gilukhepa.\" Moran agrees that this explanation was more likely. Further, Moran argues that the contents of Amarna Letter EA 21 support this claim, wherein Tushratta asks the gods, including Ishtar, for their blessing of the marriage.\nIn the 14th century BCE, the pharaoh sent an expedition to Cyprus to establish Egyptian control over the island, which was subsequently maintained for several centuries. During this time, the Egyptians established a number of settlements on the island, and they exported copper and other raw materials from Cyprus to Egypt in exchange for luxury goods and other commodities. However, the Egyptian presence on Cyprus was at times interrupted by incursions of other powers, including the Hittites and the Mycenaeans.\n\n\n== Succession ==\nThutmose, the eldest son of Amenhotep III with his wife Tiye, became Crown Prince, but died before his father. Amenhotep was ultimately succeeded by his second son, who ascended the throne as Amenhotep IV and later took the name Akhenaten.\n\n\n=== Proposed coregency with Amenhotep IV / Akhenaten ===\nIt has long been theorized that Amenhotep III shared a coregency with his son Amenhotep IV. Lawrence Berman has claimed that proponents of the coregency theory tended to be art historians, while historians remained unconvinced.Eric Cline, Nicholas Reeves, Peter Dorman, and other scholars argue strongly against the establishment of a long coregency between the two rulers and in favor of either no coregency or one of at most two years. Donald B. Redford, William J. Murnane, Alan Gardiner, and Lawrence Berman contest the view of any coregency whatsoever between Akhenaten and his father.\nEvidence against a coregency includes Amarna Letter EA 27, which is dated to Regnal Year 2 of Amenhotep IV. The subject of the letter involves a complaint from the Mitannian king Tushratta, claiming that Amenhotep IV did not honor his father's promise to send Tushratta gold statues as part of the marriage arrangement between Tadukhepa, and Amenhotep III. This correspondence implies that if any coregency occurred between Amenhotep and Akhenaten, it lasted no more than a year.However in February 2014, Egyptian Ministry of Antiquities announced that findings from the tomb of Vizier Amenhotep-Huy gave \"conclusive evidence\" of a coregency that lasted at least eight years. In the tomb, the cartouches of the two pharaohs were carved side by side. However, this conclusion has since been called into question by other egyptologists, according to whom the inscription means only that construction on Amenhotep-Huy's tomb started during Amenhotep III's reign and ended under Akhenaten's, and Amenhotep-Huy thus simply wanted to pay his respects to both rulers, carving their names separately rather than simultaneously.\n\n\n== Later life ==\n\n\n=== Health and death ===\nAmenhotep's greatest attested regnal date is Year 38, which appears on wine jar-label dockets from Malkata. He may have lived briefly into an unrecorded Year 39 and died before the wine harvest of that year. Reliefs from the wall of the temple of Soleb in Nubia and scenes from the Theban tomb of Kheruef, Steward of the King's Great Wife, Tiye, depict Amenhotep as a visibly weak and sick figure. Scientists believe that in his final years he suffered from arthritis and obesity. Further, a forensic examination of his mummy revealed worn and cavity-pitted teeth which must have inflicted constant pain. An examination of the mummy by the Australian anatomist Grafton Elliot Smith concluded that the pharaoh had died at between the age of 40 and 50.He was survived by at least one child, his successor Amenhotep IV. His wife Tiye is known to have outlived him by at least twelve years, as she is mentioned in several Amarna letters dated from her son's reign, as well as depicted at the royal dinner table in Akhenaten's years 9 and 12, in scenes from the tomb of Huya.Foreign leaders communicated their grief at the pharaoh's death, with Tushratta saying:\n\nWhen I heard that my brother Nimmureya had gone to his fate, on that day I sat down and wept. On that day I took no food, I took no water.Amenhotep was buried in the Western Valley of the Valley of the Kings, in Tomb WV22. Sometime during the Third Intermediate Period, his mummy was moved over to a side chamber of KV35 along with several other pharaohs of the Eighteenth and Nineteenth Dynasties, where it lay until discovered by Victor Loret in 1898.\n\n\n=== Mummy and burial ===\nFor the 18th dynasty, the mummy shows an unusually heavy use of subcutaneous stuffing to make the mummy look more lifelike. Amenhotep was buried in the Valley of the Kings outside of Thebes, in the tomb labeled WV 22. The tomb is the largest in the West Valley of the Kings and includes two side chambers for his Great Royal Wives, Tiye and Sitamun. However, it does not seem as if either woman was buried there. Amenhotep's mummy was later moved to the mummy cache in KV35, during the reign of Smendes.\nThe mummy has museum inventory number CG 61074.In 1980, James Harris and Edward F. Wente conducted X-ray examinations of New Kingdom Pharaohs' crania and skeletal remains, including Amenhotep III's. The authors found a strong physical similarities between the rulers of the 18th Dynasty and contemporary Nubians.In April 2021, his mummy was moved from the Museum of Egyptian Antiquities to the National Museum of Egyptian Civilization, along with those of 17 other kings and 4 queens in an event termed the Pharaohs' Golden Parade.\n\n\n== Monuments and legacy ==\nAmenhotep has the distinction of having the most surviving statues of any Egyptian pharaoh, with over 250  identified. These statues provide a series of portraits covering the entire length of his reign.\nWhen Amenhotep died, he left behind a country at the very height of its power and influence, commanding immense respect in the international world. However, it was a country wedded to age-old political and religious certainties under the Amun priesthood.The resulting upheavals from his son Akhenaten's reforming zeal shook these old certainties to their foundations, and forced the momentous question whether a pharaoh was more powerful than his society as represented in the worship of Amun. Akhenaten even moved the capital away from Thebes, the center of Amun's worship, and built Amarna, a city dedicated to his new deity, the Aten.Amenhotep built extensively at the temple of Karnak, including the Luxor temple with two pylons, a colonnade behind the new temple entrance, and a new temple to the goddess Ma'at. Amenhotep dismantled the Fourth Pylon of the Temple of Amun at Karnak to construct a new Third Pylon — and created a new entrance to this structure where he erected two rows of columns with open papyrus capitals down the centre of this newly formed forecourt. The forecourt between the Third and Fourth Pylons, sometimes called an obelisk court, was also decorated with scenes of the sacred funerary barques of the deities Amun, Mut, and Khonsu. The king also started work on the Tenth Pylon at the Temple of Amun. Amenhotep's first recorded act as king — in his Years 1 and 2 — was to open new limestone quarries at Tura, just south of Cairo and at Dayr al-Barsha in Middle Egypt to undertake his great building projects. He virtually covered Nubia with new monuments:\n\n...including a small temple with a colonnade (dedicated to Thutmose III) at Elephantine, a rock temple dedicated to Amun \"Lord of the Ways\" at Wadi es-Sebuam, and the temple of Horus of Miam at Aniba...[as well as founding] additional temples at Kawa and Sesebi.\nHis enormous mortuary temple on the west bank of the Nile was, in its day, the largest religious complex in Thebes, but the king built too close to the floodplain, and less than two hundred years later it was reduced to ruins. Much of the masonry was purloined by Merneptah and later pharaohs for their own construction projects. All that remained standing was the gateway with the Colossi of Memnon — two massive stone statues depicting Amenhotep,18 m (59 ft) high. Amenhotep also built the Third Pylon at Karnak and erected 600 statues of the goddess Sekhmet in the Temple of Mut to the south. Some of the most magnificent statues of New Kingdom Egypt date to his reign \"such as the two outstanding couchant rose granite lions originally set before the temple at Soleb in Nubia\" as well as a large series of royal sculptures. Several black granite seated statues of Amenhotep wearing the nemes headress have come from excavations behind the Colossi of Memnon as well as from Tanis in the Delta. In 2014, two giant statues of Amenhotep toppled by an earthquake in 1200 BC were reconstructed from more than 200 fragments and re-erected at the northern gate of the king's funerary temple.One of the most stunning finds of royal statues dating to his reign was made as recently as 1989 in the courtyard of Amenhotep 's colonnade of the Temple of Luxor. The cache of statues included a nearly undamaged 6 feet (1.8 m)-high pink quartzite statue of the king wearing the Double Crown. It was mounted on a sled, and may have been a cult statue. Only the name of the god Amun had been hacked out wherever it appeared in the pharaoh's cartouche, clearly part of Akhenaten's campaign against the god of his father.\nOne of Amenhotep's most popular epithets was Aten-tjehen which means \"the Dazzling Sun Disk\"; it appears in his titulary at Luxor temple and was frequently used as the name for one of his palaces, and for the Year 11 royal barge, as well as for a company of Amenhotep's army.In 2021, excavations revealed a settlement near Amenhotep's mortuary temple, called the Dazzling Aten, believed to have been built by king to house craftsmen and labourers working on royal projects at Thebes, along with its own bakery and cemetery.\nA Sed Festival Stela of Amenhotep III was taken from Egypt to Europe by an art dealer. Once owned by Eric Cassirer, it is now believed to be in a private collection in the United States. The white alabaster stela is 10 × 9 cm (3.94 × 3.54 in), but only its upper half survived. Front view: The god Heh, representing the number one million, holds notched palm leaves signifying years and the cartouche of Amenhotep, symbolically raising the pharoah for a million years. Side view: A series of festival (ḥb) emblems together with a Sed (sd) emblem identifying the stela as one made for Amenhotep 's Sed Festival royal jubilee. Top and back view: These show malicious damage where the cartouche was chipped away. Cassirer suggests this was another example of Akhenaten's vandalism against Amun Other gods displayed on the stela, Re and Ma’at, showed no damage. The altered stela may then have been displayed by Akhenaten.\nAnother striking characteristic of Amenhotep's reign is the series of over 200 large commemorative stone scarabs that have been discovered over a large geographic area ranging from Syria (Ras Shamra) through to Soleb in Nubia. Similarly, five other scarabs state that his wife Gilukhepa of Mitanni arrived in Egypt with a retinue of 317 women. She was the first of many such princesses who would enter the pharaoh's family.\n\n\n== Ancestry and Genetics ==\n\nGenetic analysis has confirmed that Amenhotep III is the father of both the KV55 mummy, identified in the study as Akhenaten, and \"The Younger Lady\", sibling parents of his grandson, Tutankhamun. A more recent study, published in 2020, traced the family lineage via Y-chromosomes and mtDNA. Although only a partial profile was obtained, he shares his YDNA haplogroup, R1b, with his son and grandson, upholding the family tree outlined in the earlier study. However, the specific clade of R1b was not determined. The mitochondrial haplogroup of Amenhotep III was found to be H2b, which is associated with migrations from the Pontic-Caspian steppe to South Asia and the spread of Indo-Iranian languages.In 2022, S.O.Y. Keita analysed 8 Short Tandem loci (STR) published data from studies by Hawass et al. 2010;2012 which sought to determine familial relations and research pathological features such as potential infectious diseases among the New Kingdom royal mummies, including Tutankhamun, Amenhotep III, and Rameses III. Keita used the Popaffiliator algorithm which differentiates Eurasians, Sub-Saharan Africans, and East Asians; he concluded that “a majority [have] an affinity with 'Sub-Saharan' Africans in one affinity analysis”. However, he emphasized the complexity of ethnic attributions, cautioning that the royal mummies may have had other affiliations obscured by the typological categories, and that different “data and algorithms might give different results”.According to historian William Stiebling and archaeologist Susan N. Helft, conflicting DNA analyses by different research teams have thusfar failed to establish consensus on the genetic makeup of the ancient Egyptians and their geographic origins.\n\n\n== Gallery ==\n\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== See also ==\n\nColossal red granite statue of Amenhotep III\nColossal quartzite statue of Amenhotep III\nHistory of ancient Egypt\nEighteenth dynasty of Egypt Family Tree\nList of pharaohs\nQuay with Sphinxes\nThe lion hunts of Amenhotep III during the first ten years of his reign\n\n\n== Footnotes ==\n\n\n== Bibliography ==",
    "American football (referred to simply as football in the United States and Canada), also known as gridiron football, is a team sport played by two teams of eleven players on a rectangular field with goalposts at each end. The offense, the team with possession of the oval-shaped football, attempts to advance down the field by running with the ball or passing it, while the defense, the team without possession of the ball, aims to stop the offense's advance and to take control of the ball for themselves. The offense must advance at least ten yards in four downs or plays; if they fail, they turn over the football to the defense, but if they succeed, they are given a new set of four downs to continue the drive. Points are scored primarily by advancing the ball into the opposing team's end zone for a touchdown or kicking the ball through the opponent's goalposts for a field goal. The team with the most points at the end of a game wins.\nAmerican football evolved in the United States, originating from the sports of soccer and rugby. The first American football match was played on November 6, 1869, between two college teams, Rutgers and Princeton, using rules based on the rules of soccer at the time. A set of rule changes drawn up from 1880 onward by Walter Camp, the \"Father of American Football\", established the snap, the line of scrimmage, eleven-player teams, and the concept of downs. Later rule changes legalized the forward pass, created the neutral zone, and specified the size and shape of the football. The sport is closely related to Canadian football, which evolved in parallel with and at the same time as the American game, although its rules were developed independently from those of Camp. Most of the features that distinguish American football from rugby and soccer are also present in Canadian football. The two sports are considered the primary variants of gridiron football.\nAmerican football is the most popular sport in the United States in terms of broadcast viewership audience. The most popular forms of the game are professional and college football, with the other major levels being high-school and youth football. As of 2022, nearly 1.04 million high-school athletes play the sport in the U.S., with another 81,000 college athletes in the NCAA and the NAIA.The National Football League, the most popular American professional football league, has the highest average attendance of any professional sports league in the world. Its championship game, the Super Bowl, ranks among the most-watched club sporting events in the world. In 2022, the league had an annual revenue of around $18.6 billion, making it the most valuable sports league in the world. Other professional and amateur leagues exist worldwide, but the sport does not have the international popularity of other American sports like baseball or basketball; the sport maintains a following in Mexico, Brazil, Canada, Europe, and Japan.\n\n\n== Etymology and names ==\n\nIn the United States, American football is referred to as \"football\". The term \"football\" was officially established in the rulebook for the 1876 college football season, when the sport first shifted from soccer-style rules to rugby-style rules. Although it could easily have been called \"rugby\" at this point, Harvard, one of the primary proponents of the rugby-style game, compromised and did not request the name of the sport be changed to \"rugby\". The terms \"gridiron\" or \"American football\" are favored in English-speaking countries where other types of football are popular, such as the United Kingdom, Ireland, New Zealand, and Australia.\n\n\n== History ==\n\n\n=== Early history ===\nAmerican football evolved from the sports of rugby and soccer. Rugby, like American football, is a sport in which two competing teams vie for control of a ball, which can be kicked through a set of goalposts or run into the opponent's goal area to score points.What is considered to be the first American football game was played on November 6, 1869, between Rutgers and Princeton, two college teams. They consisted of 25 players per team and used a round ball that could not be picked up or carried. It could, however, be kicked or batted with the feet, hands, head, or sides, with the objective being to advance it into the opponent's goal. Rutgers won the game 6–4. Collegiate play continued for several years with matches played using the rules of the host school. Representatives of Yale, Columbia, Princeton and Rutgers met on October 19, 1873, to create a standard set of rules for use by all schools. Teams were set at 20 players each, and fields of 400 by 250 feet (122 m × 76 m) were specified. Harvard abstained from the conference, as they favored a rugby-style game that allowed running with the ball. After playing McGill University using both American (known as \"the Boston game\") for the first game and Canadian (rugby) rules for the second one, the Harvard players preferred the Canadian style of having only 11 men on the field, running the ball without having to be chased by an opponent, the forward pass, tackling, and using an oblong instead of a round ball.An 1875 Harvard–Yale game played under rugby-style rules was observed by two Princeton athletes who were impressed by it. They introduced the sport to Princeton, a feat the Professional Football Researchers Association compared to \"selling refrigerators to Eskimos\". Princeton, Harvard, Yale, and Columbia then agreed to intercollegiate play using a form of rugby union rules with a modified scoring system. These schools formed the Intercollegiate Football Association, although Yale did not join until 1879. Yale player Walter Camp, now regarded as the \"Father of American Football\", secured rule changes in 1880 that reduced the size of each team from 15 to 11 players and instituted the snap to replace the chaotic and inconsistent scrum. While the game between Rutgers and Princeton is commonly considered the first American football game, several years prior in 1862, the Oneida Football Club formed as the oldest known football club in the United States. The team consisted of graduates of Boston's elite preparatory schools and played from 1862 to 1865.\n\n\n=== Evolution of the game ===\nThe introduction of the snap resulted in an unexpected consequence. Before the snap, the strategy had been to punt if a scrum resulted in bad field position. However, a group of Princeton players realized that, as the snap was uncontested, they could now hold the ball indefinitely to prevent their opponent from scoring. In 1881, in a game between Yale and Princeton, both teams used this strategy to maintain their undefeated records. Each team held the ball, gaining no ground, for an entire half, resulting in a 0–0 tie. This \"block game\" proved extremely unpopular with both teams' spectators and fans.A rule change was necessary to prevent this strategy from taking hold, and a reversion to the scrum was considered. However, Camp successfully proposed a rule in 1882 that limited each team to three downs, or tackles, to advance the ball 5 yards (4.6 m). Failure to advance the ball the required distance within those three downs would result in control of the ball being forfeited to the other team. This change effectively made American football a separate sport from rugby, and the resulting five-yard lines added to the field to measure distances made it resemble a gridiron in appearance. Other major rule changes included a reduction of the field size to 110 by 53+1⁄3 yards (100.6 m × 48.8 m) and the adoption of a scoring system that awarded four points for a touchdown, two for a safety and a goal following a touchdown, and five for a goal from the field. Additionally, tackling below the waist was legalized, and a static line of scrimmage was instituted.Despite these new rules, football remained a violent sport. Dangerous mass-formations like the flying wedge resulted in serious injuries and deaths. A 1905 peak of 19 fatalities nationwide resulted in a threat by President Theodore Roosevelt to abolish the game unless major changes were made. In response, 62 colleges and universities met in New York City to discuss rule changes on December 28, 1905. These proceedings resulted in the formation of the Intercollegiate Athletic Association of the United States, later renamed the National Collegiate Athletic Association (NCAA).The legal forward pass was introduced in 1906, although its effect was initially minimal due to the restrictions placed on its use. The idea of a 40-yard-wider field was opposed by Harvard due to the size of the new Harvard Stadium. Other rule changes introduced that year included the reduction of playing time from 70 to 60 minutes and an increase of the distance required for a first down from 5 to 10 yards (4.6 to 9.1 m). To reduce infighting and dirty play between teams, the neutral zone was created along the width of the football before the snap. Scoring was also adjusted: points awarded for field goals were reduced to three in 1909 and points for touchdowns were raised to six in 1912. Also in 1912, the field was shortened to 100 yards (91 m) long, two 10-yard-long (9.1 m) end zones were created, and teams were given four downs instead of three to advance the ball 10 yards (9.1 m). The roughing the passer penalty was implemented in 1914, and eligible players were first allowed to catch the ball anywhere on the field in 1918.\n\n\n=== Professional era ===\nOn November 12, 1892, Pudge Heffelfinger was paid $500 (equivalent to $16,285 in 2022) to play a game for the Allegheny Athletic Association in a match against the Pittsburgh Athletic Club. This is the first recorded instance of a player being paid to participate in a game of American football, although many athletic clubs in the 1880s offered indirect benefits, such as helping players attain employment, giving out trophies or watches that players could pawn for money, or paying double in expense money. Despite these extra benefits, the game had a strict sense of amateurism at the time, and direct payment to players was frowned upon, if not prohibited outright.Over time, professional play became increasingly common, and with it came rising salaries and unpredictable player movement, as well as the illegal payment of college players who were still in school. The National Football League (NFL), a group of professional teams that was originally established in 1920 as the American Professional Football Association, aimed to solve these problems. This new league's stated goals included an end to bidding wars over players, prevention of the use of college players, and abolition of the practice of paying players to leave another team. By 1922, the NFL had established itself as America's premier professional football league.The dominant form of football at the time was played at the collegiate level. The upstart NFL received a boost to its legitimacy in 1925, however, when an NFL team, the Pottsville Maroons, defeated a team of Notre Dame all-stars in an exhibition game. A greater emphasis on the passing game helped professional football to distinguish itself further from the college game during the late 1930s. Football, in general, became increasingly popular following the 1958 NFL Championship game, a match between the Baltimore Colts and the New York Giants that is still referred to as the \"Greatest Game Ever Played\". The game, a 23–17 overtime victory by the Colts, was seen by millions of television viewers and had a major influence on the popularity of the sport. This, along with the innovations introduced by the new American Football League (AFL) in the early 1960s, helped football to become the most popular sport in the United States by the mid-1960s.The rival AFL arose in 1960 and challenged the NFL's dominance. The AFL began in relative obscurity but eventually thrived, with an initial television contract with the ABC television network. The AFL's existence forced the conservative NFL to expand to Dallas and Minnesota in an attempt to destroy the new league. Meanwhile, the AFL introduced many new features to professional football in the United States: official time was kept on a scoreboard clock rather than on a watch in the referee's pocket, as the NFL did; optional two-point conversions by pass or run after touchdowns; names on the jerseys of players; and several others, including expansion of the role of minority players, actively recruited by the league in contrast to the NFL. The AFL also signed several star college players who had also been drafted by NFL teams. Competition for players heated up in 1965, when the AFL New York Jets signed rookie Joe Namath to a then-record $437,000 contract (equivalent to $3.11 million in 2022). A five-year, $40 million  NBC television contract followed, which helped to sustain the young league. The bidding war for players ended in 1966 when NFL owners approached the AFL regarding a merger, and the two leagues agreed on one that took full effect in 1970. This agreement provided for a common draft that would take place each year, and it instituted an annual World Championship game to be played between the champions of each league. This championship game began play at the end of the 1966 season. Once the merger was completed, it was no longer a championship game between two leagues and reverted to the NFL championship game, which came to be known as the Super Bowl.College football maintained a tradition of postseason bowl games. Each bowl game was associated with a particular conference and earning a spot in a bowl game was the reward for winning a conference. This arrangement was profitable, but it tended to prevent the two top-ranked teams from meeting in a true national championship game, as they would normally be committed to the bowl games of their respective conferences. Several systems have been used since 1992 to determine a national champion of college football. The first was the Bowl Coalition, in place from 1992 to 1994. This was replaced in 1995 by the Bowl Alliance, which gave way in 1997 to the Bowl Championship Series (BCS). The BCS arrangement proved to be controversial, and was replaced in 2014 by the College Football Playoff (CFP).\n\n\n== Teams and positions ==\n\nA football game is played between two teams of 11 players each. Playing with more on the field is punishable by a penalty. Teams may substitute any number of their players between downs; this \"platoon\" system replaced the original system, which featured limited substitution rules, and has resulted in teams utilizing specialized offensive, defensive and special teams units.Individual players in a football game must be designated with a uniform number between 1 and 99, though some teams may \"retire\" certain numbers, making them unavailable to players. NFL teams are required to number their players by a league-approved numbering system, and any exceptions must be approved by the commissioner. NCAA and NFHS teams are \"strongly advised\" to number their offensive players according to a league-suggested numbering scheme.Although the sport is played almost exclusively by men, women are eligible to play in high school, college, and professional football. No woman has ever played in the NFL, but women have played in high school and college football games. In 2018, 1,100 of the 225,000 players in Pop Warner Little Scholars youth football were girls, and around 11% of the 5.5 million Americans who report playing tackle football are female according to the Sports and Fitness Industry Association. Women can also serve as officials; Sarah Thomas became the NFL's first female official in 2015.\n\n\n=== Offensive unit ===\nThe role of the offensive unit is to advance the football down the field with the ultimate goal of scoring a touchdown.The offensive team must line up in a legal formation before they can snap the ball. An offensive formation is considered illegal if there are more than four players in the backfield or fewer than five players numbered 50–79 on the offensive line. Players can line up temporarily in a position whose eligibility is different from what their number permits as long as they report the change immediately to the referee, who then informs the defensive team of the change. Neither team's players, except the center (C), are allowed to line up in or cross the neutral zone until the ball is snapped. Interior offensive linemen are not allowed to move until the snap of the ball.The main backfield positions are the quarterback (QB), halfback/tailback (HB/TB), and fullback (FB). The quarterback is the leader of the offense. Either the quarterback or a coach calls the plays. Quarterbacks typically inform the rest of the offense of the play in the huddle before the team lines up. The quarterback lines up behind the center to take the snap and then hands the ball off, throws it, or runs with it.The primary role of the halfback, also known as the running back or tailback, is to carry the ball on running plays. Halfbacks may also serve as receivers. Fullbacks tend to be larger than halfbacks and function primarily as blockers, but they are sometimes used as runners in short-yardage or goal-line situations. They are seldom used as receivers.The offensive line (OL) consists of several players whose primary function is to block members of the defensive line from tackling the ball carrier on running plays or sacking the quarterback on passing plays. The leader of the offensive line is the center, who is responsible for snapping the ball to the quarterback, blocking, and for making sure that the other linemen do their jobs during the play. On either side of the center are the guards (G), while tackles (T) line up outside the guards.\nThe principal receivers are the wide receivers (WR) and the tight ends (TE). Wide receivers line up on or near the line of scrimmage, split outside the line. The main goal of the wide receiver is to catch passes thrown by the quarterback, but they may also function as decoys or as blockers during running plays. Tight ends line up outside the tackles and function both as receivers and as blockers.\n\n\n=== Defensive unit ===\nThe role of the defense is to prevent the offense from scoring by tackling the ball carrier or by forcing turnovers (interceptions or fumbles).The defensive line (DL) consists of defensive ends (DE) and defensive tackles (DT). Defensive ends line up on the ends of the line, while defensive tackles line up inside, between the defensive ends. The primary responsibilities of defensive ends and defensive tackles are to stop running plays on the outside and inside, respectively, to pressure the quarterback on passing plays, and to occupy the line so that the linebackers can break through.Linebackers line up behind the defensive line but in front of the defensive backfield. They are divided into two types: middle linebackers (MLB) and outside linebackers (OLB). Linebackers tend to serve as the defensive leaders and call the defensive plays, given their vantage point of the offensive backfield. Their roles include defending the run, pressuring the quarterback, and tackling backs, wide receivers, and tight ends in the passing game.The defensive backfield, often called the secondary, consists of cornerbacks (CB) and safeties (S). Safeties are themselves divided into free safeties (FS) and strong safeties (SS). Cornerbacks line up outside the defensive formation, typically opposite a receiver to be able to cover them. Safeties line up between the cornerbacks but farther back in the secondary. Safeties tend to be viewed as \"the last line of defense\" and are responsible for stopping deep passing plays as well as breakout running plays.\n\n\n=== Special teams unit ===\nThe special teams unit is responsible for all kicking plays. The special teams unit of the team in control of the ball tries to execute field goal (FG) attempts, punts, and kickoffs, while the opposing team's unit will aim to block or return them.Three positions are specific to the field goal and PAT (point-after-touchdown) unit: the placekicker (K or PK), holder (H), and long snapper (LS). The long snapper's job is to snap the football to the holder, who will catch and position it for the placekicker. There is not usually a holder on kickoffs, because the ball is kicked off a tee; however, a holder may be used in certain situations, such as if wind is preventing the ball from remaining upright on the tee. The player on the receiving team who catches the ball is known as the kickoff returner (KR).The positions specific to punt plays are the punter (P), long snapper, upback, and gunner. The long snapper snaps the football directly to the punter, who then drops and kicks it before it hits the ground. Gunners line up split outside the line and race down the field, aiming to tackle the punt returner (PR)—the player who catches the punt. Upbacks line up a short distance behind the line of scrimmage, providing additional protection to the punter.\n\n\n== Rules ==\n\n\n=== Scoring ===\nIn football, the winner is the team that has scored more points at the end of the game. There are multiple ways to score in a football game. The touchdown (TD), worth six points, is the most valuable scoring play in American football. A touchdown is scored when a live ball is advanced into, caught, or recovered in the opposing team's end zone. The scoring team then attempts a try or conversion, more commonly known as the point-after-touchdown (PAT), which is a single scoring opportunity. A PAT is generally attempted from the two- or three-yard line, depending on the level of play. If a PAT is scored by a place kick or drop kick through the goal posts, it is worth one point, typically called the extra point. If it is scored by what would normally be a touchdown it is worth two points, typically called the two-point conversion. In general, the extra point is almost always successful, while the two-point conversion is a much riskier play with a higher probability of failure; accordingly, extra point attempts are far more common than two-point conversion attempts.A field goal (FG), worth three points, is scored when the ball is place kicked or drop kicked through the uprights and over the crossbars of the defense's goalposts. After a PAT attempt or successful field goal, the scoring team must kick the ball off to the other team.A safety is scored when the ball carrier is tackled in his own end zone. Safeties are worth two points, which are awarded to the defense. In addition, the team that conceded the safety must kick the ball to the scoring team via a free kick.\n\n\n=== Field and equipment ===\n\nFootball games are played on a rectangular field that measures 120 yards (110 m) long and 53+1⁄3 yards (48.8 m) wide. Lines marked along the ends and sides of the field are known as the end lines and sidelines. Goal lines are marked 10 yards (9.1 m) inward from each end line.Weighted pylons are placed the sidelines on the inside corner of the intersections with the goal lines and end lines. White markings on the field identify the distance from the end zone. Inbound lines, or hash marks, are short parallel lines that mark off 1-yard (0.91 m) increments. Yard lines, which can run the width of the field, are marked every 5 yards (4.6 m). A one-yard-wide line is placed at each end of the field; this line is marked at the center of the two-yard line in professional play and at the three-yard line in college play. Numerals that display the distance from the closest goal line in yards are placed on both sides of the field every ten yards.Goalposts are located at the center of the plane of the two end lines. The crossbar of these posts is 10 feet (3.0 m) above the ground, with vertical uprights at the end of the crossbar 18 feet 6 inches (5.64 m) apart for professional and collegiate play, and 23 feet 4 inches (7.11 m) apart for high school play. The uprights extend vertically 35 feet (11 m) on professional fields, a minimum of 10 yards (9.1 m) on college fields, and a minimum of 10 feet (3.0 m) on high school fields. Goal posts are padded at the base, and orange ribbons are normally placed at the tip of each upright as indicators of wind strength and direction.The football itself is an oval ball, similar to the balls used in rugby or Australian rules football. At all levels of play, the football is inflated to 12+1⁄2 to 13+1⁄2 pounds per square inch (86 to 93 kPa) and weighs 14 to 15 ounces (400 to 430 g); beyond that, the exact dimensions vary slightly. In professional play the ball has a long axis of 11 to 11+1⁄4 inches (28 to 29 cm), a long circumference of 28 to 28+1⁄2 inches (71 to 72 cm), and a short circumference of 21 to 21+1⁄4 inches (53 to 54 cm). In college and high school play the ball has a long axis of 10+7⁄8 to 11+7⁄16 inches (27.6 to 29.1 cm), a long circumference of 27+3⁄4 to 28+1⁄2 inches (70 to 72 cm), and a short circumference of 20+3⁄4 to 21+1⁄4 inches (53 to 54 cm).\n\n\n=== Duration and time stoppages ===\nFootball games last for a total of 60 minutes in professional and college play and are divided into two halves of 30 minutes and four quarters of 15 minutes. High school football games are 48 minutes in length with two halves of 24 minutes and four quarters of 12 minutes. The two halves are separated by a halftime period, and the first and third quarters are followed by a short break. Before the game starts, the referee and each team's captain meet at midfield for a coin toss. The visiting team can call either \"heads\" or \"tails\"; the winner of the toss chooses whether to receive or kick off the ball or which goal they wish to defend. They can defer their choice until the second half. Unless the winning team decides to defer, the losing team chooses the option the winning team did not select—to receive, kick, or select a goal to defend to begin the second half. Most teams choose to receive or defer, because choosing to kick the ball to start the game allows the other team to choose which goal to defend. Teams switch goals following the first and third quarters. If a down is in progress when a quarter ends, play continues until the down is completed.Games last longer than their defined length due to play stoppages—the average NFL game lasts slightly over three hours. Time in a football game is measured by the game clock. An operator is responsible for starting, stopping and operating the game clock based on the direction of the appropriate official. A separate play clock is used to show the amount of time within which the offense must initiate a play. The play clock is set to 25 seconds after certain administrative stoppages in play and to 40 seconds when play is proceeding without such stoppages. If the offense fails to start a play before the play clock reads \"00\", a delay of game foul is called on the offense.\n\n\n=== Advancing the ball and downs ===\nThere are two main ways the offense can advance the ball: running and passing. In a typical play, the center passes the ball backwards and between their legs to the quarterback in a process known as the snap. The quarterback then either hands the ball off to a running back, throws the ball, or runs with it. The play ends when the player with the ball is tackled or goes out-of-bounds or a pass hits the ground without a player having caught it. A forward pass can be legally attempted only if the passer is behind the line of scrimmage; only one forward pass can be attempted per down. As in rugby, players can also pass the ball backwards at any point during a play. In the NFL, a down also ends immediately if the runner's helmet comes off.The offense is given a series of four plays, known as downs. If the offense advances ten or more yards in the four downs, they are awarded a new set of four downs. If they fail to advance ten yards, possession of the football is turned over to the defense. In most situations, if the offense reaches their fourth down they will punt the ball to the other team, which forces them to begin their drive from farther down the field; if they are in field goal range, they might attempt to score a field goal instead. A group of officials, the chain crew, keeps track of both the downs and the distance measurements. On television, a yellow line is electronically superimposed on the field to show the first down line to the viewing audience.\n\n\n=== Kicking ===\nThere are two categories of kicks in football: scrimmage kicks, which can be executed by the offensive team on any down from behind or on the line of scrimmage, and free kicks. The free kicks are the kickoff, which starts the first and third quarters and overtime and follows a try attempt or a successful field goal; the safety kick follows a safety.On a kickoff, the ball is placed at the 35-yard line of the kicking team in professional and college play and at the 40-yard line in high school play. The ball may be drop kicked or place kicked. If a place kick is chosen, the ball can be placed on the ground or a tee; a holder may be used in either case. On a safety kick, the kicking team kicks the ball from their own 20-yard line. They can punt, drop kick or place kick the ball, but a tee may not be used in professional play. Any member of the receiving team may catch or advance the ball. The ball may be recovered by the kicking team once it has gone at least ten yards and has touched the ground or has been touched by any member of the receiving team.The three types of scrimmage kicks are place kicks, drop kicks, and punts. Only place kicks and drop kicks can score points. The place kick is the standard method used to score points, because the pointy shape of the football makes it difficult to reliably drop kick. Once the ball has been kicked from a scrimmage kick, it can be advanced by the kicking team only if it is caught or recovered behind the line of scrimmage. If it is touched or recovered by the kicking team beyond this line, it becomes dead at the spot where it was touched. The kicking team is prohibited from interfering with the receiver's opportunity to catch the ball. The receiving team has the option of signaling for a fair catch, which prohibits the defense from blocking into or tackling the receiver. The play ends as soon as the ball is caught, and the ball may not be advanced.\n\n\n=== Officials and fouls ===\n\nOfficials are responsible for enforcing game rules and monitoring the clock. All officials carry a whistle and wear black-and-white striped shirts and black hats except for the referee, whose hat is white. Each carries a weighted yellow flag that is thrown to the ground to signal that a foul has been called. An official who spots multiple fouls will throw their hat as a secondary signal. The seven officials (of a standard seven-man crew; lower levels of play up to the college level use fewer officials) on the field are each tasked with a different set of responsibilities:\nThe referee is positioned behind and to the side of the offensive backs. The referee is charged with oversight and control of the game and is the authority on the score, the down number, and any rule interpretations in discussions among the other officials. The referee announces all penalties and discusses the infraction with the offending team's captain, monitors for illegal hits against the quarterback, makes requests for first-down measurements, and notifies the head coach whenever a player is ejected. The referee positions themselves to the passing arm side of the quarterback. In most games, the referee is responsible for spotting the football prior to a play from scrimmage.\nThe umpire is positioned in the defensive backfield, except in the NFL, where the umpire is positioned lateral to the referee on the opposite side of the formation. The umpire watches play along the line of scrimmage to make sure that no more than 11 offensive players are on the field before the snap, and that no offensive linemen are illegally downfield on pass plays. The umpire monitors contact between offensive and defensive linemen and calls most of the holding penalties. The umpire records the number of timeouts taken and the winner of the coin toss and game score. They also assist the referee in situations involving possession of the ball close to the line of scrimmage, determines whether player equipment is legal, and dries wet balls prior to the snap if a game is played in rain.\nThe back judge is positioned deep in the defensive backfield, behind the umpire. The back judge ensures that the defensive team has no more than 11 players on the field and determines whether catches are legal, whether field goal or extra point attempts are good, and whether a pass interference violation occurred. The back judge is also responsible for the play clock, the time between each play, when a visible play clock is not used.\nThe head linesman/down judge is positioned on one end of the line of scrimmage. The head linesman/down judge watches for any line-of-scrimmage and illegal use-of-hands violations and assists the line judge with illegal shift or illegal motion calls. The head linesman/down judge also rules on out-of-bounds calls that happen on their side of the field, oversees the chain crew, and marks the forward progress of a runner when a play has been whistled dead.\nThe side judge is positioned twenty yards downfield of the head linesman. The side judge mainly duplicates the functions of the field judge. On field goal and extra point attempts, the side judge is positioned lateral to the umpire.\nThe line judge is positioned on the end of the line of scrimmage, opposite the head linesman. They supervise player substitutions, the line of scrimmage during punts, and game timing. The line judge notifies the referee when time has expired at the end of a quarter and notifies the head coach of the home team when five minutes remain for halftime. In the NFL, the line judge also alerts the referee when two minutes remain in the half. If the clock malfunctions or becomes inoperable, the line judge becomes the official timekeeper.\nThe field judge is positioned twenty yards downfield from the line judge. The field judge monitors and controls the play clock, counts the number of defensive players on the field, and watches for offensive pass interference and illegal use-of-hands violations by offensive players. The field judge also makes decisions regarding catches, recoveries, the ball spot when a player goes out of bounds, and illegal touching of fumbled balls that have crossed the line of scrimmage. On field goal and extra point attempts, the field judge is stationed under the upright opposite the back judge.\nThe center judge is an eighth official used only in the top level of college football. The center judge stands lateral to the referee, the same way the umpire does in the NFL. The center judge is responsible for spotting the football after each play and has many of the same responsibilities as the referee, except announcing penalties.Another set of officials, the chain crew, are responsible for moving the chains. The chains, consisting of two large sticks with a 10-yard-long chain between them, are used to measure for a first down. The chain crew stays on the sidelines during the game, but if requested by the officials they will briefly bring the chains on to the field to measure. A typical chain crew will have at least three people—two members of the chain crew will hold either of the two sticks, while a third will hold the down marker. The down marker, a large stick with a dial on it, is flipped after each play to indicate the current down and is typically moved to the approximate spot of the ball. The chain crew system has been used for over 100 years and is considered an accurate measure of distance, rarely subject to criticism from either side.\n\n\n== Safety and brain health ==\n\nFootball is a full-contact sport, and injuries are relatively common. Most injuries occur during training sessions, particularly ones that involve contact between players. To try to prevent injuries, players are required to wear a set of equipment. At a minimum players must wear a football helmet and a set of shoulder pads, but individual leagues may require additional padding such as thigh pads and guards, knee pads, chest protectors, and mouthguards. Most injuries occur in the lower extremities, particularly in the knee, but a significant number also affect the upper extremities. The most common types of injuries are strains, sprains, bruises, fractures, dislocations, and concussions.Repeated concussions (and possibly sub-concussive head impacts) can increase a person's risk in later life for CTE (chronic traumatic encephalopathy) and mental health issues such as dementia, Parkinson's disease, and depression. Concussions are often caused by helmet-to-helmet or upper-body contact between opposing players, although helmets have prevented more serious injuries such as skull fractures. Various programs are aiming to reduce concussions by reducing the frequency of helmet-to-helmet hits; USA Football's \"Heads Up Football\" program aims to reduce concussions in youth football by teaching coaches and players about the signs of a concussion, the proper way to wear football equipment and ensure it fits, and proper tackling methods that avoid helmet-to-helmet contact. However, a study in the Orthopaedic Journal of Sports Medicine found that Heads Up Football was ineffective; the same study noted that more extensive reforms implemented by Pop Warner Little Scholars and its member teams were effective in significantly reducing concussion rates.A 2018 study performed by the VA Boston Healthcare System and the Boston University School of Medicine found that tackle football before age 12 was correlated with earlier onset of symptoms of CTE, but not with symptom severity. More specifically, each year a player played tackle football under age 12 predicted earlier onset of cognitive, behavioral, and mood problems by an average of two and a half years.\n\n\n== Leagues and tournaments ==\nThe National Football League (NFL) and the National Collegiate Athletic Association (NCAA) are the most popular football leagues in the United States. The National Football League was founded in 1920 and has since become the largest and most popular sport in the United States. The NFL has the highest average attendance of any sporting league in the world, with an average attendance of 66,960 during the 2011 NFL season. The NFL championship game is called the Super Bowl, and is among the biggest events in club sports worldwide. It is played between the champions of the National Football Conference (NFC) and the American Football Conference (AFC), and its winner is awarded the Vince Lombardi Trophy.College football is the third-most popular sport in the United States, behind professional baseball and professional football. The NCAA, the largest collegiate organization, is divided into three Divisions: Division I, Division II and Division III. Division I football is further divided into two subdivisions: the Football Bowl Subdivision (FBS) and the Football Championship Subdivision (FCS). The champions of each level of play are determined through NCAA-sanctioned playoff systems; while the champion of Division I-FBS was historically determined by various polls and ranking systems, the subdivision adopted a four-team playoff system in 2014.High school football is the most popular sport in the United States played by boys; over 1.1 million boys participated in the sport from 2007 to 2008 according to a survey by the National Federation of State High School Associations (NFHS). There is a stark contrast in youth football participation between boys and girls. Only one youth football league exists in the United States for girls, the GFL. The NFHS is the largest organization for high school football, with member associations in all 50 states as well as the District of Columbia. USA Football is the governing body for youth and amateur football, and Pop Warner Little Scholars is the largest organization for youth football.\n\n\n=== Other professional leagues ===\n\n\n==== Rival leagues ====\nThe most successful league to directly compete with the NFL was the American Football League (AFL), which existed from 1960 to 1969. The AFL became a significant rival in 1964 before signing a five-year, US$36 million television deal with NBC. AFL teams began signing NFL players to contracts, and the league's popularity grew to challenge that of the NFL. The two leagues merged in the 1970 season, and all the AFL teams joined the NFL. An earlier league, the All-America Football Conference (AAFC), was in play from 1946 to 1949. After it had dissolved, two AAFC teams, the Cleveland Browns and the San Francisco 49ers, became members of the NFL; another member, the Baltimore Colts joined the league, but folded after just a year in the NFL.Other attempts to start rival leagues since the AFL merged with the NFL in 1970 have been far less successful, as professional football salaries and the NFL's television contracts began to escalate out of the reach of competitors and the NFL covered more of the larger cities. The World Football League (WFL) played for two seasons, in 1974 and 1975, but faced such severe monetary issues it could not pay its players. In its second and final season the WFL attempted to establish a stable credit rating, but the league disbanded before the season could be completed. The United States Football League (USFL) operated for three seasons from 1983 to 1985. Originally not intended as a rival league, the entry of owners who sought marquee talent and to challenge the NFL led to an escalation in salaries and ensuing financial losses. A subsequent US$1.5 billion antitrust lawsuit against the NFL was successful in court, but the league was awarded only $1 in damages, which was automatically tripled to $3 under antitrust law.\n\n\n==== Complementary national leagues ====\nThe original XFL, created in 2001 by Vince McMahon, lasted for only one season. Despite television contracts with NBC and UPN, and high expectations, the XFL suffered from low quality of play and poor reception for its use of tawdry professional wrestling gimmicks, which caused initially high ratings and attendance to collapse. The XFL was rebooted in 2020. However, after only five weeks of play, the league's operations slowly came to a close due to the ongoing COVID-19 pandemic, and filed for bankruptcy on April 13. The United Football League (UFL) began in 2009 but folded after suspending its 2012 season amid declining interest and lack of major television coverage. The Alliance of American Football lasted less than one season, unable to keep investors.\n\n\n=== International play ===\nAmerican football leagues exist throughout the world, but the game has yet to achieve the international success and popularity of baseball and basketball. It is not an Olympic sport, but it was a demonstration sport at the 1932 Summer Olympics. At the international level, Canada, Mexico, and Japan are considered to be second-tier, while Austria, Germany, and France would rank among a third tier. These countries rank far below the United States, which is dominant at the international level.NFL Europa, the developmental league of the NFL, operated from 1991 to 1992 and then from 1995 to 2007. At the time of its closure, NFL Europa had five teams based in Germany and one in the Netherlands. In Germany, the German Football League (GFL) has 16 teams and has operated for over 40 seasons, with the league's championship game, the German Bowl, closing out each season. The league operates in a promotion and relegation structure with German Football League 2 (GFL2), which also has 16 teams. The BIG6 European Football League functions as a continental championship for Europe. The competition is contested between the top six European teams.The United Kingdom also operated several teams within NFL Europe during the League's tenure. The resulting rise in popularity of the sport brought the NFL back to the country in 2007 where they now hold the NFL International Series in London, currently consisting of four regular season games. The continuing interest and growth in both the sport and the series has led to the possible formation of a potential NFL franchise in LondonAn American football league system already exists within the UK, the BAFANL, which has run under various guises since 1983. It currently has 70 teams operating across the tiers of contact football in which teams aim to earn promotion to the Division above, with the Premier Division teams competing to win the Britbowl, the annual British Football Bowl game that has been played since 1985. In 2007, the British Universities American Football League was formed. From 2008, the BUAFL was officially associated with the National Football League (NFL), through its partner organization NFL UK. In 2012, BUAFL's league and teams were absorbed into BUCS after American football became an official BUCS sport. Over the period 2007 to 2014, the BUAFL grew from 42 teams and 2,460 participants to 75 teams and over 4,100 people involved.American football federations are present in Africa, the Americas, Asia, Europe, and Oceania; a total of 75 national football federations exist as of 2023. The International Federation of American Football (IFAF), an international governing body composed of continental federations, runs tournaments such as the IFAF World Championship, the IFAF Women's World Championship, the IFAF U-19 World Championship, and the Flag Football World Championship. The IFAF also organizes the annual International Bowl game. The IFAF has received provisional recognition from the International Olympic Committee (IOC). Several major obstacles hinder the IFAF goal of achieving status as an Olympic sport. These include the predominant participation of men in international play and the short three-week Olympic schedule. Large team sizes are an additional difficulty, due to the Olympics' set limit of 10,500 athletes and coaches. American football also has an issue with a lack of global visibility. Nigel Melville, the CEO of USA Rugby, noted that \"American football is recognized globally as a sport, but it's not played globally.\" To solve these concerns, major effort has been put into promoting flag football, a modified version of American football, at the international level. Flag football has been shortlisted for appearance at the 2028 Summer Olympics, pending final approval by the International Olympic Committee.\n\n\n== Popularity and cultural influence ==\n\n\n=== United States ===\n\n\"Baseball is still called the national pastime, but football is by far the more popular sport in American society\", according to ESPN.com's Sean McAdam. In a 2014 poll conducted by Harris Interactive, professional football ranked as the most popular sport, and college football ranked third behind only professional football and baseball; 46% of participants ranked some form of the game as their favorite sport. Professional football has ranked as the most popular sport in the poll since 1985, when it surpassed baseball for the first time. Professional football is most popular among those who live in the eastern United States and rural areas, while college football is most popular in the southern United States and among people with graduate and post-graduate degrees. Football is also the most-played sport by high school and college athletes in the United States. As of 2022, the National Football Foundation reports nearly 1.04 million high-school athletes play the sport, with another 81,000 college athletes across both the NCAA and the NAIA; in comparison, the second-most played sport, basketball, had around 920,000 participants in high school and 63,000 in college.The Super Bowl is the most popular single-day sporting event in the United States, and is among the biggest club sporting events in the world in terms of TV viewership. The NFL made approximately $12 billion in revenue in 2022. Super Bowl games account for eight of the top ten most-watched broadcasts in American history; Super Bowl LVII, played on February 12, 2023, was watched by a record 115.1 million Americans, and is second only to the Apollo 11 moon landing (125 million viewers).American football also plays a significant role in American culture. The day on which the Super Bowl is held is considered a de facto national holiday, and in parts of the country like Texas, the sport has been compared to a religion. Football is also linked to other holidays; New Year's Day is traditionally the date for several college football bowl games, including the Rose Bowl. However, if New Year's Day is on a Sunday, the bowl games are moved to another date so as not to conflict with the typical NFL Sunday schedule. Thanksgiving football is another American tradition, hosting many high school, college, and professional games. Steve Deace of USA Today wrote that Americans are passionate about football \"because it embodies everything we love about American exceptionalism. Merit is rewarded, not punished. Masculinity is celebrated, not feminized. People of various beliefs and backgrounds – a melting pot, if you will – must unify for a common goal for the team to be successful\". Implicit rules such as playing through pain and sacrificing for the better of the team are promoted in football culture.\n\n\n=== Other countries ===\n\nIn Canada, the game has a significant following. According to a 2013 poll, 21% of respondents said they followed the NFL \"very closely\" or \"fairly closely\", making it the third-most followed league behind the National Hockey League (NHL) and Canadian Football League (CFL). American football also has a long history in Mexico, which was introduced to the sport in 1896. It was the second-most popular sport in Mexico in the 1950s, with the game being particularly popular in colleges. The Los Angeles Times notes the NFL claims over 16 million fans in Mexico, which places the country third behind the U.S. and Canada. American football is played in Mexico both professionally and as part of the college sports system. A professional league, the Liga de Fútbol Americano Profesional (LFA), was founded in 2016.Japan was introduced to the sport in 1934 by Paul Rusch, a teacher and Christian missionary who helped to establish football teams at three universities in Tokyo. Play was halted during World War II by order of Emperor Hirohito, but the sport began growing in popularity again after the war. As of 2010, there are more than 400 high school football teams in Japan, with over 15,000 participants, and over 100 teams play in the Kantoh Collegiate Football Association (KCFA). The X-League is the largest American football league in Japan, and the largest American football league in the world to use a promotion-relegation system. Some teams in the X-League, like the Panasonic Impulse, are sponsored by corporations, and all Japanese players on these teams are employed by the corporation. The league operates in separate spring and fall seasons, with each team playing five games. The top eight teams make the playoffs, which are played in Tokyo Dome; the champion is determined by the Rice Bowl.Europe is a major target for the expansion of the game by football organizers. In the United Kingdom in the 1980s, the sport was popular, with the 1986 Super Bowl being watched by over four million people (about 1 out of every 14 Britons). Its popularity faded during the 1990s, coinciding with the establishment of the Premier League—top level of the English football league system. According to BBC America, there is a \"social stigma\" surrounding American football in the UK, with many Brits feeling the sport has no right to call itself \"football\" due to the lack of emphasis on kicking. Nonetheless, the sport has retained a following in the United Kingdom; the NFL operates a media network in the country, and since 2007 has hosted the NFL International Series in London. Super Bowl viewership has also rebounded, with over 4.4 million Britons watching Super Bowl XLVI. The sport is played in European countries like Switzerland, which has American football clubs in every major city, and Germany, where the sport has around 45,000 registered amateur players.In Brazil, football is a growing sport. It was generally unknown there until the 1980s when a small group of players began playing on Copacabana Beach in Rio de Janeiro. The sport grew gradually with 700 amateur players registering within 20 years. Games were played on the beach with modified rules and without the traditional football equipment due to its lack of availability in Brazil. Eventually, a tournament, the Carioca championship, was founded, with the championship Carioca Bowl played to determine a league champion. The country saw its first full-pad game of football in October 2008. According to The Rio Times, the sport is one of the fastest-growing sports in Brazil and is almost as commonly played as soccer on the beaches of Copacabana and Botafogo.Football in Brazil is governed by the Confederação Brasileira de Futebol Americano (CBFA), which had over 5,000 registered players as of November 2013. The sport's increase in popularity has been attributed to games aired on ESPN, which began airing in Brazil in 1992 with Portuguese commentary. The popularity and \"easy accessibility\" of non-contact versions of the sport in Brazil has led to a rise in participation by female players. According to ESPN, the American football audience in Brazil increased 800% between 2013 and 2016. The network, along with Esporte Interativo, airs games there on cable television. Football is often associated in Brazil as being the sport of supermodel Gisele Bündchen's ex-husband Tom Brady. The NFL has expressed interest in having games in the country, and the Super Bowl has become a widely watched event in Brazil at bars and movie theaters.Further countries have also expressed interest in football to lesser degrees. The Arab world has expressed growing interest in American football, with many countries in the region being members of IFAF Asia. Jordan and the United Arab Emirates, which are not members of IFAF, have established their own domestic leagues. Egypt established two leagues for the sport, namely the Egyptian League of American Football and the Egyptian Federation of American Football, and Saudi Arabia hosts two teams based out of Jeddah and Yanbu respectively. China has additionally been a target for the expansion of the sport, with the Mainland being the home of the Chinese National Football League as well as a growing audience of Super Bowl watchers. Three franchises are also based out of Hong Kong, which prior to the COVID-19 pandemic regularly played mainland teams. NFL games average 900,000 viewers in China, though the league has cited logistical challenges which would prevent teams from playing games akin to abroad games in European countries.\n\n\n== Variations and related sports ==\n\nCanadian football, the predominant form of football in Canada, is closely related to American football—both sports developed from rugby and are considered to be the chief variants of gridiron football. Although both games share a similar set of rules, there are several key rule differences: for example, in Canadian football the field measures 150 by 65 yards (137 by 59 m), including two 20-yard end zones (for a distance between goal lines of 110 yards), teams have three downs instead of four, there are twelve players on each side instead of eleven, fair catches are not allowed, and a rouge, worth a single point is scored if the offensive team kicks the ball out of the defense's end zone. The Canadian Football League (CFL) is the major Canadian league and is the second-most popular sporting league in Canada, behind the National Hockey League. The NFL and CFL had a formal working relationship from 1997 to 2006. The CFL has a strategic partnership with two American football leagues, the German Football League (GFL) and the Liga de Futbol Americano Profesional (LFA). The Canadian rules were developed separately from the American game.\nIndoor football leagues constitute what The New York Times writer Mike Tanier described as the \"most minor of minor leagues.\" Leagues are unstable, with franchises regularly moving from one league to another or merging with other teams, and teams or entire leagues dissolving completely; games are only attended by a small number of fans, and most players are semi-professional athletes. The Indoor Football League is an example of a prominent indoor league. The Arena Football League, which was founded in 1987 and ceased operations in 2019, was one of the longest-lived indoor football leagues. In 2004, the league was called \"America's fifth major sport\" by ESPN The Magazine.There are several non-contact variants of football, such as flag football. In flag football the ballcarrier is not tackled; instead, defenders aim to pull a flag tied around the ballcarrier's waist. Another variant, touch football, simply requires the ballcarrier to be touched to be considered downed. Depending on the rules used, a game of touch football may require the ballcarrier be touched with either one or two hands to be considered downed.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== Footnotes ==\n\n\n== References ==\n\n\n== Further reading ==\nFootball: Great Writing About the National Sport, edited by John Schulian; 2014 (New York: Library of America; ISBN 978-1598533071).\n\n\n== External links ==\n\nAmerican football at Curlie\nNational Football League\nInternational Federation of American Football\nNFL 360, an introductory website to football rules\nExcerpts of a 1903 football game between the University of Chicago and University of Michigan"
]